{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Installation\n",
    "\n",
    "You will need Neo4j installed on your machine and running. It is assumed to be running on the localhost at port 7474 (the default for Neo4j)\n",
    "\n",
    "Some references I found for setting this notebook up\n",
    "\n",
    "* Seeting up juypter https://jupyter.readthedocs.io/en/latest/index.html\n",
    "* Python and Neo4j https://github.com/versae/ipython-cypher\n",
    "* Python and Neo4j https://ipython-cypher.readthedocs.io/en/latest/introduction.html#connections\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Cypher\n",
    "\n",
    "A quick reference guide\n",
    "\n",
    "* https://neo4j.com/docs/cypher-refcard/current/"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The following just gets the python environment loaded to allow this notebook to communicate with Neo4j and use basic cypher queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Nodes"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This command will delete all nodes. The \"DETACH\" bit will remove all relationships (more about these later). Do this now just to ensure that we start witha clean database when re-running\n",
    "\n",
    "**MATCH (n) DETACH DELETE n**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n) DETACH DELETE n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Graphs are based on nodes and edges. First simple command will return all nodes\n",
    "\n",
    "**MATCH (n) RETURN n **"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n) RETURN n "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This can be dangerous since no limit on number of nodes returned so we can limit the number returned\n",
    "\n",
    "**MATCH (n:Person) RETURN n LIMIT 5**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n) RETURN n LIMIT 5"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create a node with label Person. Return it.\n",
    "\n",
    "**CREATE (n:Person) RETURN n**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{}]]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 CREATE (n:Person) RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create a node with label Person with some properties and values. Return it. Note the return data\n",
    "\n",
    "**CREATE (n:Person {name: 'Andy', title: 'Developer'}) RETURN n**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "2 properties set.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Andy&#x27;, &#x27;title&#x27;: &#x27;Developer&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'name': 'Andy', 'title': 'Developer'}]]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 CREATE (n:Person {name: 'Andy', title: 'Developer'}) RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now return all the nodes we have created\n",
    "\n",
    "**MATCH (n:Person) RETURN n **"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Andy&#x27;, &#x27;title&#x27;: &#x27;Developer&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{}], [{'name': 'Andy', 'title': 'Developer'}]]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n:Person) RETURN n "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Note the node with no data. How do we get this node? How do we access the other node?\n",
    "\n",
    "**MATCH (n:Person) WHERE n.name = \"Andy\" RETURN n**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Andy&#x27;, &#x27;title&#x27;: &#x27;Developer&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'name': 'Andy', 'title': 'Developer'}]]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n:Person) WHERE n.name = \"Andy\" RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Find that node with no data\n",
    "\n",
    "**MATCH (n:Person) RETURN n,ID(n)**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "        <th>ID(n)</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{}</td>\n",
       "        <td>104</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Andy&#x27;, &#x27;title&#x27;: &#x27;Developer&#x27;}</td>\n",
       "        <td>233</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{}, 104], [{'name': 'Andy', 'title': 'Developer'}, 233]]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n:Person) RETURN n,ID(n)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "So set the name property in the node without any data\n",
    "\n",
    "** MATCH (n:Person) WHERE ID(n) = [ID From Above Result] SET n.name = \"Fred\" RETURN n**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n:Person) WHERE ID(n) = 95 SET n.name = \"Fred\" RETURN n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "        <th>ID(n)</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{}</td>\n",
       "        <td>104</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Andy&#x27;, &#x27;title&#x27;: &#x27;Developer&#x27;}</td>\n",
       "        <td>233</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{}, 104], [{'name': 'Andy', 'title': 'Developer'}, 233]]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n:Person) RETURN n,ID(n)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Relationships\n",
    "\n",
    "Now lets connect the two nodes\n",
    "\n",
    "**MATCH (n1:Person {name:'Andy'}), (n2:Person {name:'Fred'}) CREATE (n1)-[:KNOWS]->(n2)**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n1:Person {name:'Andy'}), (n2:Person {name:'Fred'}) CREATE (n1)-[:KNOWS]->(n2)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Clinical Data\n",
    "\n",
    "## Terminology Example\n",
    "\n",
    "Clean out the database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 nodes deleted.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n) DETACH DELETE n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Add a terminology concept node representing a CDISC code list item. This is for RACE code list and the 'WHITE' code list item."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "3 properties set.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White&#x27;, &#x27;identifier&#x27;: &#x27;C41261&#x27;, &#x27;submission&#x27;: &#x27;WHITE&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'C41261', 'preferred_term': 'White', 'submission': 'WHITE'}]]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 CREATE (n:Concept {identifier: 'C41261', submission: 'WHITE', preferred_term: 'White'}) RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create the code list item node for 'ASIAN'\n",
    "\n",
    "**CREATE (n:Concept {identifier: 'C41260', submission: 'ASIAN', preferred_term: 'Asian'}) RETURN n**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "3 properties set.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian&#x27;, &#x27;identifier&#x27;: &#x27;C41260&#x27;, &#x27;submission&#x27;: &#x27;ASIAN&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'C41260', 'preferred_term': 'Asian', 'submission': 'ASIAN'}]]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 CREATE (n:Concept {identifier: 'C41260', submission: 'ASIAN', preferred_term: 'Asian'}) RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Get the two concepts created\n",
    "\n",
    "**MATCH (n:Concept) RETURN n **"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian&#x27;, &#x27;identifier&#x27;: &#x27;C41260&#x27;, &#x27;submission&#x27;: &#x27;ASIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White&#x27;, &#x27;identifier&#x27;: &#x27;C41261&#x27;, &#x27;submission&#x27;: &#x27;WHITE&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'C41260', 'preferred_term': 'Asian', 'submission': 'ASIAN'}],\n",
       " [{'identifier': 'C41261', 'preferred_term': 'White', 'submission': 'WHITE'}]]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n:Concept) RETURN n "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now lets add the code list concept.\n",
    "\n",
    "**CREATE (n:Concept {identifier: 'C74457', submission: 'RACE', preferred_term: 'CDISC SDTM Race Terminology'}) RETURN n**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "3 properties set.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Race Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C74457&#x27;, &#x27;submission&#x27;: &#x27;RACE&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'C74457',\n",
       "   'preferred_term': 'CDISC SDTM Race Terminology',\n",
       "   'submission': 'RACE'}]]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 CREATE (n:Concept {identifier: 'C74457', submission: 'RACE', preferred_term: 'CDISC SDTM Race Terminology'}) RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now let's link the nodes\n",
    "\n",
    "**MATCH (cl:Concept {identifier:'C74457'}), (cli1:Concept {identifier:'C41261'}), (cli2:Concept {identifier:'C41260'}) CREATE (cl)-[:HAS_CHILD]->(cli1), (cl)-[:HAS_CHILD]->(cli2) **"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (cl:Concept {identifier:'C74457'}), (cli1:Concept {identifier:'C41261'}), (cli2:Concept {identifier:'C41260'}) CREATE (cl)-[:NARROWER]->(cli1), (cl)-[:NARROWER]->(cli2) "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "And see what we have. Note the **type(r)** return value. This gives the type of the relationship.\n",
    "\n",
    "**MATCH (p)-[r:HAS_CHILD]->(c) RETURN p, type(r), c **"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>p</th>\n",
       "        <th>type(r)</th>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Race Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C74457&#x27;, &#x27;submission&#x27;: &#x27;RACE&#x27;}</td>\n",
       "        <td>NARROWER</td>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian&#x27;, &#x27;identifier&#x27;: &#x27;C41260&#x27;, &#x27;submission&#x27;: &#x27;ASIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Race Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C74457&#x27;, &#x27;submission&#x27;: &#x27;RACE&#x27;}</td>\n",
       "        <td>NARROWER</td>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White&#x27;, &#x27;identifier&#x27;: &#x27;C41261&#x27;, &#x27;submission&#x27;: &#x27;WHITE&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'C74457',\n",
       "   'preferred_term': 'CDISC SDTM Race Terminology',\n",
       "   'submission': 'RACE'},\n",
       "  'NARROWER',\n",
       "  {'identifier': 'C41260', 'preferred_term': 'Asian', 'submission': 'ASIAN'}],\n",
       " [{'identifier': 'C74457',\n",
       "   'preferred_term': 'CDISC SDTM Race Terminology',\n",
       "   'submission': 'RACE'},\n",
       "  'NARROWER',\n",
       "  {'identifier': 'C41261', 'preferred_term': 'White', 'submission': 'WHITE'}]]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (p)-[r:NARROWER]->(c) RETURN p, type(r), c"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Add Some Complexity\n",
    "\n",
    "Now build a simple example linking collection, terminology and simple reporting. We will load the SEX code list and link it up. As part of this we will clean the database.\n",
    "\n",
    "**MATCH (n) DETACH DELETE n\n",
    "  WITH count(*) as dummy\n",
    "  LOAD CSV FROM \"https://www.dropbox.com/s/oqxh215khln96px/sex.csv?dl=1\" AS line\n",
    "  CREATE (:Concept { identifier: line[0], submission: line[1], preferred_term: line[2], synonym: line[3], definition: line[4] })**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 nodes created.\n",
      "3 nodes deleted.\n",
      "25 properties set.\n",
      "2 relationship deleted.\n",
      "5 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (n) DETACH DELETE n\n",
    "  WITH count(*) as dummy\n",
    "  LOAD CSV FROM \"https://www.dropbox.com/s/oqxh215khln96px/sex.csv?dl=1\" AS line\n",
    "  CREATE (:Concept { identifier: line[0], submission: line[1], preferred_term: line[2], synonym: line[3], definition: line[4] })\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query to see what we loaded.\n",
    "\n",
    "** MATCH (c:Concept) RETURN c**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Female&#x27;, &#x27;identifier&#x27;: &#x27;C16576&#x27;, &#x27;synonym&#x27;: &#x27;Female&#x27;, &#x27;submission&#x27;: &#x27;F&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Intersex  &#x27;, &#x27;identifier&#x27;: &#x27;C45908&#x27;, &#x27;synonym&#x27;: &#x27; &quot;A person (one of unisexual specimens) who is born with genitalia and/or secondary sexual characteristics of indeterminate sex&#x27;, &#x27;definition&#x27;: &#x27; or which combine features of both sexes. (NCI)&#x27;, &#x27;submission&#x27;: &#x27;UNDIFFERENTIATED&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Male&#x27;, &#x27;identifier&#x27;: &#x27;C20197&#x27;, &#x27;synonym&#x27;: &#x27;Male&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions&#x27;, &#x27;submission&#x27;: &#x27;M&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Unknown&#x27;, &#x27;identifier&#x27;: &#x27;C17998&#x27;, &#x27;synonym&#x27;: &#x27;U; UNK; Unknown&#x27;, &#x27;definition&#x27;: &#x27;Not known&#x27;, &#x27;submission&#x27;: &#x27;U&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Sex of Individual Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C66731&#x27;, &#x27;synonym&#x27;: &#x27;Sex&#x27;, &#x27;definition&#x27;: &#x27;The assemblage of physical properties or qualities by which male is distinguished from female; the physical difference between male and female; the distinguishing peculiarity of male or female. (NCI)&#x27;, &#x27;submission&#x27;: &#x27;SEX&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'definition': 'A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C16576',\n",
       "   'preferred_term': 'Female',\n",
       "   'submission': 'F',\n",
       "   'synonym': 'Female'}],\n",
       " [{'definition': ' or which combine features of both sexes. (NCI)',\n",
       "   'identifier': 'C45908',\n",
       "   'preferred_term': 'Intersex  ',\n",
       "   'submission': 'UNDIFFERENTIATED',\n",
       "   'synonym': ' \"A person (one of unisexual specimens) who is born with genitalia and/or secondary sexual characteristics of indeterminate sex'}],\n",
       " [{'definition': 'A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C20197',\n",
       "   'preferred_term': 'Male',\n",
       "   'submission': 'M',\n",
       "   'synonym': 'Male'}],\n",
       " [{'definition': 'Not known',\n",
       "   'identifier': 'C17998',\n",
       "   'preferred_term': 'Unknown',\n",
       "   'submission': 'U',\n",
       "   'synonym': 'U; UNK; Unknown'}],\n",
       " [{'definition': 'The assemblage of physical properties or qualities by which male is distinguished from female; the physical difference between male and female; the distinguishing peculiarity of male or female. (NCI)',\n",
       "   'identifier': 'C66731',\n",
       "   'preferred_term': 'CDISC SDTM Sex of Individual Terminology',\n",
       "   'submission': 'SEX',\n",
       "   'synonym': 'Sex'}]]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (c:Concept) RETURN c"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now link the code list with the items\n",
    "\n",
    "**MATCH (cl:Concept) WHERE cl.identifier = 'C66731'\n",
    "  WITH cl\n",
    "  MATCH (cli:Concept) WHERE cli.identifier <> 'C66731' \n",
    "  WITH cl, COLLECT(cli) as children\n",
    "  UNWIND children as child\n",
    "  CREATE (cl)-[:NARROWER]->(child)**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (cl:Concept) WHERE cl.identifier = 'C66731'\n",
    "  WITH cl\n",
    "  MATCH (cli:Concept) WHERE cli.identifier <> 'C66731' \n",
    "  WITH cl, COLLECT(cli) as children\n",
    "  UNWIND children as child\n",
    "  CREATE (cl)-[:NARROWER]->(child)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAecAAAFCCAYAAADL3BUJAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMS4wLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvpW3flQAAHMJJREFUeJzt3XtwVOX9x/HPJiSQyC1cclHQiEiR\naaJhiChmHeoAFSzUCGOlSoVWmt3eZ4zt0M60/+jgdPj1L2eyXAKBVhRaKE4FpI60aLhNwNqkeEcj\nWgkbyUUiCYbk/P44zUo4EEJ2k+fsnvfrn7DJ7sk3msOH5/s8+zw+y7IsAQAA10gyXQAAAOiOcAYA\nwGUIZwAAXIZwBgDAZQhnAABchnAGAMBlCGcAAFyGcAYAwGUIZwAAXIZwBgDAZQhnAABchnAGAMBl\nCGcAAFyGcAYAwGUIZwAAXIZwBgDAZQhnAABchnAGAMBlCGcAAFyGcAYAwGUIZwAAXIZwBgDAZQhn\nAABchnAGAMBlCGcAAFxmkOkCAFyFcFiqqJCqq6XmZmnECCk/X1q2TBo71nR1AGLEZ1mWZboIAFdQ\nVSWtXCnt3m0/bmv76mtpaZJlSXPnSitWSIWFZmoEEDOEM+B2ZWVSaanU2mqH8OX4fHZQr1olBYMD\nVx+AmKOtDbhZVzCfPXvl51qW/bzSUvsxAQ3ELUbOgFtVVUkzZ/YumC+Wni7t2ydNmxbzsgD0P1Zr\nA261cqXdyu6L1lb79QDiEiNnwI3CYemGG7ov/LpaQ4ZIJ06wihuIQ4ycATeqqIj+Gj5fbK4DYMAR\nzoAbVVdHN2qW7NZ2TU1s6gEwoAhnwI2am2NzncbG2FwHwIAinAE3GjEiNtfJyIjNdQAMKMIZcKP8\nfHtBVzTS0qS8vNjUA2BAsVobcCNWawOexsgZcKPMTHuvbJ+vb6/3+aR58whmIE4xcgbcih3CAM9i\n5Ay4VWGhfYhFevrVvS493X4dwQzELQ6+ANys6/AKTqUCPIW2NhAPjhyx98retcsO4Qv23D4raVBS\nklLvv98+z5kRMxD3CGcgntTXSxUVqt+7VwdfeklNkqol7cnKUvXJk/L1dQEZAFchnIE49OWXX2rk\nyJFqvWAEffz4cU2YMMFgVQBihQVhQBxKTU3VHXfc0e1zr732mqFqAMQa4QzEqaKiom6PKysrDVUC\nINYIZyBO+f3+bo8ZOQOJgzlnIE61tLRo5MiR6ujoiHzu1KlTyszMNFgVgFhg5AzEqaFDh6qgoKDb\n52htA4mBcAbiGK1tIDERzkAcY1EYkJiYcwbiWDgcVlZWVuRxcnKympqaNHToUINVAYgWI2cgjmVm\nZuprX/ta5HFHR4cOHjxosCIAsUA4A3GOeWcg8RDOQJxj3hlIPMw5A3Hugw8+0E033RR5nJaWpqam\nJqWmphqsCjAgHJYqKqTqaqm5WRoxQsrPl5Ytk8aONV3dVSGcgThnWZbGjRunTz/9NPK5gwcPOvbe\nBhJWVZV9pOru3fbjtravvpaWZp+DPneufaRqYaGZGq8SbW0gzvl8Puad4V1lZdLMmdKOHXYoXxjM\nkn32eVub/fWZM+3nxwHCGUgARUVFys7OVnp6un7zm9+ouLjYdElA/ysrk0pLpbNn7dFxTyzLfl5p\naVwENG1tIAG0t7dr0KBBWrJkiWbOnKnHHnvMdElA/6qqskfCZ89e/WvT06V9+6Rp02JeVqwwcgYS\nQEpKinw+n4qKimhpwxtWrrRb1n3R2mq/3sUYOQMJ5NixY1qwYIGOHz9uuhSg/4TD0g03OOeXr8aQ\nIdKJE65dxc3IGUggt9xyi5qamrqt3AYSTkVF9Nfw+WJznX5COAMJJCkpidY2El91dXSjZslubdfU\nxKaefkA4AwnG7/cTzkhszc2xuU5jY2yu0w8IZyDBFBUVsYUnEpZlWapvb4/NxTIyYnOdfkA4Awlm\n6tSpOn78uJqamkyXAsTMmTNntHr1ak2dOlW/37NHfXgDVXdpaVJeXixK6xeEM5BgUlNTVVhYqAMH\nDpguBYhadXW1fvSjH+m6665TIBDQG2+8oY2SfNFe2LKkpUujL7CfEM5AAmLeGfGstbVVmzZt0owZ\nM3TrrbeqrKxMZ86ciXy9XtJuSR19/QY+nzRvnmvfRiURzkBCIpwRj9599109/vjjGjdunB599FEd\nPHjwks9LSkpSpd8va/Dgvn2jtDT7EAwXYxMSIAG1tLQoKytLp0+f1pAhQ0yXA1xWe3u7duzYoVAo\npL179/b43OzsbD322GNavny5rr/++u57a/dWerq0apUUDEZZef8aZLoAALE3dOhQTZkyRVVVVY4T\nqwA3+Oijj7R27VqVl5errq6ux+fOmjVLgUBACxYsUEpKyldf6ArY0lL7fcs9jTV9PnvEHAfBLBHO\nQMLqam0TznCLjo4OvfTSSyorK9OuXbvUU+N21KhRWrZsmUpKSnTzzTdf/qLBoH1G88qV0q5ddghf\nuOd213nO8+bZrWwXH3ZxIcIZSFB+v19r1qwxXQaguro6lZeXa82aNTpx4kSPz50xY4aCwaAWLVrU\n+ymZadOkbduk+np7S86aGnuDkYwM++1SS5e6evHXpTDnDCSocDism2++WQ0NDUpOTjZdDjzGsizt\n3btXoVBIO3bs0Pnz5y/73GHDhmnJkiUqKSlRfn7+AFbpXoycgQSVmZmpnJwc1dTU6LbbbjNdDjzi\n9OnT2rhxo1avXq133323x+cWFBQoGAxq8eLFGjp06ABVGB8IZyCBdc07E87oT5Zl6dChQwqFQtqy\nZYvOnTt32ecOGTJEixcvViAQUGFhoXy+qLcTSUiEM5DA/H6/XnzxRf30pz81XQoS0Oeff65nn31W\noVBI1dXVPT538uTJCgQC+t73vqcMF+9p7RbMOQMJ7MMPP9SMGTP06aefMkJBzLzxxhsKhUJ69tln\n1dLSctnnpaSk6IEHHlAwGNTdd9/N7+BVYOQMJLDc3FwlJSXp+PHjmjhxoulyEMdaW1u1ZcsWhUIh\nHT58uMfn5ubmqqSkRMuWLVNWVtYAVZhYCGcggfl8Pvn9flVWVhLO6LO9e/dq4cKFPZ50lpSUpG99\n61sKBoOaM2eOkpLYHToa/NcDEhz7bCNakyZN6nbwxIVycnL029/+VrW1tXrhhRd07733EswxwJwz\nkOCqq6u1aNGiK76tBbjYBx98oDVr1mjDhg3y+Xw6depU5GuzZ89WIBDQ/Pnzu2+piZjgnzdAgvv6\n17+u+vr6K+5fDEjS+fPn9cILL2ju3LmaPn262tvb9eqrr2rr1q0aPXq0nnjiCb333nv6+9//rgce\neIBg7ieMnAEPuO+++7Rs2TItWrTIdClwqf/+978qLy/X2rVrNX78+MgWmmlpaZLs9zKfO3eOU84G\nCCNnwAO6FoUBF+rs7IyMgPPy8lRXV6cXX3xRBw4c0JIlSyLBLNmLCwnmgcNqbcAD/H6/fvazn5ku\nAy5RX1+viooKrV69WkOHDlUwGNTGjRs1bNgw06Xhf2hrAx5w7tw5jR49Wp9++qmGDx9uuhwYYFmW\nKisrFQqFtHPnThUXFysQCOj2229ncxAXoq0NeMDgwYM1depUHTx40HQpGGDNzc165plnlJeXp+XL\nl6uwsFAffvihNmzYoOnTpxPMLkU4Ax7B+5295ejRo3rssceUm5uryspKPfPMM3rrrbf0i1/8gr2t\n4wBzzoBH+P1+Pf3006bLQD/64osv9PzzzysUCqm+vl4lJSV6++232UIzDjHnDHjE559/rmuvvVan\nT5/W4MGDTZeDGDp27JhCoZA2b96soqIiBQIBzZkzR8nJyaZLQx/R1gY8Yvjw4Zo0aZKOHj1quhTE\nwLlz57R582bdfffdmj17tjIyMvSvf/0rsoEIwRzfaGsDHlJUVKTXXntNM2bMMF0K+uj48eORLTVv\nvfVW/fznP9eCBQvYqSvBMHIGPIRFYfHp/Pnz+utf/6pvfvObuuOOO9TZ2an9+/fr5Zdf1sKFCwnm\nBMScM+AhdXV1mjJlij777DNODooDn3zyidatW6d169YpNzdXgUBAixYtYqcuD+DuBDwkOztbo0eP\n1rFjx0yXgsvo7OzUnj17dP/99ys/P1+fffaZdu/ercrKSj3yyCMEs0cw5wx4TFdrOy8vz3QpuEA4\nHNaGDRu0evVqjRw5UsFgUH/60580dOhQ06XBAEbOgMd0LQqDeZZl6dVXX9XixYs1adIkvfPOO9qy\nZYuOHj2q5cuXE8wexpwz4DHvvfeevvGNb+jjjz9m60ZDmpqatGnTJoVCIUlSIBDQkiVL2LkLEbS1\nAY+ZOHGizp8/r48++ki5ubmmy/EMy7J05MgRhUIhbd++Xffee69CoZD8fj//SIID4Qx4jM/ni8w7\nE879r6WlRc8995xCoZAaGxtVUlKid955R5mZmaZLg4sx5wx4EPPO/e8///mPfvKTn+j666/Xzp07\n9dRTT+n999/Xr371K4IZV8TIGfAgv98fme9E7LS1tWnbtm0qKyvThx9+qOXLl6u6ulrjxo0zXRri\nDAvCAA/q6OjQqFGj9P7772vs2LGmy4l77733ntasWaONGzeqoKBAgUBA8+fP16BBjH/QN7S1AQ9K\nTk7WnXfeqf3795suJW61t7dr+/btmj17tu666y75fD4dOHBAe/bsUXFxMcGMqPDbA3hU16Kw+++/\n33QpceXjjz/W2rVrtW7dOk2cOFGBQEALFy7kGE7EFCNnwKNYFNZ7HR0d2r17t7797W/rtttuU2Nj\no15++WW9+uqr+u53v0swI+aYcwY8qrW1VWPGjNGpU6fYieoyTp06pfXr12vNmjUaPXq0gsGgHnro\nIV1zzTWmS0OCY+QMeFRaWppuu+02HTp0yHQprmJZlv75z3/qoYce0uTJk3X8+HH9+c9/1pEjR/SD\nH/yAYMaAYM4Z8DC/36/KykrNmjXLdCnGNTY2auPGjQqFQkpOTlYwGFQoFNLIkSNNlwYPYuQMeFjX\nojCvsixLhw8f1rJlyzRhwgRVVVVp7dq1kQ1ECGaYwpwz4GGNjY26/vrr1dDQoJSUFNPlDJiWlhZt\n3rxZoVBIzc3NCgQCWrp0Ke/5hmvQ1gY8LCMjQzfeeKNef/11TZ8+3XQ5/a66ulqhUEjPP/+8Zs6c\nqaefflqzZs1SUhJNRLgLv5GAxyV6a7utrU1//OMfddddd2nevHnKyspSTU2Ntm/frjlz5hDMcCV+\nKwGP61oUlmjeffddPf744xo/frw2b96sX/7yl6qtrdXvfvc7XXfddabLA3pEOAMeV1RUpMrKSnV2\ndpouJWrt7e36y1/+olmzZsnv9yslJUWHDx+ObCDClpqIF/ymAh43btw4DRs2TG+//bamTJliupw+\nOXHihNasWaPy8nJNmjRJwWBQxcXF7NyFuMXIGUBczjt3dHRo586dmj9/vgoKCnTmzBm98sor2rdv\nnx566CGCGXGNkTMA+f1+7du3TyUlJaZLuaK6urrIlppZWVkKBALasmWL0tPTTZcGxAwjZwCuXxRm\nWZb27t2rBx98ULfccotqa2u1bdu2yAYiBDMSDZuQAJBlWcrMzNTrr7+u8ePHmy4noqGhIbKlZmpq\nqgKBgB555BGNGDHCdGlAv2LkDEA+n881R0halqVDhw7p0Ucf1YQJE/T6669r/fr1qq6u1o9//GOC\nGZ5AOAOQZH5R2JkzZxQKhVRQUKAlS5YoLy9P77//fmQDEZ/PZ6w2YKCxIAyAJDucN2zYMODf99//\n/rfKysq0ZcsW3XPPPVq1apXuuecedu6CpxHOACRJBQUFqq2tVUNDg0aNGtWv36u1tVVbt25VKBTS\nJ598oh/+8Ic6duyYrr322n79vkC8IJwBSJIGDRqk6dOna//+/Zo/f36/fI933nlHq1ev1qZNm3T7\n7bfr17/+tebOncvOXcBFuCMARHyzoEBJq1ZJW7ZIzc3SiBFSfr60bJnUx+MUv/zyS+3YsUOhUEhv\nvvmmvv/976uqqko33nhjjKsHEgdvpQIgVVVJK1eqY+dOtbe3a8iFfy2kpUmWJc2dK61YIRUW9uqS\ntbW1Wrt2rdavX6/JkycrEAiouLhYqamp/fRDAImDcAa8rqxMKi2VWlvtEL4cn88O6lWrpGDwkk/p\n6OjQ7t27FQqFdOjQIS1ZskQlJSWaPHlyPxUPJCba2oCXdQXz2bNXfq5l2c8rLbUfXxDQJ0+eVHl5\nudauXaucnBwFAgFt3bqVnbuAPmLkDHhVVZU0c2bvgvli6enq/Mc/9I8zZ1RWVqZXXnlF3/nOd1RS\nUqKCgoKYlwp4DeEMeNUDD0g7dvTcyr6MTp9PL6en64kJExQMBvXwww9r+PDh/VAk4E2EM+BF4bB0\nww1SW1ufL9GZmirfxx/Ll5kZw8IASGzfCXhTRUXUl0hKTpZv48boawHgQDgDXlRdHdWoWZK9urum\nJjb1AOiG1dpAAuvs7NTp06d18uRJ1dXV6eTJkzp58qS+tX+/vh6Lb9DYGIurALgI4QzEoXPnzkXC\n9uKPF/45HA5r2LBhysnJUXZ2tnJycpSTk6OkUaOk2troC8nIiP4aABwIZ8AlLMtSc3OzI2AvFbot\nLS3KyspyhO7UqVO7fS4rK0uDBw92frPf/156883oWttpaVJeXt9fD+CyWK0N9LPz588rHA5fNmgv\n/JiSkhIJ2q6AvTB8u/48atSo6I5UjMFqbQ0ZIp040ec9twFcHuEM9FFLS0uPo9uujw0NDRo9evQV\nQzc7O1vXXHPNwP0AUbzPWT6fVFwsbdsW+7oAEM7AhS5cQHWl0D1//rwjcC8VvmPHjnXnkYhR7hCm\nffukadNiXhYAwhke0dbWplOnTl1xPjccDmv48OE9tpS7Pg4fPlw+n8/0jxadq9lbu0t6eo+HXwCI\nHuGMuGVZlpqamnoc3Xb9uaWlJdI67il0L7uAKpHF8FQqALFBOEcjHLZ3WqqujtnB9LAXUJ06darH\n+dyuPw8ePLjH0W3Xn6NeQJXojhyRVq6Udu2yQ7i19auvdZ3nPG+efZ4zrWyg3xHOffG/g+m1e7f9\n+MIVr308mN4LWlparvgWobq6OjU0NGjMmDG9Cl2OJIyx+nqpokI1mzdrUEuLbrnzTvvtUkuX8g9O\nYAARzleLFmA3nZ2d+uyzz3oc3XZ97OjouOJbhHJycjRmzBh3LqDykCeffFJtbW168sknTZcCeBJ/\nA16NGB1MPxA6OjpUX1/f4yh1xYoVuu+++y75+ra2NtXV1V1xPre+vl7Dhw93hG5ubq7uvPPObp9L\niAVUHtHZ2cn/K8Agwrm3qqquflWr9FVAFxbGZK6utbW1V63hcDisjo6OHq/13HPP6a233rrktb74\n4gvHCDc7O1vTpk1z7ECVmpoa9c8Fd7Esi3AGDCKce2vlyu6LZK5Ga6v9+sts2GBZlhoaGnrVGm5u\nbo7ih+ju6NGjyszMVHZ2tm699dZureWMjAwWUHkY4QyYRTj3RjhsL/7q6/S8Zanjb3/Tn1atUu0X\nX1wyfNvb22Nbcy8UFhbqD3/4w4B/X7ifZVn84wwwiHDujRgcTH+uvV01Tzyh/4u+ml4bNWpUj4uv\nJkyYMIDVIJ50dnYqOTnZdBmAZxHOvRGDg+nTJeXHoJRBgwb1ajON7Oxs722mgZihrQ2YRTj3Rozm\neUf28LVhw4Zd9q1FF4bu6NGjaTei39HWBswinHtjxIiYXGbMTTdpxYMPXjJ8B/Q0IuAKeCsVYBbh\n3Bv5+fZK6ygPpp9RUqIZTzwRu7qAfkJbGzCLvlVvLF0a/TUsKzbXAQYA4QyYRTj3RmamvVd2X/+y\n8vnsQwPYmxhxgjlnwCzuvt5ascLeK7sv0tLs1wNxgjlnwCzCubcKC+1DLK72FKSug+k5Zg9xhLY2\nYBYLwq5G1+EVnEqFBEdbGzCLu+9qBYPSvn1ScbE0ZIiz1Z2WZn++uNh+HsGMOERbGzCLkXNfTJtm\nv7XqfwfTq6ZGamyUMjI4mB4JgbY2YBbhHI2xYyXet4wERFsbMIu7D4ADbW3ALMIZgANtbcAswhmA\nA+EMmEU4A3Bgzhkwi7sPgANzzoBZhDMAB9ragFmEMwAH2tqAWdx9ABxoawNmEc4AHGhrA2YRzgAc\nCGfALMIZgANzzoBZ3H0AHJhzBswinAE40NYGzCKcATjQ1gbM4u4D4EBbGzCLcAbgQFsbMItwBuBA\nOANmEc4AHJhzBszi7gPgwJwzYBbhDMCBtjZgFuEMwIG2NmAWdx8AB9ragFmEMwAH2tqAWYQzAAfa\n2oBZ3H0AHGhrA2YRzgAcaGsDZhHOABwIZ8AswhmAA3POgFncfQAcmHMGzCKcATjQ1gbMIpwBONDW\nBszi7gPgQFsbMItwBuBAWxswi3AG4EA4A2YRzgAcmHMGzOLuA+DAnDNgFuEMwIG2NmAW4QzAgbY2\nYBZ3HwAH2tqAWYQzAAfa2oBZhDMAB8IZMItwBuDAnDNgFncfAAfmnAGzCGcADrS1AbMIZwAOtLUB\ns7j7ADjQ1gbMIpwBONDWBswinAE40NYGzOLuA+BAWxswi3AG4EBbGzCLcAbgQDgDZhHOAByYcwbM\n4u4D4MCcM2AW4QzAgbY2YBbhDMCBtjZgFncfAAfa2oBZhDMAB9ragFmEMwAHwhkwi3AG4MCcM2AW\ndx8AB+acAbMIZwAOtLUBswhnAA60tQGzuPsAONDWBswinAE40NYGzCKcATgQzoBZhDMAB+acAbO4\n+wA4MOcMmEU4A3CgrQ2YRTgDcKCtDZjF3QfAgbY2YBbhDMCBtjZgFuEMwIG2NmAWdx8AB9ragFmE\nM4CI8vJy5ebm6syZMyooKNBTTz1luiTAkwaZLgCAezQ1Nemjjz6SJNXW1ur06dOGKwK8iZEzgAjL\nsro9prUNmEE4A4i4OJxZFAaYwZ0HIKKzs7PbY0bOgBmEM4AI2tqAOxDOACIIZ8AdCGcAEcw5A+7A\nnQcggjlnwB0IZwARtLUBdyCcAUTQ1gbcgTsPQARtbcAdCGcAEbS1AXcgnAFE0NYG3IE7D0AEbW3A\nHQhnABG0tQF3IJwBRNDWBtyBOw9ABG1twB0IZwARtLUBdyCcAUQQzoA7EM4AIphzBtyBOw9ABHPO\ngDsQzgAiaGsD7kA4A4igrQ24A3cegAja2oA7DDJdAACXCIf1jSNHNE3SSElNknL37pUeflgaO9Zw\ncYC3+KyL+1gAvKWqSlq5Utq9W1+2tyu1oyPypfaUFKUkJ0tz50orVkiFhQYLBbyDcAa8rKxMKi2V\nWlulnv4q8PmktDRp1SopGBy4+gCPoq0NeFVXMJ89e+XnWpb9vNJS+zEBDfQrRs6AF1VVSTNn9i6Y\nL5aeLu3bJ02bFvOyANhYrQ140cqVdiu7L1pb7dcD6DeMnAGvCYelG26Q2tr6fo0hQ6QTJ1jFDfQT\nRs6A11RURH8Nny821wFwSYQz4DXV1dGNmiW7tV1TE5t6ADgQzoDXNDfH5jqNjbG5DgAHwhnwmhEj\nYnOdjIzYXAeAA+EMeE1+vr2gKxppaVJeXmzqAeDAam3Aa1itDbgeI2fAazIz7b2y+3rilM8nzZtH\nMAP9iJEz4EXsEAa4GiNnwIsKC+1DLNLTr+516en26whmoF9x8AXgVV2HV3AqFeA6tLUBrztyxN4r\ne9cuO4Qv3HM7Lc0O7Xnz7POcGTEDA4JwBmCrr7e35KypsTcYyciw3y61dCmLv4ABRjgDAOAyLAgD\nAMBlCGcAAFyGcAYAwGUIZwAAXIZwBgDAZQhnAABchnAGAMBlCGcAAFyGcAYAwGUIZwAAXIZwBgDA\nZQhnAABchnAGAMBlCGcAAFyGcAYAwGUIZwAAXIZwBgDAZQhnAABchnAGAMBlCGcAAFyGcAYAwGUI\nZwAAXIZwBgDAZQhnAABchnAGAMBlCGcAAFyGcAYAwGUIZwAAXIZwBgDAZQhnAABchnAGAMBlCGcA\nAFyGcAYAwGUIZwAAXIZwBgDAZQhnAABchnAGAMBlCGcAAFzm/wHDXBtNTg10OgAAAABJRU5ErkJg\ngg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x15188d9f98>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher http://neo4j:ld123@localhost:7474 MATCH (c:Concept)-[r:NARROWER]->(x:Concept) RETURN c,r,x\n",
    "g = results.get_graph()\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 nodes created.\n",
      "6 properties set.\n",
      "2 relationships created.\n",
      "3 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>s</th>\n",
       "        <th>ci</th>\n",
       "        <th>q</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;http://data.acmepharma.com/clinicaltrial/12345&#x27;, &#x27;name&#x27;: &#x27;Linked Data Wonder Drug&#x27;}</td>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;DM&#x27;, &#x27;name&#x27;: &#x27;Demographics&#x27;}</td>\n",
       "        <td>{&#x27;question_text&#x27;: &#x27;Sex?&#x27;, &#x27;identifier&#x27;: &#x27;Q1&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'http://data.acmepharma.com/clinicaltrial/12345',\n",
       "   'name': 'Linked Data Wonder Drug'},\n",
       "  {'identifier': 'DM', 'name': 'Demographics'},\n",
       "  {'identifier': 'Q1', 'question_text': 'Sex?'}]]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  CREATE (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345', name: 'Linked Data Wonder Drug'})-[:COLLECTS]->(ci:CollectionInstrument {identifier: 'DM', name: 'Demographics'})-[:HAS_QUESTION]->(q:Question {identifier: 'Q1', question_text: 'Sex?'})\n",
    "  RETURN s,ci,q"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>q</th>\n",
       "        <th>cli1</th>\n",
       "        <th>cli2</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;question_text&#x27;: &#x27;Sex?&#x27;, &#x27;identifier&#x27;: &#x27;Q1&#x27;}</td>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Female&#x27;, &#x27;identifier&#x27;: &#x27;C16576&#x27;, &#x27;synonym&#x27;: &#x27;Female&#x27;, &#x27;submission&#x27;: &#x27;F&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions&#x27;}</td>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Male&#x27;, &#x27;identifier&#x27;: &#x27;C20197&#x27;, &#x27;synonym&#x27;: &#x27;Male&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions&#x27;, &#x27;submission&#x27;: &#x27;M&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'Q1', 'question_text': 'Sex?'},\n",
       "  {'definition': 'A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C16576',\n",
       "   'preferred_term': 'Female',\n",
       "   'submission': 'F',\n",
       "   'synonym': 'Female'},\n",
       "  {'definition': 'A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C20197',\n",
       "   'preferred_term': 'Male',\n",
       "   'submission': 'M',\n",
       "   'synonym': 'Male'}]]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (q:Question {identifier: 'Q1'}), (cli1:Concept {identifier: 'C16576'}), (cli2:Concept {identifier: 'C20197'}) \n",
    "  CREATE UNIQUE (cli1)<-[:HAS_RESPONSE]-(q)-[:HAS_RESPONSE]->(cli2)\n",
    "  RETURN q,cli1,cli2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Simple query. List the terminology in my study\n",
    "\n",
    "**MATCH (s:Study)-[:COLLECTS]->(ci:CollectionInstrument)-[:HAS_QUESTION]->(q:Question)-[:HAS_RESPONSE]->(c:Concept) \n",
    "  RETURN q.identifier, c.identifier, c.submission**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>q.identifier</th>\n",
       "        <th>c.identifier</th>\n",
       "        <th>c.submission</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Q1</td>\n",
       "        <td>C16576</td>\n",
       "        <td>F</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Q1</td>\n",
       "        <td>C20197</td>\n",
       "        <td>M</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Q1', 'C16576', 'F'], ['Q1', 'C20197', 'M']]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study)-[:COLLECTS]->(ci:CollectionInstrument)-[:HAS_QUESTION]->(q:Question)-[:HAS_RESPONSE]->(c:Concept) \n",
    "  RETURN q.identifier, c.identifier, c.submission"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 nodes created.\n",
      "2 properties set.\n",
      "2 relationships created.\n",
      "2 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>s</th>\n",
       "        <th>sub1</th>\n",
       "        <th>sub2</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;http://data.acmepharma.com/clinicaltrial/12345&#x27;, &#x27;name&#x27;: &#x27;Linked Data Wonder Drug&#x27;}</td>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;1234&#x27;}</td>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;1235&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'http://data.acmepharma.com/clinicaltrial/12345',\n",
       "   'name': 'Linked Data Wonder Drug'},\n",
       "  {'identifier': '1234'},\n",
       "  {'identifier': '1235'}]]"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})\n",
    "  CREATE (s)<-[:PARTICIPATES_IN]-(sub1:Subject {identifier: '1234'})\n",
    "  WITH s, sub1\n",
    "  CREATE (s)<-[:PARTICIPATES_IN]-(sub2:Subject {identifier: '1235'})\n",
    "  RETURN s, sub1, sub2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "3 relationships created.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>sub</th>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;1234&#x27;}</td>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Female&#x27;, &#x27;identifier&#x27;: &#x27;C16576&#x27;, &#x27;synonym&#x27;: &#x27;Female&#x27;, &#x27;submission&#x27;: &#x27;F&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': '1234'},\n",
       "  {'definition': 'A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C16576',\n",
       "   'preferred_term': 'Female',\n",
       "   'submission': 'F',\n",
       "   'synonym': 'Female'}]]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (sub:Subject {identifier: '1234'}), (q:Question {identifier: 'Q1'})\n",
    "  CREATE (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q)\n",
    "  WITH sub,r\n",
    "  MATCH (c:Concept {identifier: 'C16576'})\n",
    "  CREATE (r)-[:VALUE]->(c)\n",
    "  RETURN sub, c"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>STUDY</th>\n",
       "        <th>SUBJID</th>\n",
       "        <th>SEX</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>F</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['http://data.acmepharma.com/clinicaltrial/12345', '1234', 'F']]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[]-(sub:Subject)-[]->(r:Response)-[]->(c:Concept)\n",
    "  RETURN s.identifier as STUDY, sub.identifier as SUBJID, c.submission as SEX"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "3 relationships created.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>sub</th>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;1235&#x27;}</td>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Female&#x27;, &#x27;identifier&#x27;: &#x27;C16576&#x27;, &#x27;synonym&#x27;: &#x27;Female&#x27;, &#x27;submission&#x27;: &#x27;F&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': '1235'},\n",
       "  {'definition': 'A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C16576',\n",
       "   'preferred_term': 'Female',\n",
       "   'submission': 'F',\n",
       "   'synonym': 'Female'}]]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (sub:Subject {identifier: '1235'}), (q:Question {identifier: 'Q1'})\n",
    "  CREATE (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q)\n",
    "  WITH sub,r\n",
    "  MATCH (c:Concept {identifier: 'C16576'})\n",
    "  CREATE (r)-[:VALUE]->(c)\n",
    "  RETURN sub, c"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "And now having linked everything we can query for some data\n",
    "\n",
    "**MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[]-(sub:Subject)-[]->(r:Response)-[]->(c:Concept)\n",
    "  RETURN s.identifier as STUDY, sub.identifier as SUBJID, c.submission as SEX**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>STUDY</th>\n",
       "        <th>SUBJID</th>\n",
       "        <th>SEX</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1235</td>\n",
       "        <td>F</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>F</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['http://data.acmepharma.com/clinicaltrial/12345', '1235', 'F'],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345', '1234', 'F']]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[]-(sub:Subject)-[]->(r:Response)-[]->(c:Concept)\n",
    "  RETURN s.identifier as STUDY, sub.identifier as SUBJID, c.submission as SEX"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "6 nodes created.\n",
      "24 properties set.\n",
      "6 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  LOAD CSV FROM \"https://www.dropbox.com/s/7ley89j6g6ng0ed/race.csv?dl=1\" AS line\n",
    "  CREATE (:Concept { identifier: line[0], submission: line[1], preferred_term: line[2], synonym: line[3], definition: line[4] })"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "11 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Female&#x27;, &#x27;identifier&#x27;: &#x27;C16576&#x27;, &#x27;synonym&#x27;: &#x27;Female&#x27;, &#x27;submission&#x27;: &#x27;F&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Intersex  &#x27;, &#x27;identifier&#x27;: &#x27;C45908&#x27;, &#x27;synonym&#x27;: &#x27; &quot;A person (one of unisexual specimens) who is born with genitalia and/or secondary sexual characteristics of indeterminate sex&#x27;, &#x27;definition&#x27;: &#x27; or which combine features of both sexes. (NCI)&#x27;, &#x27;submission&#x27;: &#x27;UNDIFFERENTIATED&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Male&#x27;, &#x27;identifier&#x27;: &#x27;C20197&#x27;, &#x27;synonym&#x27;: &#x27;Male&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions&#x27;, &#x27;submission&#x27;: &#x27;M&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Unknown&#x27;, &#x27;identifier&#x27;: &#x27;C17998&#x27;, &#x27;synonym&#x27;: &#x27;U; UNK; Unknown&#x27;, &#x27;definition&#x27;: &#x27;Not known&#x27;, &#x27;submission&#x27;: &#x27;U&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Sex of Individual Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C66731&#x27;, &#x27;synonym&#x27;: &#x27;Sex&#x27;, &#x27;definition&#x27;: &#x27;The assemblage of physical properties or qualities by which male is distinguished from female; the physical difference between male and female; the distinguishing peculiarity of male or female. (NCI)&#x27;, &#x27;submission&#x27;: &#x27;SEX&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Black or African American&#x27;, &#x27;identifier&#x27;: &#x27;C16352&#x27;, &#x27;submission&#x27;: &#x27;BLACK OR AFRICAN AMERICAN&#x27;, &#x27;definition&#x27;: &quot;A person having origins in any of the black racial groups of Africa. Terms such as &#x27;Haitian&#x27; or &#x27;Negro&#x27; can be used in addition to &#x27;Black or African American.&#x27; (FDA)&quot;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Native Hawaiian or Other Pacific Islander&#x27;, &#x27;identifier&#x27;: &#x27;C41219&#x27;, &#x27;submission&#x27;: &#x27;NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER&#x27;, &#x27;definition&#x27;: &#x27;Denotes a person having origins in any of the original peoples of Hawaii&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;American Indian or Alaska Native&#x27;, &#x27;identifier&#x27;: &#x27;C41259&#x27;, &#x27;submission&#x27;: &#x27;AMERICAN INDIAN OR ALASKA NATIVE&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of North and South America (including Central America)&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White&#x27;, &#x27;identifier&#x27;: &#x27;C41261&#x27;, &#x27;definition&#x27;: &#x27;Denotes a person with European&#x27;, &#x27;submission&#x27;: &#x27;WHITE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian&#x27;, &#x27;identifier&#x27;: &#x27;C41260&#x27;, &#x27;submission&#x27;: &#x27;ASIAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Far East&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Race Terminology Race&#x27;, &#x27;identifier&#x27;: &#x27;C74457&#x27;, &#x27;synonym&#x27;: &#x27;Terminology codelist used to identify the race of an individual within the Clinical Data Interchange Standards Consortium Study Data Tabulation Model.&#x27;, &#x27;submission&#x27;: &#x27;RACE&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'definition': 'A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C16576',\n",
       "   'preferred_term': 'Female',\n",
       "   'submission': 'F',\n",
       "   'synonym': 'Female'}],\n",
       " [{'definition': ' or which combine features of both sexes. (NCI)',\n",
       "   'identifier': 'C45908',\n",
       "   'preferred_term': 'Intersex  ',\n",
       "   'submission': 'UNDIFFERENTIATED',\n",
       "   'synonym': ' \"A person (one of unisexual specimens) who is born with genitalia and/or secondary sexual characteristics of indeterminate sex'}],\n",
       " [{'definition': 'A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C20197',\n",
       "   'preferred_term': 'Male',\n",
       "   'submission': 'M',\n",
       "   'synonym': 'Male'}],\n",
       " [{'definition': 'Not known',\n",
       "   'identifier': 'C17998',\n",
       "   'preferred_term': 'Unknown',\n",
       "   'submission': 'U',\n",
       "   'synonym': 'U; UNK; Unknown'}],\n",
       " [{'definition': 'The assemblage of physical properties or qualities by which male is distinguished from female; the physical difference between male and female; the distinguishing peculiarity of male or female. (NCI)',\n",
       "   'identifier': 'C66731',\n",
       "   'preferred_term': 'CDISC SDTM Sex of Individual Terminology',\n",
       "   'submission': 'SEX',\n",
       "   'synonym': 'Sex'}],\n",
       " [{'definition': \"A person having origins in any of the black racial groups of Africa. Terms such as 'Haitian' or 'Negro' can be used in addition to 'Black or African American.' (FDA)\",\n",
       "   'identifier': 'C16352',\n",
       "   'preferred_term': 'Black or African American',\n",
       "   'submission': 'BLACK OR AFRICAN AMERICAN'}],\n",
       " [{'definition': 'Denotes a person having origins in any of the original peoples of Hawaii',\n",
       "   'identifier': 'C41219',\n",
       "   'preferred_term': 'Native Hawaiian or Other Pacific Islander',\n",
       "   'submission': 'NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of North and South America (including Central America)',\n",
       "   'identifier': 'C41259',\n",
       "   'preferred_term': 'American Indian or Alaska Native',\n",
       "   'submission': 'AMERICAN INDIAN OR ALASKA NATIVE'}],\n",
       " [{'definition': 'Denotes a person with European',\n",
       "   'identifier': 'C41261',\n",
       "   'preferred_term': 'White',\n",
       "   'submission': 'WHITE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Far East',\n",
       "   'identifier': 'C41260',\n",
       "   'preferred_term': 'Asian',\n",
       "   'submission': 'ASIAN'}],\n",
       " [{'identifier': 'C74457',\n",
       "   'preferred_term': 'CDISC SDTM Race Terminology Race',\n",
       "   'submission': 'RACE',\n",
       "   'synonym': 'Terminology codelist used to identify the race of an individual within the Clinical Data Interchange Standards Consortium Study Data Tabulation Model.'}]]"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (c:Concept) RETURN c"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (cl:Concept) WHERE cl.identifier = 'C74457'\n",
    "  WITH cl\n",
    "  MATCH (cli:Concept) WHERE cli.identifier <> 'C74457' AND NOT (cli)--()\n",
    "  WITH cl, COLLECT(cli) as children\n",
    "  UNWIND children as child\n",
    "  CREATE (cl)-[:NARROWER]->(child)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "80 nodes created.\n",
      "322 properties set.\n",
      "80 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  LOAD CSV FROM \"https://www.dropbox.com/s/g7s92ebrlm6cxna/racec.csv?dl=1\" AS line\n",
    "  CREATE (:Concept { identifier: line[0], submission: line[1], preferred_term: line[2], synonym: line[3], definition: line[4] })"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "91 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Okinawan&#x27;, &#x27;identifier&#x27;: &#x27;C43717&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Okinawa.&#x27;, &#x27;submission&#x27;: &#x27;OKINAWAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Dominica Islander&#x27;, &#x27;identifier&#x27;: &#x27;C43824&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Dominica.&#x27;, &#x27;submission&#x27;: &#x27;DOMINICA ISLANDER&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Iwo Jiman&#x27;, &#x27;identifier&#x27;: &#x27;C43718&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Iwo Jima.&#x27;, &#x27;submission&#x27;: &#x27;IWO JIMAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Haitian&#x27;, &#x27;identifier&#x27;: &#x27;C43825&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Haiti.&#x27;, &#x27;submission&#x27;: &#x27;HAITIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Maldivian&#x27;, &#x27;identifier&#x27;: &#x27;C43719&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Maldives.&#x27;, &#x27;submission&#x27;: &#x27;MALDIVIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Jamaican&#x27;, &#x27;identifier&#x27;: &#x27;C43826&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Jamaica.&#x27;, &#x27;submission&#x27;: &#x27;JAMAICAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Greenland Eskimo&#x27;, &#x27;identifier&#x27;: &#x27;C44265&#x27;, &#x27;definition&#x27;: &#x27;The native people of Greenland.&#x27;, &#x27;submission&#x27;: &#x27;GREENLAND INUIT&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Mongolian&#x27;, &#x27;identifier&#x27;: &#x27;C43864&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Mongolia.&#x27;, &#x27;submission&#x27;: &#x27;MONGOLIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Tobagoan&#x27;, &#x27;identifier&#x27;: &#x27;C43827&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Tobago.&#x27;, &#x27;submission&#x27;: &#x27;TOBAGOAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Nepalese&#x27;, &#x27;identifier&#x27;: &#x27;C43720&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Nepal.&#x27;, &#x27;submission&#x27;: &#x27;NEPALESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Thai&#x27;, &#x27;identifier&#x27;: &#x27;C43400&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Thailand.&#x27;, &#x27;submission&#x27;: &#x27;THAI&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Trinidadian&#x27;, &#x27;identifier&#x27;: &#x27;C43828&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Trinidad.&#x27;, &#x27;submission&#x27;: &#x27;TRINIDADIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Singaporean&#x27;, &#x27;identifier&#x27;: &#x27;C43721&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Singapore.&#x27;, &#x27;submission&#x27;: &#x27;SINGAPOREAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Khoisan&#x27;, &#x27;identifier&#x27;: &#x27;C154874&#x27;, &#x27;definition&#x27;: &#x27;The native people of the Western Cape in southern Africa.&#x27;, &#x27;submission&#x27;: &#x27;KHOISAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian American&#x27;, &#x27;identifier&#x27;: &#x27;C16310&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of Asia and the United States.&#x27;, &#x27;submission&#x27;: &#x27;ASIAN AMERICAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;West Indian&#x27;, &#x27;identifier&#x27;: &#x27;C43829&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the West Indies.&#x27;, &#x27;submission&#x27;: &#x27;WEST INDIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Bangladeshi&#x27;, &#x27;identifier&#x27;: &#x27;C43671&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Bangladesh.&#x27;, &#x27;submission&#x27;: &#x27;BANGLADESHI&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Malagasy&#x27;, &#x27;identifier&#x27;: &#x27;C43722&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Madagascar.&#x27;, &#x27;submission&#x27;: &#x27;MALAGASY&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Aboriginal Australian&#x27;, &#x27;identifier&#x27;: &#x27;C154875&#x27;, &#x27;definition&#x27;: &#x27;The native people of Australia.&#x27;, &#x27;submission&#x27;: &#x27;ABORIGINAL AUSTRALIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Inupiat Eskimo&#x27;, &#x27;identifier&#x27;: &#x27;C44268&#x27;, &#x27;definition&#x27;: &#x27;The native people inhabiting the territory spanning the Norton Sound on the Bering Sea to the Canadian border.&#x27;, &#x27;submission&#x27;: &#x27;INUPIAT INUIT&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Micronesian&#x27;, &#x27;identifier&#x27;: &#x27;C43402&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Micronesia.&#x27;, &#x27;submission&#x27;: &#x27;MICRONESIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Caribbean Indian&#x27;, &#x27;identifier&#x27;: &#x27;C77810&#x27;, &#x27;definition&#x27;: &#x27;The native people of the Caribbean.&#x27;, &#x27;submission&#x27;: &#x27;CARIBBEAN INDIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Pakistani&#x27;, &#x27;identifier&#x27;: &#x27;C43427&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Pakistan.&#x27;, &#x27;submission&#x27;: &#x27;PAKISTANI&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Alaska Native&#x27;, &#x27;identifier&#x27;: &#x27;C18237&#x27;, &#x27;definition&#x27;: &#x27;The native people of Alaska.&#x27;, &#x27;submission&#x27;: &#x27;ALASKA NATIVE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Botswanan&#x27;, &#x27;identifier&#x27;: &#x27;C43830&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Botswana.&#x27;, &#x27;submission&#x27;: &#x27;BOTSWANAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Polynesian&#x27;, &#x27;identifier&#x27;: &#x27;C43405&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Polynesia.&#x27;, &#x27;submission&#x27;: &#x27;POLYNESIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Filipino&#x27;, &#x27;identifier&#x27;: &#x27;C43393&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Philippines.&#x27;, &#x27;submission&#x27;: &#x27;FILIPINO&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Chinese&#x27;, &#x27;identifier&#x27;: &#x27;C43391&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of China.&#x27;, &#x27;submission&#x27;: &#x27;CHINESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Taiwanese&#x27;, &#x27;identifier&#x27;: &#x27;C43675&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Taiwan.&#x27;, &#x27;submission&#x27;: &#x27;TAIWANESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;North Coast of Africa&#x27;, &#x27;identifier&#x27;: &#x27;C77813&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of North Africa.&#x27;, &#x27;submission&#x27;: &#x27;NORTH AFRICAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Bhutanese&#x27;, &#x27;identifier&#x27;: &#x27;C43673&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Bhutan.&#x27;, &#x27;submission&#x27;: &#x27;BHUTANESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Ethiopian&#x27;, &#x27;identifier&#x27;: &#x27;C43831&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Ethiopia.&#x27;, &#x27;submission&#x27;: &#x27;ETHIOPIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;European&#x27;, &#x27;identifier&#x27;: &#x27;C43851&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Europe.&#x27;, &#x27;submission&#x27;: &#x27;EUROPEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Unknown&#x27;, &#x27;identifier&#x27;: &#x27;C17998&#x27;, &#x27;synonym&#x27;: &#x27;U; UNK; Unknown&#x27;, &#x27;definition&#x27;: &#x27;Not known&#x27;, &#x27;submission&#x27;: &#x27;UNKNOWN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;American Indian or Alaska Native&#x27;, &#x27;identifier&#x27;: &#x27;C41259&#x27;, &#x27;submission&#x27;: &#x27;AMERICAN INDIAN OR ALASKA NATIVE&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of North and South America (including Central America)&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White Caribbean&#x27;, &#x27;identifier&#x27;: &#x27;C77816&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of Europe&#x27;, &#x27;submission&#x27;: &#x27;WHITE CARIBBEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Northern European&#x27;, &#x27;identifier&#x27;: &#x27;C77814&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Northern Europe.&#x27;, &#x27;submission&#x27;: &#x27;NORTHERN EUROPEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Zairean&#x27;, &#x27;identifier&#x27;: &#x27;C43835&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Zaire.&#x27;, &#x27;submission&#x27;: &#x27;ZAIREAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Namibian&#x27;, &#x27;identifier&#x27;: &#x27;C43833&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Namibia.&#x27;, &#x27;submission&#x27;: &#x27;NAMIBIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Burmese&#x27;, &#x27;identifier&#x27;: &#x27;C43674&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Myanmar (formerly Burma).&#x27;, &#x27;submission&#x27;: &#x27;BURMESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Sri Lankan&#x27;, &#x27;identifier&#x27;: &#x27;C43672&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Sri Lanka.&#x27;, &#x27;submission&#x27;: &#x27;SRI LANKAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Mediterranean&#x27;, &#x27;identifier&#x27;: &#x27;C77811&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the countries surrounding the Mediterranean sea.&#x27;, &#x27;submission&#x27;: &#x27;MEDITERRANEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Dominican&#x27;, &#x27;identifier&#x27;: &#x27;C67117&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Dominican Republic.&#x27;, &#x27;submission&#x27;: &#x27;DOMINICAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Yupik Eskimo&#x27;, &#x27;identifier&#x27;: &#x27;C44270&#x27;, &#x27;definition&#x27;: &#x27;The native people inhabiting western&#x27;, &#x27;submission&#x27;: &#x27;YUPIK ESKIMO&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Liberian&#x27;, &#x27;identifier&#x27;: &#x27;C43832&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Liberia.&#x27;, &#x27;submission&#x27;: &#x27;LIBERIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Native Hawaiian or Other Pacific Islander&#x27;, &#x27;identifier&#x27;: &#x27;C41219&#x27;, &#x27;submission&#x27;: &#x27;NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER&#x27;, &#x27;definition&#x27;: &#x27;Denotes a person having origins in any of the original peoples of Hawaii&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Melanesian&#x27;, &#x27;identifier&#x27;: &#x27;C43409&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Melanesia.&#x27;, &#x27;submission&#x27;: &#x27;MELANESIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Korean&#x27;, &#x27;identifier&#x27;: &#x27;C43395&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of North and South Korea.&#x27;, &#x27;submission&#x27;: &#x27;KOREAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Siberian Eskimo&#x27;, &#x27;identifier&#x27;: &#x27;C44269&#x27;, &#x27;definition&#x27;: &#x27;The native Yupik people inhabiting the coast of the Chukchi Peninsula in the far northeast of the Russian Federation and on St. Lawrence Island in Alaska.&#x27;, &#x27;submission&#x27;: &#x27;SIBERIAN ESKIMO&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Japanese&#x27;, &#x27;identifier&#x27;: &#x27;C43392&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Japan.&#x27;, &#x27;submission&#x27;: &#x27;JAPANESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian&#x27;, &#x27;identifier&#x27;: &#x27;C41260&#x27;, &#x27;submission&#x27;: &#x27;ASIAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Far East&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;African&#x27;, &#x27;identifier&#x27;: &#x27;C42331&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of sub-Saharan Africa.&#x27;, &#x27;submission&#x27;: &#x27;AFRICAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Black or African American&#x27;, &#x27;identifier&#x27;: &#x27;C16352&#x27;, &#x27;submission&#x27;: &#x27;BLACK OR AFRICAN AMERICAN&#x27;, &#x27;definition&#x27;: &quot;A person having origins in any of the black racial groups of Africa. Terms such as &#x27;Haitian&#x27; or &#x27;Negro&#x27; can be used in addition to &#x27;Black or African American.&#x27; (FDA)&quot;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Western European&#x27;, &#x27;identifier&#x27;: &#x27;C77817&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Western Europe.&#x27;, &#x27;submission&#x27;: &#x27;WESTERN EUROPEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Nigerian&#x27;, &#x27;identifier&#x27;: &#x27;C43834&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Nigeria.&#x27;, &#x27;submission&#x27;: &#x27;NIGERIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Collected Race Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C128689&#x27;, &#x27;synonym&#x27;: &#x27;Race As Collected&#x27;, &#x27;definition&#x27;: &#x27;A terminology codelist relevant to the race of an individual as collected on the case report form.&#x27;, &#x27;submission&#x27;: &#x27;RACEC&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Female&#x27;, &#x27;identifier&#x27;: &#x27;C16576&#x27;, &#x27;synonym&#x27;: &#x27;Female&#x27;, &#x27;submission&#x27;: &#x27;F&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Intersex  &#x27;, &#x27;identifier&#x27;: &#x27;C45908&#x27;, &#x27;synonym&#x27;: &#x27; &quot;A person (one of unisexual specimens) who is born with genitalia and/or secondary sexual characteristics of indeterminate sex&#x27;, &#x27;definition&#x27;: &#x27; or which combine features of both sexes. (NCI)&#x27;, &#x27;submission&#x27;: &#x27;UNDIFFERENTIATED&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Male&#x27;, &#x27;identifier&#x27;: &#x27;C20197&#x27;, &#x27;synonym&#x27;: &#x27;Male&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions&#x27;, &#x27;submission&#x27;: &#x27;M&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Unknown&#x27;, &#x27;identifier&#x27;: &#x27;C17998&#x27;, &#x27;synonym&#x27;: &#x27;U; UNK; Unknown&#x27;, &#x27;definition&#x27;: &#x27;Not known&#x27;, &#x27;submission&#x27;: &#x27;U&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Sex of Individual Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C66731&#x27;, &#x27;synonym&#x27;: &#x27;Sex&#x27;, &#x27;definition&#x27;: &#x27;The assemblage of physical properties or qualities by which male is distinguished from female; the physical difference between male and female; the distinguishing peculiarity of male or female. (NCI)&#x27;, &#x27;submission&#x27;: &#x27;SEX&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Black or African American&#x27;, &#x27;identifier&#x27;: &#x27;C16352&#x27;, &#x27;submission&#x27;: &#x27;BLACK OR AFRICAN AMERICAN&#x27;, &#x27;definition&#x27;: &quot;A person having origins in any of the black racial groups of Africa. Terms such as &#x27;Haitian&#x27; or &#x27;Negro&#x27; can be used in addition to &#x27;Black or African American.&#x27; (FDA)&quot;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Native Hawaiian or Other Pacific Islander&#x27;, &#x27;identifier&#x27;: &#x27;C41219&#x27;, &#x27;submission&#x27;: &#x27;NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER&#x27;, &#x27;definition&#x27;: &#x27;Denotes a person having origins in any of the original peoples of Hawaii&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;American Indian or Alaska Native&#x27;, &#x27;identifier&#x27;: &#x27;C41259&#x27;, &#x27;submission&#x27;: &#x27;AMERICAN INDIAN OR ALASKA NATIVE&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of North and South America (including Central America)&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White&#x27;, &#x27;identifier&#x27;: &#x27;C41261&#x27;, &#x27;definition&#x27;: &#x27;Denotes a person with European&#x27;, &#x27;submission&#x27;: &#x27;WHITE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian&#x27;, &#x27;identifier&#x27;: &#x27;C41260&#x27;, &#x27;submission&#x27;: &#x27;ASIAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Far East&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Race Terminology Race&#x27;, &#x27;identifier&#x27;: &#x27;C74457&#x27;, &#x27;synonym&#x27;: &#x27;Terminology codelist used to identify the race of an individual within the Clinical Data Interchange Standards Consortium Study Data Tabulation Model.&#x27;, &#x27;submission&#x27;: &#x27;RACE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Vietnamese&#x27;, &#x27;identifier&#x27;: &#x27;C43396&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Viet Nam.&#x27;, &#x27;submission&#x27;: &#x27;VIETNAMESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Bahamian&#x27;, &#x27;identifier&#x27;: &#x27;C67271&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Bahamas.&#x27;, &#x27;submission&#x27;: &#x27;BAHAMIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;South American Indian&#x27;, &#x27;identifier&#x27;: &#x27;C44953&#x27;, &#x27;definition&#x27;: &#x27;The native people of South America.&#x27;, &#x27;submission&#x27;: &#x27;SOUTH AMERICAN INDIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Russian&#x27;, &#x27;identifier&#x27;: &#x27;C43860&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Russia.&#x27;, &#x27;submission&#x27;: &#x27;RUSSIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White&#x27;, &#x27;identifier&#x27;: &#x27;C41261&#x27;, &#x27;definition&#x27;: &#x27;Denotes a person with European&#x27;, &#x27;submission&#x27;: &#x27;WHITE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Black South American&#x27;, &#x27;identifier&#x27;: &#x27;C128992&#x27;, &#x27;submission&#x27;: &#x27;BLACK SOUTH AMERICAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of sub-Saharan Africa and South America.&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Laotian&#x27;, &#x27;identifier&#x27;: &#x27;C43397&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Laos.&#x27;, &#x27;submission&#x27;: &#x27;LAOTIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Eastern European&#x27;, &#x27;identifier&#x27;: &#x27;C77819&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Eastern Europe.&#x27;, &#x27;submission&#x27;: &#x27;EASTERN EUROPEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian Indian&#x27;, &#x27;identifier&#x27;: &#x27;C41262&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Indian subcontinent.&#x27;, &#x27;submission&#x27;: &#x27;ASIAN INDIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;African American&#x27;, &#x27;identifier&#x27;: &#x27;C128937&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of sub-Saharan Africa and the United States.&#x27;, &#x27;submission&#x27;: &#x27;AFRICAN AMERICAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White Central American&#x27;, &#x27;identifier&#x27;: &#x27;C128993&#x27;, &#x27;submission&#x27;: &#x27;WHITE CENTRAL AMERICAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of Europe&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Hmong&#x27;, &#x27;identifier&#x27;: &#x27;C43398&#x27;, &#x27;submission&#x27;: &#x27;HMONG&#x27;, &#x27;definition&#x27;: &#x27;The native people originating in China around the Yellow River or Hoang Ho.&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Arab&#x27;, &#x27;identifier&#x27;: &#x27;C43876&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Arabian peninsula and surrounding territories in the Middle East and northern Africa.&#x27;, &#x27;submission&#x27;: &#x27;ARAB&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Central American Indian&#x27;, &#x27;identifier&#x27;: &#x27;C44950&#x27;, &#x27;submission&#x27;: &#x27;CENTRAL AMERICAN INDIAN&#x27;, &#x27;definition&#x27;: &#x27;The native people of Central America.&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;African Caribbean&#x27;, &#x27;identifier&#x27;: &#x27;C41226&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of sub-Saharan Africa and the Caribbean.&#x27;, &#x27;submission&#x27;: &#x27;AFRICAN CARIBBEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Black&#x27;, &#x27;identifier&#x27;: &#x27;C128938&#x27;, &#x27;submission&#x27;: &#x27;BLACK&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of sub-Saharan Africa or the Caribbean.&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White South American&#x27;, &#x27;identifier&#x27;: &#x27;C128994&#x27;, &#x27;submission&#x27;: &#x27;WHITE SOUTH AMERICAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of Europe&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Cambodian&#x27;, &#x27;identifier&#x27;: &#x27;C43399&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Cambodia (formerly Kampuchea).&#x27;, &#x27;submission&#x27;: &#x27;CAMBODIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Middle Eastern&#x27;, &#x27;identifier&#x27;: &#x27;C77820&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Middle East.&#x27;, &#x27;submission&#x27;: &#x27;MIDDLE EASTERN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;American Indian&#x27;, &#x27;identifier&#x27;: &#x27;C43877&#x27;, &#x27;definition&#x27;: &#x27;The native people of North America.&#x27;, &#x27;submission&#x27;: &#x27;AMERICAN INDIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Indonesian&#x27;, &#x27;identifier&#x27;: &#x27;C43715&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Indonesia.&#x27;, &#x27;submission&#x27;: &#x27;INDONESIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Malaysian&#x27;, &#x27;identifier&#x27;: &#x27;C43716&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Malaysia.&#x27;, &#x27;submission&#x27;: &#x27;MALAYSIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Barbadian&#x27;, &#x27;identifier&#x27;: &#x27;C43823&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Barbados.&#x27;, &#x27;submission&#x27;: &#x27;BARBADIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Black Central American&#x27;, &#x27;identifier&#x27;: &#x27;C128991&#x27;, &#x27;submission&#x27;: &#x27;BLACK CENTRAL AMERICAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of sub-Saharan Africa and Central America.&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'definition': 'A person having origins in any of the original peoples of Okinawa.',\n",
       "   'identifier': 'C43717',\n",
       "   'preferred_term': 'Okinawan',\n",
       "   'submission': 'OKINAWAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Dominica.',\n",
       "   'identifier': 'C43824',\n",
       "   'preferred_term': 'Dominica Islander',\n",
       "   'submission': 'DOMINICA ISLANDER'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Iwo Jima.',\n",
       "   'identifier': 'C43718',\n",
       "   'preferred_term': 'Iwo Jiman',\n",
       "   'submission': 'IWO JIMAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Haiti.',\n",
       "   'identifier': 'C43825',\n",
       "   'preferred_term': 'Haitian',\n",
       "   'submission': 'HAITIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Maldives.',\n",
       "   'identifier': 'C43719',\n",
       "   'preferred_term': 'Maldivian',\n",
       "   'submission': 'MALDIVIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Jamaica.',\n",
       "   'identifier': 'C43826',\n",
       "   'preferred_term': 'Jamaican',\n",
       "   'submission': 'JAMAICAN'}],\n",
       " [{'definition': 'The native people of Greenland.',\n",
       "   'identifier': 'C44265',\n",
       "   'preferred_term': 'Greenland Eskimo',\n",
       "   'submission': 'GREENLAND INUIT'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Mongolia.',\n",
       "   'identifier': 'C43864',\n",
       "   'preferred_term': 'Mongolian',\n",
       "   'submission': 'MONGOLIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Tobago.',\n",
       "   'identifier': 'C43827',\n",
       "   'preferred_term': 'Tobagoan',\n",
       "   'submission': 'TOBAGOAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Nepal.',\n",
       "   'identifier': 'C43720',\n",
       "   'preferred_term': 'Nepalese',\n",
       "   'submission': 'NEPALESE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Thailand.',\n",
       "   'identifier': 'C43400',\n",
       "   'preferred_term': 'Thai',\n",
       "   'submission': 'THAI'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Trinidad.',\n",
       "   'identifier': 'C43828',\n",
       "   'preferred_term': 'Trinidadian',\n",
       "   'submission': 'TRINIDADIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Singapore.',\n",
       "   'identifier': 'C43721',\n",
       "   'preferred_term': 'Singaporean',\n",
       "   'submission': 'SINGAPOREAN'}],\n",
       " [{'definition': 'The native people of the Western Cape in southern Africa.',\n",
       "   'identifier': 'C154874',\n",
       "   'preferred_term': 'Khoisan',\n",
       "   'submission': 'KHOISAN'}],\n",
       " [{'definition': 'A person having origins in the original peoples of Asia and the United States.',\n",
       "   'identifier': 'C16310',\n",
       "   'preferred_term': 'Asian American',\n",
       "   'submission': 'ASIAN AMERICAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the West Indies.',\n",
       "   'identifier': 'C43829',\n",
       "   'preferred_term': 'West Indian',\n",
       "   'submission': 'WEST INDIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Bangladesh.',\n",
       "   'identifier': 'C43671',\n",
       "   'preferred_term': 'Bangladeshi',\n",
       "   'submission': 'BANGLADESHI'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Madagascar.',\n",
       "   'identifier': 'C43722',\n",
       "   'preferred_term': 'Malagasy',\n",
       "   'submission': 'MALAGASY'}],\n",
       " [{'definition': 'The native people of Australia.',\n",
       "   'identifier': 'C154875',\n",
       "   'preferred_term': 'Aboriginal Australian',\n",
       "   'submission': 'ABORIGINAL AUSTRALIAN'}],\n",
       " [{'definition': 'The native people inhabiting the territory spanning the Norton Sound on the Bering Sea to the Canadian border.',\n",
       "   'identifier': 'C44268',\n",
       "   'preferred_term': 'Inupiat Eskimo',\n",
       "   'submission': 'INUPIAT INUIT'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Micronesia.',\n",
       "   'identifier': 'C43402',\n",
       "   'preferred_term': 'Micronesian',\n",
       "   'submission': 'MICRONESIAN'}],\n",
       " [{'definition': 'The native people of the Caribbean.',\n",
       "   'identifier': 'C77810',\n",
       "   'preferred_term': 'Caribbean Indian',\n",
       "   'submission': 'CARIBBEAN INDIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Pakistan.',\n",
       "   'identifier': 'C43427',\n",
       "   'preferred_term': 'Pakistani',\n",
       "   'submission': 'PAKISTANI'}],\n",
       " [{'definition': 'The native people of Alaska.',\n",
       "   'identifier': 'C18237',\n",
       "   'preferred_term': 'Alaska Native',\n",
       "   'submission': 'ALASKA NATIVE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Botswana.',\n",
       "   'identifier': 'C43830',\n",
       "   'preferred_term': 'Botswanan',\n",
       "   'submission': 'BOTSWANAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Polynesia.',\n",
       "   'identifier': 'C43405',\n",
       "   'preferred_term': 'Polynesian',\n",
       "   'submission': 'POLYNESIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Philippines.',\n",
       "   'identifier': 'C43393',\n",
       "   'preferred_term': 'Filipino',\n",
       "   'submission': 'FILIPINO'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of China.',\n",
       "   'identifier': 'C43391',\n",
       "   'preferred_term': 'Chinese',\n",
       "   'submission': 'CHINESE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Taiwan.',\n",
       "   'identifier': 'C43675',\n",
       "   'preferred_term': 'Taiwanese',\n",
       "   'submission': 'TAIWANESE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of North Africa.',\n",
       "   'identifier': 'C77813',\n",
       "   'preferred_term': 'North Coast of Africa',\n",
       "   'submission': 'NORTH AFRICAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Bhutan.',\n",
       "   'identifier': 'C43673',\n",
       "   'preferred_term': 'Bhutanese',\n",
       "   'submission': 'BHUTANESE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Ethiopia.',\n",
       "   'identifier': 'C43831',\n",
       "   'preferred_term': 'Ethiopian',\n",
       "   'submission': 'ETHIOPIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Europe.',\n",
       "   'identifier': 'C43851',\n",
       "   'preferred_term': 'European',\n",
       "   'submission': 'EUROPEAN'}],\n",
       " [{'definition': 'Not known',\n",
       "   'identifier': 'C17998',\n",
       "   'preferred_term': 'Unknown',\n",
       "   'submission': 'UNKNOWN',\n",
       "   'synonym': 'U; UNK; Unknown'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of North and South America (including Central America)',\n",
       "   'identifier': 'C41259',\n",
       "   'preferred_term': 'American Indian or Alaska Native',\n",
       "   'submission': 'AMERICAN INDIAN OR ALASKA NATIVE'}],\n",
       " [{'definition': 'A person having origins in the original peoples of Europe',\n",
       "   'identifier': 'C77816',\n",
       "   'preferred_term': 'White Caribbean',\n",
       "   'submission': 'WHITE CARIBBEAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Northern Europe.',\n",
       "   'identifier': 'C77814',\n",
       "   'preferred_term': 'Northern European',\n",
       "   'submission': 'NORTHERN EUROPEAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Zaire.',\n",
       "   'identifier': 'C43835',\n",
       "   'preferred_term': 'Zairean',\n",
       "   'submission': 'ZAIREAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Namibia.',\n",
       "   'identifier': 'C43833',\n",
       "   'preferred_term': 'Namibian',\n",
       "   'submission': 'NAMIBIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Myanmar (formerly Burma).',\n",
       "   'identifier': 'C43674',\n",
       "   'preferred_term': 'Burmese',\n",
       "   'submission': 'BURMESE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Sri Lanka.',\n",
       "   'identifier': 'C43672',\n",
       "   'preferred_term': 'Sri Lankan',\n",
       "   'submission': 'SRI LANKAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the countries surrounding the Mediterranean sea.',\n",
       "   'identifier': 'C77811',\n",
       "   'preferred_term': 'Mediterranean',\n",
       "   'submission': 'MEDITERRANEAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Dominican Republic.',\n",
       "   'identifier': 'C67117',\n",
       "   'preferred_term': 'Dominican',\n",
       "   'submission': 'DOMINICAN'}],\n",
       " [{'definition': 'The native people inhabiting western',\n",
       "   'identifier': 'C44270',\n",
       "   'preferred_term': 'Yupik Eskimo',\n",
       "   'submission': 'YUPIK ESKIMO'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Liberia.',\n",
       "   'identifier': 'C43832',\n",
       "   'preferred_term': 'Liberian',\n",
       "   'submission': 'LIBERIAN'}],\n",
       " [{'definition': 'Denotes a person having origins in any of the original peoples of Hawaii',\n",
       "   'identifier': 'C41219',\n",
       "   'preferred_term': 'Native Hawaiian or Other Pacific Islander',\n",
       "   'submission': 'NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Melanesia.',\n",
       "   'identifier': 'C43409',\n",
       "   'preferred_term': 'Melanesian',\n",
       "   'submission': 'MELANESIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of North and South Korea.',\n",
       "   'identifier': 'C43395',\n",
       "   'preferred_term': 'Korean',\n",
       "   'submission': 'KOREAN'}],\n",
       " [{'definition': 'The native Yupik people inhabiting the coast of the Chukchi Peninsula in the far northeast of the Russian Federation and on St. Lawrence Island in Alaska.',\n",
       "   'identifier': 'C44269',\n",
       "   'preferred_term': 'Siberian Eskimo',\n",
       "   'submission': 'SIBERIAN ESKIMO'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Japan.',\n",
       "   'identifier': 'C43392',\n",
       "   'preferred_term': 'Japanese',\n",
       "   'submission': 'JAPANESE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Far East',\n",
       "   'identifier': 'C41260',\n",
       "   'preferred_term': 'Asian',\n",
       "   'submission': 'ASIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of sub-Saharan Africa.',\n",
       "   'identifier': 'C42331',\n",
       "   'preferred_term': 'African',\n",
       "   'submission': 'AFRICAN'}],\n",
       " [{'definition': \"A person having origins in any of the black racial groups of Africa. Terms such as 'Haitian' or 'Negro' can be used in addition to 'Black or African American.' (FDA)\",\n",
       "   'identifier': 'C16352',\n",
       "   'preferred_term': 'Black or African American',\n",
       "   'submission': 'BLACK OR AFRICAN AMERICAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Western Europe.',\n",
       "   'identifier': 'C77817',\n",
       "   'preferred_term': 'Western European',\n",
       "   'submission': 'WESTERN EUROPEAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Nigeria.',\n",
       "   'identifier': 'C43834',\n",
       "   'preferred_term': 'Nigerian',\n",
       "   'submission': 'NIGERIAN'}],\n",
       " [{'definition': 'A terminology codelist relevant to the race of an individual as collected on the case report form.',\n",
       "   'identifier': 'C128689',\n",
       "   'preferred_term': 'CDISC SDTM Collected Race Terminology',\n",
       "   'submission': 'RACEC',\n",
       "   'synonym': 'Race As Collected'}],\n",
       " [{'definition': 'A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C16576',\n",
       "   'preferred_term': 'Female',\n",
       "   'submission': 'F',\n",
       "   'synonym': 'Female'}],\n",
       " [{'definition': ' or which combine features of both sexes. (NCI)',\n",
       "   'identifier': 'C45908',\n",
       "   'preferred_term': 'Intersex  ',\n",
       "   'submission': 'UNDIFFERENTIATED',\n",
       "   'synonym': ' \"A person (one of unisexual specimens) who is born with genitalia and/or secondary sexual characteristics of indeterminate sex'}],\n",
       " [{'definition': 'A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C20197',\n",
       "   'preferred_term': 'Male',\n",
       "   'submission': 'M',\n",
       "   'synonym': 'Male'}],\n",
       " [{'definition': 'Not known',\n",
       "   'identifier': 'C17998',\n",
       "   'preferred_term': 'Unknown',\n",
       "   'submission': 'U',\n",
       "   'synonym': 'U; UNK; Unknown'}],\n",
       " [{'definition': 'The assemblage of physical properties or qualities by which male is distinguished from female; the physical difference between male and female; the distinguishing peculiarity of male or female. (NCI)',\n",
       "   'identifier': 'C66731',\n",
       "   'preferred_term': 'CDISC SDTM Sex of Individual Terminology',\n",
       "   'submission': 'SEX',\n",
       "   'synonym': 'Sex'}],\n",
       " [{'definition': \"A person having origins in any of the black racial groups of Africa. Terms such as 'Haitian' or 'Negro' can be used in addition to 'Black or African American.' (FDA)\",\n",
       "   'identifier': 'C16352',\n",
       "   'preferred_term': 'Black or African American',\n",
       "   'submission': 'BLACK OR AFRICAN AMERICAN'}],\n",
       " [{'definition': 'Denotes a person having origins in any of the original peoples of Hawaii',\n",
       "   'identifier': 'C41219',\n",
       "   'preferred_term': 'Native Hawaiian or Other Pacific Islander',\n",
       "   'submission': 'NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of North and South America (including Central America)',\n",
       "   'identifier': 'C41259',\n",
       "   'preferred_term': 'American Indian or Alaska Native',\n",
       "   'submission': 'AMERICAN INDIAN OR ALASKA NATIVE'}],\n",
       " [{'definition': 'Denotes a person with European',\n",
       "   'identifier': 'C41261',\n",
       "   'preferred_term': 'White',\n",
       "   'submission': 'WHITE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Far East',\n",
       "   'identifier': 'C41260',\n",
       "   'preferred_term': 'Asian',\n",
       "   'submission': 'ASIAN'}],\n",
       " [{'identifier': 'C74457',\n",
       "   'preferred_term': 'CDISC SDTM Race Terminology Race',\n",
       "   'submission': 'RACE',\n",
       "   'synonym': 'Terminology codelist used to identify the race of an individual within the Clinical Data Interchange Standards Consortium Study Data Tabulation Model.'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Viet Nam.',\n",
       "   'identifier': 'C43396',\n",
       "   'preferred_term': 'Vietnamese',\n",
       "   'submission': 'VIETNAMESE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Bahamas.',\n",
       "   'identifier': 'C67271',\n",
       "   'preferred_term': 'Bahamian',\n",
       "   'submission': 'BAHAMIAN'}],\n",
       " [{'definition': 'The native people of South America.',\n",
       "   'identifier': 'C44953',\n",
       "   'preferred_term': 'South American Indian',\n",
       "   'submission': 'SOUTH AMERICAN INDIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Russia.',\n",
       "   'identifier': 'C43860',\n",
       "   'preferred_term': 'Russian',\n",
       "   'submission': 'RUSSIAN'}],\n",
       " [{'definition': 'Denotes a person with European',\n",
       "   'identifier': 'C41261',\n",
       "   'preferred_term': 'White',\n",
       "   'submission': 'WHITE'}],\n",
       " [{'definition': 'A person having origins in the original peoples of sub-Saharan Africa and South America.',\n",
       "   'identifier': 'C128992',\n",
       "   'preferred_term': 'Black South American',\n",
       "   'submission': 'BLACK SOUTH AMERICAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Laos.',\n",
       "   'identifier': 'C43397',\n",
       "   'preferred_term': 'Laotian',\n",
       "   'submission': 'LAOTIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Eastern Europe.',\n",
       "   'identifier': 'C77819',\n",
       "   'preferred_term': 'Eastern European',\n",
       "   'submission': 'EASTERN EUROPEAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Indian subcontinent.',\n",
       "   'identifier': 'C41262',\n",
       "   'preferred_term': 'Asian Indian',\n",
       "   'submission': 'ASIAN INDIAN'}],\n",
       " [{'definition': 'A person having origins in the original peoples of sub-Saharan Africa and the United States.',\n",
       "   'identifier': 'C128937',\n",
       "   'preferred_term': 'African American',\n",
       "   'submission': 'AFRICAN AMERICAN'}],\n",
       " [{'definition': 'A person having origins in the original peoples of Europe',\n",
       "   'identifier': 'C128993',\n",
       "   'preferred_term': 'White Central American',\n",
       "   'submission': 'WHITE CENTRAL AMERICAN'}],\n",
       " [{'definition': 'The native people originating in China around the Yellow River or Hoang Ho.',\n",
       "   'identifier': 'C43398',\n",
       "   'preferred_term': 'Hmong',\n",
       "   'submission': 'HMONG'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Arabian peninsula and surrounding territories in the Middle East and northern Africa.',\n",
       "   'identifier': 'C43876',\n",
       "   'preferred_term': 'Arab',\n",
       "   'submission': 'ARAB'}],\n",
       " [{'definition': 'The native people of Central America.',\n",
       "   'identifier': 'C44950',\n",
       "   'preferred_term': 'Central American Indian',\n",
       "   'submission': 'CENTRAL AMERICAN INDIAN'}],\n",
       " [{'definition': 'A person having origins in the original peoples of sub-Saharan Africa and the Caribbean.',\n",
       "   'identifier': 'C41226',\n",
       "   'preferred_term': 'African Caribbean',\n",
       "   'submission': 'AFRICAN CARIBBEAN'}],\n",
       " [{'definition': 'A person having origins in the original peoples of sub-Saharan Africa or the Caribbean.',\n",
       "   'identifier': 'C128938',\n",
       "   'preferred_term': 'Black',\n",
       "   'submission': 'BLACK'}],\n",
       " [{'definition': 'A person having origins in the original peoples of Europe',\n",
       "   'identifier': 'C128994',\n",
       "   'preferred_term': 'White South American',\n",
       "   'submission': 'WHITE SOUTH AMERICAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Cambodia (formerly Kampuchea).',\n",
       "   'identifier': 'C43399',\n",
       "   'preferred_term': 'Cambodian',\n",
       "   'submission': 'CAMBODIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Middle East.',\n",
       "   'identifier': 'C77820',\n",
       "   'preferred_term': 'Middle Eastern',\n",
       "   'submission': 'MIDDLE EASTERN'}],\n",
       " [{'definition': 'The native people of North America.',\n",
       "   'identifier': 'C43877',\n",
       "   'preferred_term': 'American Indian',\n",
       "   'submission': 'AMERICAN INDIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Indonesia.',\n",
       "   'identifier': 'C43715',\n",
       "   'preferred_term': 'Indonesian',\n",
       "   'submission': 'INDONESIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Malaysia.',\n",
       "   'identifier': 'C43716',\n",
       "   'preferred_term': 'Malaysian',\n",
       "   'submission': 'MALAYSIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Barbados.',\n",
       "   'identifier': 'C43823',\n",
       "   'preferred_term': 'Barbadian',\n",
       "   'submission': 'BARBADIAN'}],\n",
       " [{'definition': 'A person having origins in the original peoples of sub-Saharan Africa and Central America.',\n",
       "   'identifier': 'C128991',\n",
       "   'preferred_term': 'Black Central American',\n",
       "   'submission': 'BLACK CENTRAL AMERICAN'}]]"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (c:Concept) RETURN c"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "79 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (cl:Concept) WHERE cl.identifier = 'C128689'\n",
    "  WITH cl\n",
    "  MATCH (cli:Concept) WHERE cli.identifier <> 'C128689' AND NOT (cli)--()\n",
    "  WITH cl, COLLECT(cli) as children\n",
    "  UNWIND children as child\n",
    "  CREATE (cl)-[:NARROWER]->(child)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "2 properties set.\n",
      "1 relationships created.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>ci</th>\n",
       "        <th>q</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;DM&#x27;, &#x27;name&#x27;: &#x27;Demographics&#x27;}</td>\n",
       "        <td>{&#x27;question_text&#x27;: &#x27;Race?&#x27;, &#x27;identifier&#x27;: &#x27;Q2&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'DM', 'name': 'Demographics'},\n",
       "  {'identifier': 'Q2', 'question_text': 'Race?'}]]"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (ci:CollectionInstrument {identifier: 'DM'})\n",
    "  CREATE (ci)-[:HAS_QUESTION]->(q:Question {identifier: 'Q2', question_text: 'Race?'})\n",
    "  RETURN ci,q"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Note we need the bit to restrict to the RACE codelist"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "6 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (q:Question {identifier: 'Q2'})\n",
    "  WITH q\n",
    "  UNWIND ['C43831', 'C43851', 'C17998', 'C41259', 'C77816', 'C77814'] AS id\n",
    "  MATCH (cl:Concept)-[:NARROWER]->(cli:Concept) WHERE cl.identifier = 'C128689' AND cli.identifier = id\n",
    "  CREATE (q)-[:HAS_RESPONSE]->(cli)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "3 relationships created.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>sub</th>\n",
       "        <th>c.submission</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;1234&#x27;}</td>\n",
       "        <td>ETHIOPIAN</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': '1234'}, 'ETHIOPIAN']]"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (sub:Subject {identifier: '1234'}), (q:Question {identifier: 'Q2'})\n",
    "  CREATE (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q)\n",
    "  WITH sub,r\n",
    "  MATCH (c:Concept {identifier: 'C43831'})\n",
    "  CREATE (r)-[:VALUE]->(c)\n",
    "  RETURN sub, c.submission"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>STUDY</th>\n",
       "        <th>SUBJID</th>\n",
       "        <th>Question</th>\n",
       "        <th>Text</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>Q1</td>\n",
       "        <td>Sex?</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1235</td>\n",
       "        <td>Q1</td>\n",
       "        <td>Sex?</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>Q2</td>\n",
       "        <td>Race?</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['http://data.acmepharma.com/clinicaltrial/12345', '1234', 'Q1', 'Sex?'],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345', '1235', 'Q1', 'Sex?'],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345', '1234', 'Q2', 'Race?']]"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[]-(sub:Subject)-[]->(r:Response)-[:TO]->(q:Question)\n",
    "  WITH s, sub, q\n",
    "  //MATCH (r)-[]->(c:Concept)\n",
    "  RETURN DISTINCT s.identifier as STUDY, sub.identifier as SUBJID, q.identifier as Question, q.question_text as Text"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
