{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Installation\n",
    "\n",
    "You will need Neo4j installed on your machine and running. It is assumed to be running on the localhost at port 7474 (the default for Neo4j)\n",
    "\n",
    "Some references I found for setting this notebook up\n",
    "\n",
    "* Seeting up juypter https://jupyter.readthedocs.io/en/latest/index.html\n",
    "* Python and Neo4j https://github.com/versae/ipython-cypher\n",
    "* Python and Neo4j https://ipython-cypher.readthedocs.io/en/latest/introduction.html#connections\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Cypher\n",
    "\n",
    "A quick reference guide\n",
    "\n",
    "* https://neo4j.com/docs/cypher-refcard/current/"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The following just gets the python environment loaded to allow this notebook to communicate with Neo4j and use basic cypher queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Nodes"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This command will delete all nodes. The \"DETACH\" bit will remove all relationships (more about these later). Do this now just to ensure that we start with a clean database when re-running\n",
    "\n",
    "```cypher\n",
    "MATCH (n) DETACH DELETE n\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "103 nodes deleted.\n",
      "122 relationship deleted.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n) DETACH DELETE n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Graphs are based on nodes and edges. First simple command will return all nodes\n",
    "\n",
    "```cypher\n",
    "MATCH (n) RETURN n\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n) RETURN n "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This can be dangerous since no limit on number of nodes returned so we can limit the number returned\n",
    "\n",
    "```cypher\n",
    "MATCH (n:Person) RETURN n LIMIT 5\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n) RETURN n LIMIT 5"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create a node with label Person. Return it.\n",
    "\n",
    "```cypher\n",
    "CREATE (n:Person) RETURN n\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{}]]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 CREATE (n:Person) RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create a node with label Person with some properties and values. Return it. Note the return data\n",
    "\n",
    "```cypher\n",
    "CREATE (n:Person {name: 'Andy', title: 'Developer'}) RETURN n\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "2 properties set.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Andy&#x27;, &#x27;title&#x27;: &#x27;Developer&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'name': 'Andy', 'title': 'Developer'}]]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 CREATE (n:Person {name: 'Andy', title: 'Developer'}) RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now return all the nodes we have created\n",
    "\n",
    "```cypher\n",
    "MATCH (n:Person) RETURN n\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Andy&#x27;, &#x27;title&#x27;: &#x27;Developer&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{}], [{'name': 'Andy', 'title': 'Developer'}]]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n:Person) RETURN n "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Note the node with no data. How do we get this node? How do we access the other node?\n",
    "\n",
    "```cypher\n",
    "MATCH (n:Person) WHERE n.name = \"Andy\" RETURN n\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Andy&#x27;, &#x27;title&#x27;: &#x27;Developer&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'name': 'Andy', 'title': 'Developer'}]]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n:Person) WHERE n.name = \"Andy\" RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Find that node with no data\n",
    "\n",
    "```cypher\n",
    "MATCH (n:Person) RETURN n,ID(n)\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "        <th>ID(n)</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{}</td>\n",
       "        <td>28</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Andy&#x27;, &#x27;title&#x27;: &#x27;Developer&#x27;}</td>\n",
       "        <td>105</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{}, 28], [{'name': 'Andy', 'title': 'Developer'}, 105]]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n:Person) RETURN n,ID(n)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "So set the name property in the node without any data\n",
    "\n",
    "```cypher\n",
    "MATCH (n:Person) WHERE ID(n) = [ID From Above Result] SET n.name = \"Fred\" RETURN n\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n:Person) WHERE ID(n) = 95 SET n.name = \"Fred\" RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Check that we get the desired result.\n",
    "\n",
    "```cypher\n",
    "MATCH (n:Person) RETURN n,ID(n)\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "        <th>ID(n)</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{}</td>\n",
       "        <td>28</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Andy&#x27;, &#x27;title&#x27;: &#x27;Developer&#x27;}</td>\n",
       "        <td>105</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{}, 28], [{'name': 'Andy', 'title': 'Developer'}, 105]]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n:Person) RETURN n,ID(n)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Relationships\n",
    "\n",
    "Now lets connect the two nodes\n",
    "\n",
    "```cypher\n",
    "MATCH (n1:Person {name:'Andy'}), (n2:Person {name:'Fred'}) CREATE (n1)-[:KNOWS]->(n2)\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n1:Person {name:'Andy'}), (n2:Person {name:'Fred'}) CREATE (n1)-[:KNOWS]->(n2)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Clinical Data\n",
    "\n",
    "## Terminology Example\n",
    "\n",
    "Clean out the database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 nodes deleted.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n) DETACH DELETE n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Add a terminology concept node representing a CDISC code list item. This is for RACE code list and the 'WHITE' code list item."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "3 properties set.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White&#x27;, &#x27;identifier&#x27;: &#x27;C41261&#x27;, &#x27;submission&#x27;: &#x27;WHITE&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'C41261', 'preferred_term': 'White', 'submission': 'WHITE'}]]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 CREATE (n:Concept {identifier: 'C41261', submission: 'WHITE', preferred_term: 'White'}) RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create the code list item node for 'ASIAN'\n",
    "\n",
    "```cypher\n",
    "CREATE (n:Concept {identifier: 'C41260', submission: 'ASIAN', preferred_term: 'Asian'}) RETURN n\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "3 properties set.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian&#x27;, &#x27;identifier&#x27;: &#x27;C41260&#x27;, &#x27;submission&#x27;: &#x27;ASIAN&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'C41260', 'preferred_term': 'Asian', 'submission': 'ASIAN'}]]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 CREATE (n:Concept {identifier: 'C41260', submission: 'ASIAN', preferred_term: 'Asian'}) RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Get the two concepts created\n",
    "\n",
    "```cypher\n",
    "MATCH (n:Concept) RETURN n\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White&#x27;, &#x27;identifier&#x27;: &#x27;C41261&#x27;, &#x27;submission&#x27;: &#x27;WHITE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian&#x27;, &#x27;identifier&#x27;: &#x27;C41260&#x27;, &#x27;submission&#x27;: &#x27;ASIAN&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'C41261', 'preferred_term': 'White', 'submission': 'WHITE'}],\n",
       " [{'identifier': 'C41260', 'preferred_term': 'Asian', 'submission': 'ASIAN'}]]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n:Concept) RETURN n "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now lets add the code list concept.\n",
    "\n",
    "```cypher\n",
    "CREATE (n:Concept {identifier: 'C74457', submission: 'RACE', preferred_term: 'CDISC SDTM Race Terminology'}) RETURN n**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "3 properties set.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Race Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C74457&#x27;, &#x27;submission&#x27;: &#x27;RACE&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'C74457',\n",
       "   'preferred_term': 'CDISC SDTM Race Terminology',\n",
       "   'submission': 'RACE'}]]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 CREATE (n:Concept {identifier: 'C74457', submission: 'RACE', preferred_term: 'CDISC SDTM Race Terminology'}) RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now let's link the nodes\n",
    "\n",
    "```cypher\n",
    "MATCH (cl:Concept {identifier:'C74457'}), (cli1:Concept {identifier:'C41261'}), (cli2:Concept {identifier:'C41260'}) CREATE (cl)-[:HAS_CHILD]->(cli1), (cl)-[:HAS_CHILD]->(cli2)\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (cl:Concept {identifier:'C74457'}), (cli1:Concept {identifier:'C41261'}), (cli2:Concept {identifier:'C41260'}) CREATE (cl)-[:NARROWER]->(cli1), (cl)-[:NARROWER]->(cli2) "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "And see what we have. Note the **type(r)** return value. This gives the type of the relationship.\n",
    "\n",
    "```cypher\n",
    "MATCH (p)-[r:HAS_CHILD]->(c) RETURN p, type(r), c\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>p</th>\n",
       "        <th>type(r)</th>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Race Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C74457&#x27;, &#x27;submission&#x27;: &#x27;RACE&#x27;}</td>\n",
       "        <td>NARROWER</td>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian&#x27;, &#x27;identifier&#x27;: &#x27;C41260&#x27;, &#x27;submission&#x27;: &#x27;ASIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Race Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C74457&#x27;, &#x27;submission&#x27;: &#x27;RACE&#x27;}</td>\n",
       "        <td>NARROWER</td>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White&#x27;, &#x27;identifier&#x27;: &#x27;C41261&#x27;, &#x27;submission&#x27;: &#x27;WHITE&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'C74457',\n",
       "   'preferred_term': 'CDISC SDTM Race Terminology',\n",
       "   'submission': 'RACE'},\n",
       "  'NARROWER',\n",
       "  {'identifier': 'C41260', 'preferred_term': 'Asian', 'submission': 'ASIAN'}],\n",
       " [{'identifier': 'C74457',\n",
       "   'preferred_term': 'CDISC SDTM Race Terminology',\n",
       "   'submission': 'RACE'},\n",
       "  'NARROWER',\n",
       "  {'identifier': 'C41261', 'preferred_term': 'White', 'submission': 'WHITE'}]]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (p)-[r:NARROWER]->(c) RETURN p, type(r), c"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Add Some Complexity\n",
    "\n",
    "Now build a simple example linking collection, terminology and simple reporting. We will load the SEX code list and link it up. As part of this we will clean the database.\n",
    "\n",
    "```cypher\n",
    "MATCH (n) DETACH DELETE n\n",
    "WITH count(*) as dummy\n",
    "LOAD CSV FROM \"https://www.dropbox.com/s/oqxh215khln96px/sex.csv?dl=1\" AS line\n",
    "CREATE (:Concept { identifier: line[0], submission: line[1], preferred_term: line[2], synonym: line[3], definition: line[4] })\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 nodes created.\n",
      "3 nodes deleted.\n",
      "25 properties set.\n",
      "2 relationship deleted.\n",
      "5 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (n) DETACH DELETE n\n",
    "  WITH count(*) as dummy\n",
    "  LOAD CSV FROM \"https://www.dropbox.com/s/oqxh215khln96px/sex.csv?dl=1\" AS line\n",
    "  CREATE (:Concept { identifier: line[0], submission: line[1], preferred_term: line[2], synonym: line[3], definition: line[4] })\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query to see what we loaded.\n",
    "\n",
    "```cypher\n",
    "MATCH (c:Concept) RETURN c\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Unknown&#x27;, &#x27;identifier&#x27;: &#x27;C17998&#x27;, &#x27;synonym&#x27;: &#x27;U; UNK; Unknown&#x27;, &#x27;definition&#x27;: &#x27;Not known&#x27;, &#x27;submission&#x27;: &#x27;U&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Sex of Individual Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C66731&#x27;, &#x27;synonym&#x27;: &#x27;Sex&#x27;, &#x27;definition&#x27;: &#x27;The assemblage of physical properties or qualities by which male is distinguished from female; the physical difference between male and female; the distinguishing peculiarity of male or female. (NCI)&#x27;, &#x27;submission&#x27;: &#x27;SEX&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Female&#x27;, &#x27;identifier&#x27;: &#x27;C16576&#x27;, &#x27;synonym&#x27;: &#x27;Female&#x27;, &#x27;submission&#x27;: &#x27;F&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Intersex  &#x27;, &#x27;identifier&#x27;: &#x27;C45908&#x27;, &#x27;synonym&#x27;: &#x27; &quot;A person (one of unisexual specimens) who is born with genitalia and/or secondary sexual characteristics of indeterminate sex&#x27;, &#x27;definition&#x27;: &#x27; or which combine features of both sexes. (NCI)&#x27;, &#x27;submission&#x27;: &#x27;UNDIFFERENTIATED&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Male&#x27;, &#x27;identifier&#x27;: &#x27;C20197&#x27;, &#x27;synonym&#x27;: &#x27;Male&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions&#x27;, &#x27;submission&#x27;: &#x27;M&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'definition': 'Not known',\n",
       "   'identifier': 'C17998',\n",
       "   'preferred_term': 'Unknown',\n",
       "   'submission': 'U',\n",
       "   'synonym': 'U; UNK; Unknown'}],\n",
       " [{'definition': 'The assemblage of physical properties or qualities by which male is distinguished from female; the physical difference between male and female; the distinguishing peculiarity of male or female. (NCI)',\n",
       "   'identifier': 'C66731',\n",
       "   'preferred_term': 'CDISC SDTM Sex of Individual Terminology',\n",
       "   'submission': 'SEX',\n",
       "   'synonym': 'Sex'}],\n",
       " [{'definition': 'A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C16576',\n",
       "   'preferred_term': 'Female',\n",
       "   'submission': 'F',\n",
       "   'synonym': 'Female'}],\n",
       " [{'definition': ' or which combine features of both sexes. (NCI)',\n",
       "   'identifier': 'C45908',\n",
       "   'preferred_term': 'Intersex  ',\n",
       "   'submission': 'UNDIFFERENTIATED',\n",
       "   'synonym': ' \"A person (one of unisexual specimens) who is born with genitalia and/or secondary sexual characteristics of indeterminate sex'}],\n",
       " [{'definition': 'A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C20197',\n",
       "   'preferred_term': 'Male',\n",
       "   'submission': 'M',\n",
       "   'synonym': 'Male'}]]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (c:Concept) RETURN c"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now link the code list with the items\n",
    "\n",
    "```cypher\n",
    "MATCH (cl:Concept) WHERE cl.identifier = 'C66731'\n",
    "WITH cl\n",
    "MATCH (cli:Concept) WHERE cli.identifier <> 'C66731' \n",
    "WITH cl, COLLECT(cli) as children\n",
    "UNWIND children as child\n",
    "CREATE (cl)-[:NARROWER]->(child)\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (cl:Concept) WHERE cl.identifier = 'C66731'\n",
    "  WITH cl\n",
    "  MATCH (cli:Concept) WHERE cli.identifier <> 'C66731' \n",
    "  WITH cl, COLLECT(cli) as children\n",
    "  UNWIND children as child\n",
    "  CREATE (cl)-[:NARROWER]->(child)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The next piece is purley to experiment with displaying the neo4j data in the Jupyter notebook. Uses some python libraries to do the heavy work.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAecAAAFCCAYAAADL3BUJAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMS4wLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvpW3flQAAE7ZJREFUeJzt3U+MVWfdB/DfHf7NjMAwWgZoa/GV\nUtK0EBuYBa2hJG4EjDI1rrRJu1IWdWEwpgvT912RNDRNdMFCF7wak3dhS6EptE2qJcZoOzQq2NpK\n8I20tMA0mRcRhplS7rs4DgUsZWbunTnPc87nk5hy79x7/EHOzHee7zn3nEaz2WwGAJCMjrIHAACu\nJpwBIDHCGQASI5wBIDHCGQASI5wBIDHCGQASI5wBIDHCGQASI5wBIDHCGQASI5wBIDHCGQASI5wB\nIDHCGQASI5wBIDHCGQASI5wBIDHCGQASI5wBIDHCGQASI5wBIDHCGQASI5wBIDHCGQASM7vsAaBy\nTp+O2L074vDhiDNnInp6ItasiXj44YjFi8ueDshAo9lsNsseAiphcDBix46IAweKxxcufPS1rq6I\nZjNi06aIRx+N6O8vZ0YgC8IZ2mHXrojt2yNGRooQvp5GowjqnTsjtm2bufmArKi1oVXjwXz+/I1f\n22wWr9u+vXgsoIGPYeUMrRgcjNi4cWLBfK3u7oiDByPWrWv7WEDenK0Nrdixo6iyp2JkpHg/wDWs\nnGGqTp+OWL786hO/JquzM+L4cWdxA1excoap2r279W00Gu3ZDlApwhmm6vDh1lbNEUW1feRIe+YB\nKkM4w1SdOdOe7QwPt2c7QGUIZ5iqnp72bKe3tz3bASpDOMNUrVlTnNDViq6uiNWr2zMPUBnO1oap\ncrY2ME2snGGq+vqKa2U3GlN7f6MRsXmzYAb+jZUztMIVwoBpYOUMrejvL25i0d09ufd1dxfvE8zA\nxxDO0Kpt2z4K6BtU3B9GfBTMbnoBXIdaG9rl0KHiWtn79xchfcU1t89HRCMi9kdE/1NPxW0PPFDW\nlEAG3DIS2mXduoinnooYGiouyXnkSMTwcLx46FC8ePJk/HdEvB8Rjx87Ft8veVQgbVbOMM1+/OMf\nx3e/+93Lj++999747W9/W+JEQOqEM0yz48ePx/Llyy8/bjQa8e6778bSpUtLnApImRPCYJrddttt\nsXbt2suPm81mPPvssyVOBKROOMMM2Lp161WPn3nmmZImAXKg1oYZ8Oc//zlWX3EN7blz58b7778f\nCxYsKHEqIFVWzjAD7rrrrlixYsXlx2NjY/H888+XOBGQMuEMM6DRaKi2gQkTzjBDrg3n5557LsbG\nxkqaBkiZcIYZsn79+lh8xR2ozpw5EwcPHixxIiBVwhlmyKxZs+KrX/3qVc+ptoGPI5xhBl1bbe/d\nuzcuXbpU0jRAqnyUCmbQhQsX4qabbopz585dfu7VV1+N/v7+EqcCUmPlDDOos7MzNm3adNVzqm3g\nWsIZZti11faePXtKmgRIlVobZtjw8HD09fXFxYsXLz/35ptvxqpVq0qcCkiJlTPMsN7e3ti4ceNV\nz+3du7ecYYAkCWcogauFAZ9ErQ0lePvtt+O22267/LjRaMSJEydi2bJlJU4FpMLKGUrw2c9+Ntat\nWxcRER0dHfHNb34zRkZGSp4KSIWVM5TkhRdeiI6OjnjwwQfjN7/5TaxcubLskYBECGco2Xe+8524\n/fbbY/v27WWPAiRCrQ0l27p1qxPCgKtYOUPJRkdHY8mSJfHWW2/FkiVLyh4HSICVM5Rs3rx58eUv\nfzmeffbZskcBEiGcIQFbt251GU/gMrU2JOAf//hH3HrrrXHixIlYsGBB2eMAJbNyhgQsXLgw7rvv\nvnj++efLHgVIgHCGRDhrGxin1oZEvPfee3HXXXfFyZMnY+7cuWWPA5TIyhkSsWzZsli1alUcPHiw\n7FGAkglnSIhqG4hQa0NS3nrrrfjSl74Ux48fj44OvztDXfnuh4SsWrUqFixYEK+99lrZowAlEs6Q\nGNU2IJwhMcIZEM6QmP7+/hgeHo6//vWvZY8ClEQ4Q2I6OjqsnqHmhDMkSDhDvfkoFSRobGwslixZ\nEm+88UYsW7as7HGAGWblDAmaO3dubNq0yT2eoaaEMyRKtQ31pdaGRI3f4/mdd96JhQsXlj0OMIOs\nnCFRCxcujC9+8Yvu8Qw1JJwhYaptqCe1NiTs5MmTceedd8apU6fc4xlqxMoZErZ06dK488474+WX\nXy57FGAGCWdI3MDAQOzZs6fsMYAZpNaGxB09ejTuv//+eOedd9zjGWrCdzokbuXKldHb2xuDg4Nl\njwLMEOEMGXDWNtSLcIYMCGeoF+EMGVi7dm2cPXs23nzzzbJHAWaAcIYMdHR0xNe+9rXYu3dv2aMA\nM0A4QyZU21AfPkoFmRgbG4ulS5fG66+/7h7PUHFWzpCJ8Xs879u3r+xRgGkmnCEjqm2oB7U2ZOTs\n2bNxyy23xNtvvx09PT1ljwNMEytnyMiCBQtiw4YNceDAgbJHAaaRcIbMqLah+tTakJlTp07FqlWr\n4tSpUzFv3ryyxwGmgZUzZGbJkiVx9913x69//euyRwGmiXCGDKm2odrU2pCho0ePxoYNG+LEiRPu\n8QwV5LsaMrRy5cr4zGc+E6+++mrZowDTQDhDplTbUF3CGTIlnKG6hDNkau3atXHu3Dn3eIYKEs6Q\nqUajEVu3bo09e/aUPQrQZsIZMqbahmryUSrI2AcffBBLly6Nw4cPxy233FL2OECbWDlDxubMmROb\nN292j2eoGOEMmVNtQ/WotSFz//znP+Pmm2+O48ePx6JFi8oeB2gDK2fI3Pz58+P+++93j2eoEOEM\nFaDahmpRa0MFnD59Ou644w73eIaKsHKGCujr64vVq1fHr371q7JHAdpAOENFDAwMqLahItTaUBHH\njh2L++67L06cOBGzZs0qexygBVbOUBErVqyIvr6+eOWVV8oeBWiRcIYKcdY2VINwhgoZv0uVo1WQ\nN+EMFXLPPffE6Oho/OUvfyl7FKAFwhkqZPwez6ptyJtwhooRzpA/H6WCihm/x/Of/vSnuPXWW8se\nB5gCK2eomDlz5sSWLVvc4xkyJpyhglTbkDe1NlTQuXPn4uabb46///3v7vEMGbJyhgr61Kc+FRs3\nboznnnuu7FGAKRDOUFGqbciXWhsqamhoKG6//fY4depUdHZ2lj0OMAmzyx4AmB6LFy+OL3zhC/HS\nSy/Fli1byh4Hpt/p0xG7d0ccPhxx5kxET0/EmjURDz8csXhx2dNNipUzVNiTTz4Zb7zxRvzkJz8p\nexSYPoODETt2RBw4UDy+cOGjr3V1RTSbEZs2RTz6aER/fzkzTpJwhgr729/+FuvXr493333XPZ6p\npl27IrZvjxgZKUL4ehqNIqh37ozYtm3m5psiJ4RBhX3+85+PpUuXxu9///uyR4H2Gw/m8+c/OZgj\niq+fP1+8fteumZmvBVbOrajQ8Q2q67HHHovG0FD85+c+Z1+lOgYHIzZuLAJ3srq7Iw4ejFi3ru1j\ntYtwnooKHt+gogYH4/9+8IPofPnlmDdvXjTsq1TFAw9EPPPMjVfMH6fRiBgYiHjqqfbP1SbCebIq\nenyDCvrXvtocGYmGfZWMNZvNuHjxYoyOjsbY2Fh8cOJE9PX3R2N0dOob7eyMOH482ebIR6km48rj\nGzdy5fGNCD/0mFlX7KuNG73Wvsp1nDt3Lt57770YHR29HIxX/rddz03kPVeuI7dHxH9FRHcrf7lG\nozgs+f3vt/aPNE2snCeq4sc3qBD7Km3yy1/+Mr7xjW+UPca/+VlEPNiODT34YMTPftaOLbWdlfNE\n7dhRVNlTMTJSvD/h4xtUiH21NprNZnzwwQfTtqI9evRo2X/Fj9W2W7kMD7drS20nnCfi9Oni5K+p\nlgzNZlzcty/+58knY3Thwujo6IhGoxGNRuPynyf6XKtfnz17dqyzKqquNuyrsX9/xNBQssfiynDl\n8c7pCMGpVr1jY2Mxa9asmDt3bsybNy/mzZt3+c9TfW7+/PmX/9zZ2RkvvfRS2f/8ERFX/T0vjIxE\ntHK8eVxvb+vbmCbCeSJ27255E2MXL8Yfv/e9eKL1aVoyf/78OHv2bMlTMG3asK+WdSzu0qVL0x54\nUw3GiGgp8K59rqen57qvm8x25syZM60Xl/nd734X+/btu+FM7fil4EbPXfX3fPzxiMceu/qTMpPV\n1RWxenXr/0jTRDhPxOHDre0EUZy4sKY907RkZGQktmzZMukVe1nPpTBDTrN2v/ZazG1xX42RkXjv\nxRfjj3ffPaPB+OGHH7b1h/78+fPj05/+dFsCpa5XV1u/fn0cO3as7DH+3UMPFeHcimaz2E6ihPNE\nnDnTls2kcMv7zs7O2LZtWzSbzbh06dJV/y37ufH/Xfu6sudq9bmZ/P/7n3PnYlMb9pP//cMf4kc/\n+tENw6urqysWLVo06QD9uK/Pnj07Go0bnlsOEX19xefzW/mc8+bNSR+6Ec4T0dPTls3ctGJFPLxh\nQyk/7Mf/PH/+/PjKV77Slr8PCfrWtyJ+8YuWN3Pv5s1xINGzWCEiigvnvPDC1D6V0NVVvD9hwnki\n1qwpzl5t8fjGvd/+dtyb6GfqqIg27aspH4uDiCiuaLdz58SvPTGuu7t4X+Inxvqc80ScPh2xfHlr\nP/ASvxoNFWFfpW4qetVGd6WaiPHjG1M9HpbB8Q0qwr5K3WzbVlw4Z2Cg+MWyq+vqr3d1Fc8PDBSv\nyyCYI6ycJ85Vl8iFfZW6GhoqPgZ45EhxgZHe3uIQzUMPZfcLp3CejMlcW3vc+PGNTH5boyLsq5A1\nJ4RNxvgPrQoe36Bi7KuQNSvnqTh0qLj+8P79xQ+2K69jPH6P3M2bi1P11YOUyb4KWRLOrajQ8Q0q\n7l/76is//Wn0zZ0b/3HPPfZVSJhwhhp55JFH4o477ohHHnmk7FGAT+CjVFAjHR0d8eGHH5Y9BnAD\nwhlqZNasWXHp0qWyxwBuQDhDjXR0dAhnyIBwhhpRa0MehDPUiFob8iCcoUbU2pAH4Qw1otaGPAhn\nqBG1NuRBOEONqLUhD8IZakStDXkQzlAjam3Ig3CGGlFrQx6EM9SIWhvyIJyhRtTakAfhDDWi1oY8\nCGeoEbU25EE4Q42otSEPwhlqRK0NeRDOUCNqbciDcIYaUWtDHoQz1IiVM+RBOEONWDlDHoQz1IgT\nwiAPwhlqRK0NeRDOUCNqbciDcIYaUWtDHoQz1IhaG/IgnKFG1NqQB+EMNaLWhjwIZ6gRtTbkQThD\njai1IQ/CGWpErQ15EM5QI2ptyINwhhpRa0MehDPUiFob8iCcoUbU2pAH4Qw1otaGPAhnqBG1NuRB\nOEONqLUhD8IZakStDXkQzlAjVs6QB+EMNeKYM+RBOEONqLUhD8IZakStDXkQzlAjVs6QB+EMNeKY\nM+RBOEONqLUhD8IZakStDXkQzlAjam3Ig3CGGlFrQx6EM9SIWhvyIJyhRtTakAfhDDWi1oY8CGeo\nEbU25EE4Q42otSEPwhlqRK0NeRDOUCNqbciDcIYaUWtDHoQz1IhaG/IgnKFG1NqQB+EMNaLWhjwI\nZ6gRtTbkQThDjXR0FN/yzWaz5EmATyKcoWasniF9whlqxklhkD7hDDXjpDBIn3CGmlFrQ/qEM9SM\nWhvSJ5yhZtTakD7hDDWj1ob0CWeoGbU2pE84Q82otSF9whlqRq0N6RPOUDNqbUifcIaaUWtD+oQz\n1IxaG9InnKFm1NqQPuEMNaPWhvQJZ6gZtTakTzhDzai1IX3CGWri9ddfjx/+8IcxNDQUTzzxRPz8\n5z8veyTgOhrNZrNZ9hDA9Hv66afj61//+uXHAwMD8fTTT5c4EXA9Vs5QEx0dV3+7q7YhXcIZauLa\ncHZSGKRLOENNzJo166rHVs6QLuEMNaHWhnwIZ6gJtTbkQzhDTai1IR/CGWpCrQ35EM5QE2ptyIdw\nhppQa0M+hDPUhJUz5EM4Q0045gz5EM5QE2ptyIdwhppQa0M+hDPUhFob8iGcoSbU2pAP4Qw1odaG\nfAhnqAm1NuRDOENNqLUhH8IZakKtDfkQzlATam3Ix+yyBwBmxpzh4dgeEWsiYlFEXDx1KuLxxyMe\nfjhi8eKSpwOu1Gg2m82yhwCm0eBgxI4d0dy/P0ZGR6P7yq91dUU0mxGbNkU8+mhEf39ZUwJXEM5Q\nZbt2RWzfHjEyUoTw9TQaRVDv3BmxbdvMzQd8LLU2VNV4MJ8/f+PXNpvF67ZvLx4LaCiVlTNU0eBg\nxMaNEwvma3V3Rxw8GLFuXdvHAibG2dpQRTt2FFX2VIyMFO8HSmPlDFVz+nTE8uURFy5MfRudnRHH\njzuLG0pi5QxVs3t369toNNqzHWBKhDNUzeHDra2aI4pq+8iR9swDTJpwhqo5c6Y92xkebs92gEkT\nzlA1PT3t2U5vb3u2A0yacIaqWbOmOKGrFV1dEatXt2ceYNKcrQ1V42xtyJ6VM1RNX19xrexGY2rv\nbzQiNm8WzFAiK2eoIlcIg6xZOUMV9fcXN7Ho7r7xa6/U3V28TzBDqdz4Aqpq/OYV7koF2VFrQ9Ud\nOlRcK3v//iKEr7zm9vj9nDdvLu7nbMUMSRDOUBdDQ8UlOY8cKS4w0ttbfFzqoYec/AWJEc4AkBgn\nhAFAYoQzACRGOANAYoQzACRGOANAYoQzACRGOANAYoQzACRGOANAYoQzACRGOANAYoQzACRGOANA\nYoQzACRGOANAYoQzACRGOANAYoQzACRGOANAYoQzACRGOANAYoQzACRGOANAYoQzACRGOANAYoQz\nACRGOANAYoQzACRGOANAYoQzACRGOANAYoQzACRGOANAYoQzACRGOANAYoQzACRGOANAYoQzACTm\n/wFHYfmkRMRE5gAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x11360fef0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher http://neo4j:ld123@localhost:7474 MATCH (c:Concept)-[r:NARROWER]->(x:Concept) RETURN c,r,x\n",
    "g = results.get_graph()\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now lets create some simple metadata to capture data that links to the terminologies. We create a single study node that is linked to a collection instrument (form) that holds a single question.\n",
    "\n",
    "```cypher\n",
    "CREATE (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345', name: 'Linked Data Wonder Drug'})-[:COLLECTS]->(ci:CollectionInstrument {identifier: 'DM', name: 'Demographics'})-[:HAS_QUESTION]->(q:Question {identifier: 'Q1', question_text: 'Sex?'})\n",
    "RETURN s,ci,q\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 nodes created.\n",
      "6 properties set.\n",
      "2 relationships created.\n",
      "3 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>s</th>\n",
       "        <th>ci</th>\n",
       "        <th>q</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;http://data.acmepharma.com/clinicaltrial/12345&#x27;, &#x27;name&#x27;: &#x27;Linked Data Wonder Drug&#x27;}</td>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;DM&#x27;, &#x27;name&#x27;: &#x27;Demographics&#x27;}</td>\n",
       "        <td>{&#x27;question_text&#x27;: &#x27;Sex?&#x27;, &#x27;identifier&#x27;: &#x27;Q1&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'http://data.acmepharma.com/clinicaltrial/12345',\n",
       "   'name': 'Linked Data Wonder Drug'},\n",
       "  {'identifier': 'DM', 'name': 'Demographics'},\n",
       "  {'identifier': 'Q1', 'question_text': 'Sex?'}]]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  CREATE (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345', name: 'Linked Data Wonder Drug'})-[:COLLECTS]->(ci:CollectionInstrument {identifier: 'DM', name: 'Demographics'})-[:HAS_QUESTION]->(q:Question {identifier: 'Q1', question_text: 'Sex?'})\n",
    "  RETURN s,ci,q"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Link the terminology to the question.\n",
    "\n",
    "```cypher\n",
    "MATCH (q:Question {identifier: 'Q1'}), (cli1:Concept {identifier: 'C16576'}), (cli2:Concept {identifier: 'C20197'}) \n",
    "CREATE UNIQUE (cli1)<-[:HAS_RESPONSE]-(q)-[:HAS_RESPONSE]->(cli2)\n",
    "RETURN q,cli1,cli2\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>q</th>\n",
       "        <th>cli1</th>\n",
       "        <th>cli2</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;question_text&#x27;: &#x27;Sex?&#x27;, &#x27;identifier&#x27;: &#x27;Q1&#x27;}</td>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Female&#x27;, &#x27;identifier&#x27;: &#x27;C16576&#x27;, &#x27;synonym&#x27;: &#x27;Female&#x27;, &#x27;submission&#x27;: &#x27;F&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions&#x27;}</td>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Male&#x27;, &#x27;identifier&#x27;: &#x27;C20197&#x27;, &#x27;synonym&#x27;: &#x27;Male&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions&#x27;, &#x27;submission&#x27;: &#x27;M&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'Q1', 'question_text': 'Sex?'},\n",
       "  {'definition': 'A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C16576',\n",
       "   'preferred_term': 'Female',\n",
       "   'submission': 'F',\n",
       "   'synonym': 'Female'},\n",
       "  {'definition': 'A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C20197',\n",
       "   'preferred_term': 'Male',\n",
       "   'submission': 'M',\n",
       "   'synonym': 'Male'}]]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (q:Question {identifier: 'Q1'}), (cli1:Concept {identifier: 'C16576'}), (cli2:Concept {identifier: 'C20197'}) \n",
    "  CREATE UNIQUE (cli1)<-[:HAS_RESPONSE]-(q)-[:HAS_RESPONSE]->(cli2)\n",
    "  RETURN q,cli1,cli2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Simple query. List the terminology in my study\n",
    "\n",
    "```cypher\n",
    "MATCH (s:Study)-[:COLLECTS]->(ci:CollectionInstrument)-[:HAS_QUESTION]->(q:Question)-[:HAS_RESPONSE]->(c:Concept) \n",
    "RETURN q.identifier, c.identifier, c.submission\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>q.identifier</th>\n",
       "        <th>c.identifier</th>\n",
       "        <th>c.submission</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Q1</td>\n",
       "        <td>C16576</td>\n",
       "        <td>F</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Q1</td>\n",
       "        <td>C20197</td>\n",
       "        <td>M</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Q1', 'C16576', 'F'], ['Q1', 'C20197', 'M']]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study)-[:COLLECTS]->(ci:CollectionInstrument)-[:HAS_QUESTION]->(q:Question)-[:HAS_RESPONSE]->(c:Concept) \n",
    "  RETURN q.identifier, c.identifier, c.submission"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 nodes created.\n",
      "2 properties set.\n",
      "2 relationships created.\n",
      "2 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>s</th>\n",
       "        <th>sub1</th>\n",
       "        <th>sub2</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;http://data.acmepharma.com/clinicaltrial/12345&#x27;, &#x27;name&#x27;: &#x27;Linked Data Wonder Drug&#x27;}</td>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;1234&#x27;}</td>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;1235&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'http://data.acmepharma.com/clinicaltrial/12345',\n",
       "   'name': 'Linked Data Wonder Drug'},\n",
       "  {'identifier': '1234'},\n",
       "  {'identifier': '1235'}]]"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})\n",
    "  CREATE (s)<-[:PARTICIPATES_IN]-(sub1:Subject {identifier: '1234'})\n",
    "  WITH s, sub1\n",
    "  CREATE (s)<-[:PARTICIPATES_IN]-(sub2:Subject {identifier: '1235'})\n",
    "  RETURN s, sub1, sub2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "3 relationships created.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>sub</th>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;1234&#x27;}</td>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Female&#x27;, &#x27;identifier&#x27;: &#x27;C16576&#x27;, &#x27;synonym&#x27;: &#x27;Female&#x27;, &#x27;submission&#x27;: &#x27;F&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': '1234'},\n",
       "  {'definition': 'A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C16576',\n",
       "   'preferred_term': 'Female',\n",
       "   'submission': 'F',\n",
       "   'synonym': 'Female'}]]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (sub:Subject {identifier: '1234'}), (q:Question {identifier: 'Q1'})\n",
    "  CREATE (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q)\n",
    "  WITH sub,r\n",
    "  MATCH (c:Concept {identifier: 'C16576'})\n",
    "  CREATE (r)-[:VALUE]->(c)\n",
    "  RETURN sub, c"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>STUDY</th>\n",
       "        <th>SUBJID</th>\n",
       "        <th>SEX</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>F</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['http://data.acmepharma.com/clinicaltrial/12345', '1234', 'F']]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[]-(sub:Subject)-[]->(r:Response)-[]->(c:Concept)\n",
    "  RETURN s.identifier as STUDY, sub.identifier as SUBJID, c.submission as SEX"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "3 relationships created.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>sub</th>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;1235&#x27;}</td>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Female&#x27;, &#x27;identifier&#x27;: &#x27;C16576&#x27;, &#x27;synonym&#x27;: &#x27;Female&#x27;, &#x27;submission&#x27;: &#x27;F&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': '1235'},\n",
       "  {'definition': 'A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C16576',\n",
       "   'preferred_term': 'Female',\n",
       "   'submission': 'F',\n",
       "   'synonym': 'Female'}]]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (sub:Subject {identifier: '1235'}), (q:Question {identifier: 'Q1'})\n",
    "  CREATE (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q)\n",
    "  WITH sub,r\n",
    "  MATCH (c:Concept {identifier: 'C16576'})\n",
    "  CREATE (r)-[:VALUE]->(c)\n",
    "  RETURN sub, c"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "And now having linked everything we can query for some data\n",
    "\n",
    "```cypher\n",
    "MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[]-(sub:Subject)-[]->(r:Response)-[]->(c:Concept)\n",
    "RETURN s.identifier as STUDY, sub.identifier as SUBJID, c.submission as SEX\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>STUDY</th>\n",
       "        <th>SUBJID</th>\n",
       "        <th>SEX</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>F</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1235</td>\n",
       "        <td>F</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['http://data.acmepharma.com/clinicaltrial/12345', '1234', 'F'],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345', '1235', 'F']]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[]-(sub:Subject)-[]->(r:Response)-[]->(c:Concept)\n",
    "  RETURN s.identifier as STUDY, sub.identifier as SUBJID, c.submission as SEX"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "6 nodes created.\n",
      "24 properties set.\n",
      "6 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  LOAD CSV FROM \"https://www.dropbox.com/s/7ley89j6g6ng0ed/race.csv?dl=1\" AS line\n",
    "  CREATE (:Concept { identifier: line[0], submission: line[1], preferred_term: line[2], synonym: line[3], definition: line[4] })"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "11 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Unknown&#x27;, &#x27;identifier&#x27;: &#x27;C17998&#x27;, &#x27;synonym&#x27;: &#x27;U; UNK; Unknown&#x27;, &#x27;definition&#x27;: &#x27;Not known&#x27;, &#x27;submission&#x27;: &#x27;U&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Sex of Individual Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C66731&#x27;, &#x27;synonym&#x27;: &#x27;Sex&#x27;, &#x27;definition&#x27;: &#x27;The assemblage of physical properties or qualities by which male is distinguished from female; the physical difference between male and female; the distinguishing peculiarity of male or female. (NCI)&#x27;, &#x27;submission&#x27;: &#x27;SEX&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Female&#x27;, &#x27;identifier&#x27;: &#x27;C16576&#x27;, &#x27;synonym&#x27;: &#x27;Female&#x27;, &#x27;submission&#x27;: &#x27;F&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Intersex  &#x27;, &#x27;identifier&#x27;: &#x27;C45908&#x27;, &#x27;synonym&#x27;: &#x27; &quot;A person (one of unisexual specimens) who is born with genitalia and/or secondary sexual characteristics of indeterminate sex&#x27;, &#x27;definition&#x27;: &#x27; or which combine features of both sexes. (NCI)&#x27;, &#x27;submission&#x27;: &#x27;UNDIFFERENTIATED&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Male&#x27;, &#x27;identifier&#x27;: &#x27;C20197&#x27;, &#x27;synonym&#x27;: &#x27;Male&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions&#x27;, &#x27;submission&#x27;: &#x27;M&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Black or African American&#x27;, &#x27;identifier&#x27;: &#x27;C16352&#x27;, &#x27;submission&#x27;: &#x27;BLACK OR AFRICAN AMERICAN&#x27;, &#x27;definition&#x27;: &quot;A person having origins in any of the black racial groups of Africa. Terms such as &#x27;Haitian&#x27; or &#x27;Negro&#x27; can be used in addition to &#x27;Black or African American.&#x27; (FDA)&quot;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Native Hawaiian or Other Pacific Islander&#x27;, &#x27;identifier&#x27;: &#x27;C41219&#x27;, &#x27;submission&#x27;: &#x27;NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER&#x27;, &#x27;definition&#x27;: &#x27;Denotes a person having origins in any of the original peoples of Hawaii&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;American Indian or Alaska Native&#x27;, &#x27;identifier&#x27;: &#x27;C41259&#x27;, &#x27;submission&#x27;: &#x27;AMERICAN INDIAN OR ALASKA NATIVE&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of North and South America (including Central America)&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White&#x27;, &#x27;identifier&#x27;: &#x27;C41261&#x27;, &#x27;definition&#x27;: &#x27;Denotes a person with European&#x27;, &#x27;submission&#x27;: &#x27;WHITE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian&#x27;, &#x27;identifier&#x27;: &#x27;C41260&#x27;, &#x27;submission&#x27;: &#x27;ASIAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Far East&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Race Terminology Race&#x27;, &#x27;identifier&#x27;: &#x27;C74457&#x27;, &#x27;synonym&#x27;: &#x27;Terminology codelist used to identify the race of an individual within the Clinical Data Interchange Standards Consortium Study Data Tabulation Model.&#x27;, &#x27;submission&#x27;: &#x27;RACE&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'definition': 'Not known',\n",
       "   'identifier': 'C17998',\n",
       "   'preferred_term': 'Unknown',\n",
       "   'submission': 'U',\n",
       "   'synonym': 'U; UNK; Unknown'}],\n",
       " [{'definition': 'The assemblage of physical properties or qualities by which male is distinguished from female; the physical difference between male and female; the distinguishing peculiarity of male or female. (NCI)',\n",
       "   'identifier': 'C66731',\n",
       "   'preferred_term': 'CDISC SDTM Sex of Individual Terminology',\n",
       "   'submission': 'SEX',\n",
       "   'synonym': 'Sex'}],\n",
       " [{'definition': 'A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C16576',\n",
       "   'preferred_term': 'Female',\n",
       "   'submission': 'F',\n",
       "   'synonym': 'Female'}],\n",
       " [{'definition': ' or which combine features of both sexes. (NCI)',\n",
       "   'identifier': 'C45908',\n",
       "   'preferred_term': 'Intersex  ',\n",
       "   'submission': 'UNDIFFERENTIATED',\n",
       "   'synonym': ' \"A person (one of unisexual specimens) who is born with genitalia and/or secondary sexual characteristics of indeterminate sex'}],\n",
       " [{'definition': 'A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C20197',\n",
       "   'preferred_term': 'Male',\n",
       "   'submission': 'M',\n",
       "   'synonym': 'Male'}],\n",
       " [{'definition': \"A person having origins in any of the black racial groups of Africa. Terms such as 'Haitian' or 'Negro' can be used in addition to 'Black or African American.' (FDA)\",\n",
       "   'identifier': 'C16352',\n",
       "   'preferred_term': 'Black or African American',\n",
       "   'submission': 'BLACK OR AFRICAN AMERICAN'}],\n",
       " [{'definition': 'Denotes a person having origins in any of the original peoples of Hawaii',\n",
       "   'identifier': 'C41219',\n",
       "   'preferred_term': 'Native Hawaiian or Other Pacific Islander',\n",
       "   'submission': 'NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of North and South America (including Central America)',\n",
       "   'identifier': 'C41259',\n",
       "   'preferred_term': 'American Indian or Alaska Native',\n",
       "   'submission': 'AMERICAN INDIAN OR ALASKA NATIVE'}],\n",
       " [{'definition': 'Denotes a person with European',\n",
       "   'identifier': 'C41261',\n",
       "   'preferred_term': 'White',\n",
       "   'submission': 'WHITE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Far East',\n",
       "   'identifier': 'C41260',\n",
       "   'preferred_term': 'Asian',\n",
       "   'submission': 'ASIAN'}],\n",
       " [{'identifier': 'C74457',\n",
       "   'preferred_term': 'CDISC SDTM Race Terminology Race',\n",
       "   'submission': 'RACE',\n",
       "   'synonym': 'Terminology codelist used to identify the race of an individual within the Clinical Data Interchange Standards Consortium Study Data Tabulation Model.'}]]"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (c:Concept) RETURN c"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (cl:Concept) WHERE cl.identifier = 'C74457'\n",
    "  WITH cl\n",
    "  MATCH (cli:Concept) WHERE cli.identifier <> 'C74457' AND NOT (cli)--()\n",
    "  WITH cl, COLLECT(cli) as children\n",
    "  UNWIND children as child\n",
    "  CREATE (cl)-[:NARROWER]->(child)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "80 nodes created.\n",
      "322 properties set.\n",
      "80 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  LOAD CSV FROM \"https://www.dropbox.com/s/g7s92ebrlm6cxna/racec.csv?dl=1\" AS line\n",
    "  CREATE (:Concept { identifier: line[0], submission: line[1], preferred_term: line[2], synonym: line[3], definition: line[4] })"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "91 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Unknown&#x27;, &#x27;identifier&#x27;: &#x27;C17998&#x27;, &#x27;synonym&#x27;: &#x27;U; UNK; Unknown&#x27;, &#x27;definition&#x27;: &#x27;Not known&#x27;, &#x27;submission&#x27;: &#x27;U&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Sex of Individual Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C66731&#x27;, &#x27;synonym&#x27;: &#x27;Sex&#x27;, &#x27;definition&#x27;: &#x27;The assemblage of physical properties or qualities by which male is distinguished from female; the physical difference between male and female; the distinguishing peculiarity of male or female. (NCI)&#x27;, &#x27;submission&#x27;: &#x27;SEX&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Black Central American&#x27;, &#x27;identifier&#x27;: &#x27;C128991&#x27;, &#x27;submission&#x27;: &#x27;BLACK CENTRAL AMERICAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of sub-Saharan Africa and Central America.&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Vietnamese&#x27;, &#x27;identifier&#x27;: &#x27;C43396&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Viet Nam.&#x27;, &#x27;submission&#x27;: &#x27;VIETNAMESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White&#x27;, &#x27;identifier&#x27;: &#x27;C41261&#x27;, &#x27;definition&#x27;: &#x27;Denotes a person with European&#x27;, &#x27;submission&#x27;: &#x27;WHITE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Black South American&#x27;, &#x27;identifier&#x27;: &#x27;C128992&#x27;, &#x27;submission&#x27;: &#x27;BLACK SOUTH AMERICAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of sub-Saharan Africa and South America.&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Laotian&#x27;, &#x27;identifier&#x27;: &#x27;C43397&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Laos.&#x27;, &#x27;submission&#x27;: &#x27;LAOTIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Eastern European&#x27;, &#x27;identifier&#x27;: &#x27;C77819&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Eastern Europe.&#x27;, &#x27;submission&#x27;: &#x27;EASTERN EUROPEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Female&#x27;, &#x27;identifier&#x27;: &#x27;C16576&#x27;, &#x27;synonym&#x27;: &#x27;Female&#x27;, &#x27;submission&#x27;: &#x27;F&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Intersex  &#x27;, &#x27;identifier&#x27;: &#x27;C45908&#x27;, &#x27;synonym&#x27;: &#x27; &quot;A person (one of unisexual specimens) who is born with genitalia and/or secondary sexual characteristics of indeterminate sex&#x27;, &#x27;definition&#x27;: &#x27; or which combine features of both sexes. (NCI)&#x27;, &#x27;submission&#x27;: &#x27;UNDIFFERENTIATED&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Male&#x27;, &#x27;identifier&#x27;: &#x27;C20197&#x27;, &#x27;synonym&#x27;: &#x27;Male&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions&#x27;, &#x27;submission&#x27;: &#x27;M&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian Indian&#x27;, &#x27;identifier&#x27;: &#x27;C41262&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Indian subcontinent.&#x27;, &#x27;submission&#x27;: &#x27;ASIAN INDIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;African American&#x27;, &#x27;identifier&#x27;: &#x27;C128937&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of sub-Saharan Africa and the United States.&#x27;, &#x27;submission&#x27;: &#x27;AFRICAN AMERICAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White Central American&#x27;, &#x27;identifier&#x27;: &#x27;C128993&#x27;, &#x27;submission&#x27;: &#x27;WHITE CENTRAL AMERICAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of Europe&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Hmong&#x27;, &#x27;identifier&#x27;: &#x27;C43398&#x27;, &#x27;submission&#x27;: &#x27;HMONG&#x27;, &#x27;definition&#x27;: &#x27;The native people originating in China around the Yellow River or Hoang Ho.&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Black or African American&#x27;, &#x27;identifier&#x27;: &#x27;C16352&#x27;, &#x27;submission&#x27;: &#x27;BLACK OR AFRICAN AMERICAN&#x27;, &#x27;definition&#x27;: &quot;A person having origins in any of the black racial groups of Africa. Terms such as &#x27;Haitian&#x27; or &#x27;Negro&#x27; can be used in addition to &#x27;Black or African American.&#x27; (FDA)&quot;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Native Hawaiian or Other Pacific Islander&#x27;, &#x27;identifier&#x27;: &#x27;C41219&#x27;, &#x27;submission&#x27;: &#x27;NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER&#x27;, &#x27;definition&#x27;: &#x27;Denotes a person having origins in any of the original peoples of Hawaii&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;American Indian or Alaska Native&#x27;, &#x27;identifier&#x27;: &#x27;C41259&#x27;, &#x27;submission&#x27;: &#x27;AMERICAN INDIAN OR ALASKA NATIVE&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of North and South America (including Central America)&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White&#x27;, &#x27;identifier&#x27;: &#x27;C41261&#x27;, &#x27;definition&#x27;: &#x27;Denotes a person with European&#x27;, &#x27;submission&#x27;: &#x27;WHITE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian&#x27;, &#x27;identifier&#x27;: &#x27;C41260&#x27;, &#x27;submission&#x27;: &#x27;ASIAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Far East&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Race Terminology Race&#x27;, &#x27;identifier&#x27;: &#x27;C74457&#x27;, &#x27;synonym&#x27;: &#x27;Terminology codelist used to identify the race of an individual within the Clinical Data Interchange Standards Consortium Study Data Tabulation Model.&#x27;, &#x27;submission&#x27;: &#x27;RACE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Arab&#x27;, &#x27;identifier&#x27;: &#x27;C43876&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Arabian peninsula and surrounding territories in the Middle East and northern Africa.&#x27;, &#x27;submission&#x27;: &#x27;ARAB&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Central American Indian&#x27;, &#x27;identifier&#x27;: &#x27;C44950&#x27;, &#x27;submission&#x27;: &#x27;CENTRAL AMERICAN INDIAN&#x27;, &#x27;definition&#x27;: &#x27;The native people of Central America.&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;African Caribbean&#x27;, &#x27;identifier&#x27;: &#x27;C41226&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of sub-Saharan Africa and the Caribbean.&#x27;, &#x27;submission&#x27;: &#x27;AFRICAN CARIBBEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Black&#x27;, &#x27;identifier&#x27;: &#x27;C128938&#x27;, &#x27;submission&#x27;: &#x27;BLACK&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of sub-Saharan Africa or the Caribbean.&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White South American&#x27;, &#x27;identifier&#x27;: &#x27;C128994&#x27;, &#x27;submission&#x27;: &#x27;WHITE SOUTH AMERICAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of Europe&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Cambodian&#x27;, &#x27;identifier&#x27;: &#x27;C43399&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Cambodia (formerly Kampuchea).&#x27;, &#x27;submission&#x27;: &#x27;CAMBODIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Middle Eastern&#x27;, &#x27;identifier&#x27;: &#x27;C77820&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Middle East.&#x27;, &#x27;submission&#x27;: &#x27;MIDDLE EASTERN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;American Indian&#x27;, &#x27;identifier&#x27;: &#x27;C43877&#x27;, &#x27;definition&#x27;: &#x27;The native people of North America.&#x27;, &#x27;submission&#x27;: &#x27;AMERICAN INDIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Indonesian&#x27;, &#x27;identifier&#x27;: &#x27;C43715&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Indonesia.&#x27;, &#x27;submission&#x27;: &#x27;INDONESIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Bahamian&#x27;, &#x27;identifier&#x27;: &#x27;C67271&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Bahamas.&#x27;, &#x27;submission&#x27;: &#x27;BAHAMIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Malaysian&#x27;, &#x27;identifier&#x27;: &#x27;C43716&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Malaysia.&#x27;, &#x27;submission&#x27;: &#x27;MALAYSIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;South American Indian&#x27;, &#x27;identifier&#x27;: &#x27;C44953&#x27;, &#x27;definition&#x27;: &#x27;The native people of South America.&#x27;, &#x27;submission&#x27;: &#x27;SOUTH AMERICAN INDIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Russian&#x27;, &#x27;identifier&#x27;: &#x27;C43860&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Russia.&#x27;, &#x27;submission&#x27;: &#x27;RUSSIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Barbadian&#x27;, &#x27;identifier&#x27;: &#x27;C43823&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Barbados.&#x27;, &#x27;submission&#x27;: &#x27;BARBADIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Okinawan&#x27;, &#x27;identifier&#x27;: &#x27;C43717&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Okinawa.&#x27;, &#x27;submission&#x27;: &#x27;OKINAWAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Dominica Islander&#x27;, &#x27;identifier&#x27;: &#x27;C43824&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Dominica.&#x27;, &#x27;submission&#x27;: &#x27;DOMINICA ISLANDER&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Iwo Jiman&#x27;, &#x27;identifier&#x27;: &#x27;C43718&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Iwo Jima.&#x27;, &#x27;submission&#x27;: &#x27;IWO JIMAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Haitian&#x27;, &#x27;identifier&#x27;: &#x27;C43825&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Haiti.&#x27;, &#x27;submission&#x27;: &#x27;HAITIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Maldivian&#x27;, &#x27;identifier&#x27;: &#x27;C43719&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Maldives.&#x27;, &#x27;submission&#x27;: &#x27;MALDIVIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Jamaican&#x27;, &#x27;identifier&#x27;: &#x27;C43826&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Jamaica.&#x27;, &#x27;submission&#x27;: &#x27;JAMAICAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Greenland Eskimo&#x27;, &#x27;identifier&#x27;: &#x27;C44265&#x27;, &#x27;definition&#x27;: &#x27;The native people of Greenland.&#x27;, &#x27;submission&#x27;: &#x27;GREENLAND INUIT&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Mongolian&#x27;, &#x27;identifier&#x27;: &#x27;C43864&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Mongolia.&#x27;, &#x27;submission&#x27;: &#x27;MONGOLIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Tobagoan&#x27;, &#x27;identifier&#x27;: &#x27;C43827&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Tobago.&#x27;, &#x27;submission&#x27;: &#x27;TOBAGOAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Nepalese&#x27;, &#x27;identifier&#x27;: &#x27;C43720&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Nepal.&#x27;, &#x27;submission&#x27;: &#x27;NEPALESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Thai&#x27;, &#x27;identifier&#x27;: &#x27;C43400&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Thailand.&#x27;, &#x27;submission&#x27;: &#x27;THAI&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Trinidadian&#x27;, &#x27;identifier&#x27;: &#x27;C43828&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Trinidad.&#x27;, &#x27;submission&#x27;: &#x27;TRINIDADIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Singaporean&#x27;, &#x27;identifier&#x27;: &#x27;C43721&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Singapore.&#x27;, &#x27;submission&#x27;: &#x27;SINGAPOREAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Khoisan&#x27;, &#x27;identifier&#x27;: &#x27;C154874&#x27;, &#x27;definition&#x27;: &#x27;The native people of the Western Cape in southern Africa.&#x27;, &#x27;submission&#x27;: &#x27;KHOISAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian American&#x27;, &#x27;identifier&#x27;: &#x27;C16310&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of Asia and the United States.&#x27;, &#x27;submission&#x27;: &#x27;ASIAN AMERICAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;West Indian&#x27;, &#x27;identifier&#x27;: &#x27;C43829&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the West Indies.&#x27;, &#x27;submission&#x27;: &#x27;WEST INDIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Bangladeshi&#x27;, &#x27;identifier&#x27;: &#x27;C43671&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Bangladesh.&#x27;, &#x27;submission&#x27;: &#x27;BANGLADESHI&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Malagasy&#x27;, &#x27;identifier&#x27;: &#x27;C43722&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Madagascar.&#x27;, &#x27;submission&#x27;: &#x27;MALAGASY&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Aboriginal Australian&#x27;, &#x27;identifier&#x27;: &#x27;C154875&#x27;, &#x27;definition&#x27;: &#x27;The native people of Australia.&#x27;, &#x27;submission&#x27;: &#x27;ABORIGINAL AUSTRALIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Inupiat Eskimo&#x27;, &#x27;identifier&#x27;: &#x27;C44268&#x27;, &#x27;definition&#x27;: &#x27;The native people inhabiting the territory spanning the Norton Sound on the Bering Sea to the Canadian border.&#x27;, &#x27;submission&#x27;: &#x27;INUPIAT INUIT&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Micronesian&#x27;, &#x27;identifier&#x27;: &#x27;C43402&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Micronesia.&#x27;, &#x27;submission&#x27;: &#x27;MICRONESIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Caribbean Indian&#x27;, &#x27;identifier&#x27;: &#x27;C77810&#x27;, &#x27;definition&#x27;: &#x27;The native people of the Caribbean.&#x27;, &#x27;submission&#x27;: &#x27;CARIBBEAN INDIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Pakistani&#x27;, &#x27;identifier&#x27;: &#x27;C43427&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Pakistan.&#x27;, &#x27;submission&#x27;: &#x27;PAKISTANI&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Alaska Native&#x27;, &#x27;identifier&#x27;: &#x27;C18237&#x27;, &#x27;definition&#x27;: &#x27;The native people of Alaska.&#x27;, &#x27;submission&#x27;: &#x27;ALASKA NATIVE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Botswanan&#x27;, &#x27;identifier&#x27;: &#x27;C43830&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Botswana.&#x27;, &#x27;submission&#x27;: &#x27;BOTSWANAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Polynesian&#x27;, &#x27;identifier&#x27;: &#x27;C43405&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Polynesia.&#x27;, &#x27;submission&#x27;: &#x27;POLYNESIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Filipino&#x27;, &#x27;identifier&#x27;: &#x27;C43393&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Philippines.&#x27;, &#x27;submission&#x27;: &#x27;FILIPINO&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Chinese&#x27;, &#x27;identifier&#x27;: &#x27;C43391&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of China.&#x27;, &#x27;submission&#x27;: &#x27;CHINESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Taiwanese&#x27;, &#x27;identifier&#x27;: &#x27;C43675&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Taiwan.&#x27;, &#x27;submission&#x27;: &#x27;TAIWANESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;North Coast of Africa&#x27;, &#x27;identifier&#x27;: &#x27;C77813&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of North Africa.&#x27;, &#x27;submission&#x27;: &#x27;NORTH AFRICAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Bhutanese&#x27;, &#x27;identifier&#x27;: &#x27;C43673&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Bhutan.&#x27;, &#x27;submission&#x27;: &#x27;BHUTANESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Ethiopian&#x27;, &#x27;identifier&#x27;: &#x27;C43831&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Ethiopia.&#x27;, &#x27;submission&#x27;: &#x27;ETHIOPIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;European&#x27;, &#x27;identifier&#x27;: &#x27;C43851&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Europe.&#x27;, &#x27;submission&#x27;: &#x27;EUROPEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Unknown&#x27;, &#x27;identifier&#x27;: &#x27;C17998&#x27;, &#x27;synonym&#x27;: &#x27;U; UNK; Unknown&#x27;, &#x27;definition&#x27;: &#x27;Not known&#x27;, &#x27;submission&#x27;: &#x27;UNKNOWN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;American Indian or Alaska Native&#x27;, &#x27;identifier&#x27;: &#x27;C41259&#x27;, &#x27;submission&#x27;: &#x27;AMERICAN INDIAN OR ALASKA NATIVE&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of North and South America (including Central America)&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White Caribbean&#x27;, &#x27;identifier&#x27;: &#x27;C77816&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of Europe&#x27;, &#x27;submission&#x27;: &#x27;WHITE CARIBBEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Northern European&#x27;, &#x27;identifier&#x27;: &#x27;C77814&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Northern Europe.&#x27;, &#x27;submission&#x27;: &#x27;NORTHERN EUROPEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Zairean&#x27;, &#x27;identifier&#x27;: &#x27;C43835&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Zaire.&#x27;, &#x27;submission&#x27;: &#x27;ZAIREAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Namibian&#x27;, &#x27;identifier&#x27;: &#x27;C43833&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Namibia.&#x27;, &#x27;submission&#x27;: &#x27;NAMIBIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Burmese&#x27;, &#x27;identifier&#x27;: &#x27;C43674&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Myanmar (formerly Burma).&#x27;, &#x27;submission&#x27;: &#x27;BURMESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Sri Lankan&#x27;, &#x27;identifier&#x27;: &#x27;C43672&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Sri Lanka.&#x27;, &#x27;submission&#x27;: &#x27;SRI LANKAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Mediterranean&#x27;, &#x27;identifier&#x27;: &#x27;C77811&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the countries surrounding the Mediterranean sea.&#x27;, &#x27;submission&#x27;: &#x27;MEDITERRANEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Dominican&#x27;, &#x27;identifier&#x27;: &#x27;C67117&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Dominican Republic.&#x27;, &#x27;submission&#x27;: &#x27;DOMINICAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Yupik Eskimo&#x27;, &#x27;identifier&#x27;: &#x27;C44270&#x27;, &#x27;definition&#x27;: &#x27;The native people inhabiting western&#x27;, &#x27;submission&#x27;: &#x27;YUPIK ESKIMO&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Liberian&#x27;, &#x27;identifier&#x27;: &#x27;C43832&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Liberia.&#x27;, &#x27;submission&#x27;: &#x27;LIBERIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Native Hawaiian or Other Pacific Islander&#x27;, &#x27;identifier&#x27;: &#x27;C41219&#x27;, &#x27;submission&#x27;: &#x27;NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER&#x27;, &#x27;definition&#x27;: &#x27;Denotes a person having origins in any of the original peoples of Hawaii&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Melanesian&#x27;, &#x27;identifier&#x27;: &#x27;C43409&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Melanesia.&#x27;, &#x27;submission&#x27;: &#x27;MELANESIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Korean&#x27;, &#x27;identifier&#x27;: &#x27;C43395&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of North and South Korea.&#x27;, &#x27;submission&#x27;: &#x27;KOREAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Siberian Eskimo&#x27;, &#x27;identifier&#x27;: &#x27;C44269&#x27;, &#x27;definition&#x27;: &#x27;The native Yupik people inhabiting the coast of the Chukchi Peninsula in the far northeast of the Russian Federation and on St. Lawrence Island in Alaska.&#x27;, &#x27;submission&#x27;: &#x27;SIBERIAN ESKIMO&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Japanese&#x27;, &#x27;identifier&#x27;: &#x27;C43392&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Japan.&#x27;, &#x27;submission&#x27;: &#x27;JAPANESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian&#x27;, &#x27;identifier&#x27;: &#x27;C41260&#x27;, &#x27;submission&#x27;: &#x27;ASIAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Far East&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;African&#x27;, &#x27;identifier&#x27;: &#x27;C42331&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of sub-Saharan Africa.&#x27;, &#x27;submission&#x27;: &#x27;AFRICAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Black or African American&#x27;, &#x27;identifier&#x27;: &#x27;C16352&#x27;, &#x27;submission&#x27;: &#x27;BLACK OR AFRICAN AMERICAN&#x27;, &#x27;definition&#x27;: &quot;A person having origins in any of the black racial groups of Africa. Terms such as &#x27;Haitian&#x27; or &#x27;Negro&#x27; can be used in addition to &#x27;Black or African American.&#x27; (FDA)&quot;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Western European&#x27;, &#x27;identifier&#x27;: &#x27;C77817&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Western Europe.&#x27;, &#x27;submission&#x27;: &#x27;WESTERN EUROPEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Nigerian&#x27;, &#x27;identifier&#x27;: &#x27;C43834&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Nigeria.&#x27;, &#x27;submission&#x27;: &#x27;NIGERIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Collected Race Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C128689&#x27;, &#x27;synonym&#x27;: &#x27;Race As Collected&#x27;, &#x27;definition&#x27;: &#x27;A terminology codelist relevant to the race of an individual as collected on the case report form.&#x27;, &#x27;submission&#x27;: &#x27;RACEC&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'definition': 'Not known',\n",
       "   'identifier': 'C17998',\n",
       "   'preferred_term': 'Unknown',\n",
       "   'submission': 'U',\n",
       "   'synonym': 'U; UNK; Unknown'}],\n",
       " [{'definition': 'The assemblage of physical properties or qualities by which male is distinguished from female; the physical difference between male and female; the distinguishing peculiarity of male or female. (NCI)',\n",
       "   'identifier': 'C66731',\n",
       "   'preferred_term': 'CDISC SDTM Sex of Individual Terminology',\n",
       "   'submission': 'SEX',\n",
       "   'synonym': 'Sex'}],\n",
       " [{'definition': 'A person having origins in the original peoples of sub-Saharan Africa and Central America.',\n",
       "   'identifier': 'C128991',\n",
       "   'preferred_term': 'Black Central American',\n",
       "   'submission': 'BLACK CENTRAL AMERICAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Viet Nam.',\n",
       "   'identifier': 'C43396',\n",
       "   'preferred_term': 'Vietnamese',\n",
       "   'submission': 'VIETNAMESE'}],\n",
       " [{'definition': 'Denotes a person with European',\n",
       "   'identifier': 'C41261',\n",
       "   'preferred_term': 'White',\n",
       "   'submission': 'WHITE'}],\n",
       " [{'definition': 'A person having origins in the original peoples of sub-Saharan Africa and South America.',\n",
       "   'identifier': 'C128992',\n",
       "   'preferred_term': 'Black South American',\n",
       "   'submission': 'BLACK SOUTH AMERICAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Laos.',\n",
       "   'identifier': 'C43397',\n",
       "   'preferred_term': 'Laotian',\n",
       "   'submission': 'LAOTIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Eastern Europe.',\n",
       "   'identifier': 'C77819',\n",
       "   'preferred_term': 'Eastern European',\n",
       "   'submission': 'EASTERN EUROPEAN'}],\n",
       " [{'definition': 'A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C16576',\n",
       "   'preferred_term': 'Female',\n",
       "   'submission': 'F',\n",
       "   'synonym': 'Female'}],\n",
       " [{'definition': ' or which combine features of both sexes. (NCI)',\n",
       "   'identifier': 'C45908',\n",
       "   'preferred_term': 'Intersex  ',\n",
       "   'submission': 'UNDIFFERENTIATED',\n",
       "   'synonym': ' \"A person (one of unisexual specimens) who is born with genitalia and/or secondary sexual characteristics of indeterminate sex'}],\n",
       " [{'definition': 'A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C20197',\n",
       "   'preferred_term': 'Male',\n",
       "   'submission': 'M',\n",
       "   'synonym': 'Male'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Indian subcontinent.',\n",
       "   'identifier': 'C41262',\n",
       "   'preferred_term': 'Asian Indian',\n",
       "   'submission': 'ASIAN INDIAN'}],\n",
       " [{'definition': 'A person having origins in the original peoples of sub-Saharan Africa and the United States.',\n",
       "   'identifier': 'C128937',\n",
       "   'preferred_term': 'African American',\n",
       "   'submission': 'AFRICAN AMERICAN'}],\n",
       " [{'definition': 'A person having origins in the original peoples of Europe',\n",
       "   'identifier': 'C128993',\n",
       "   'preferred_term': 'White Central American',\n",
       "   'submission': 'WHITE CENTRAL AMERICAN'}],\n",
       " [{'definition': 'The native people originating in China around the Yellow River or Hoang Ho.',\n",
       "   'identifier': 'C43398',\n",
       "   'preferred_term': 'Hmong',\n",
       "   'submission': 'HMONG'}],\n",
       " [{'definition': \"A person having origins in any of the black racial groups of Africa. Terms such as 'Haitian' or 'Negro' can be used in addition to 'Black or African American.' (FDA)\",\n",
       "   'identifier': 'C16352',\n",
       "   'preferred_term': 'Black or African American',\n",
       "   'submission': 'BLACK OR AFRICAN AMERICAN'}],\n",
       " [{'definition': 'Denotes a person having origins in any of the original peoples of Hawaii',\n",
       "   'identifier': 'C41219',\n",
       "   'preferred_term': 'Native Hawaiian or Other Pacific Islander',\n",
       "   'submission': 'NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of North and South America (including Central America)',\n",
       "   'identifier': 'C41259',\n",
       "   'preferred_term': 'American Indian or Alaska Native',\n",
       "   'submission': 'AMERICAN INDIAN OR ALASKA NATIVE'}],\n",
       " [{'definition': 'Denotes a person with European',\n",
       "   'identifier': 'C41261',\n",
       "   'preferred_term': 'White',\n",
       "   'submission': 'WHITE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Far East',\n",
       "   'identifier': 'C41260',\n",
       "   'preferred_term': 'Asian',\n",
       "   'submission': 'ASIAN'}],\n",
       " [{'identifier': 'C74457',\n",
       "   'preferred_term': 'CDISC SDTM Race Terminology Race',\n",
       "   'submission': 'RACE',\n",
       "   'synonym': 'Terminology codelist used to identify the race of an individual within the Clinical Data Interchange Standards Consortium Study Data Tabulation Model.'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Arabian peninsula and surrounding territories in the Middle East and northern Africa.',\n",
       "   'identifier': 'C43876',\n",
       "   'preferred_term': 'Arab',\n",
       "   'submission': 'ARAB'}],\n",
       " [{'definition': 'The native people of Central America.',\n",
       "   'identifier': 'C44950',\n",
       "   'preferred_term': 'Central American Indian',\n",
       "   'submission': 'CENTRAL AMERICAN INDIAN'}],\n",
       " [{'definition': 'A person having origins in the original peoples of sub-Saharan Africa and the Caribbean.',\n",
       "   'identifier': 'C41226',\n",
       "   'preferred_term': 'African Caribbean',\n",
       "   'submission': 'AFRICAN CARIBBEAN'}],\n",
       " [{'definition': 'A person having origins in the original peoples of sub-Saharan Africa or the Caribbean.',\n",
       "   'identifier': 'C128938',\n",
       "   'preferred_term': 'Black',\n",
       "   'submission': 'BLACK'}],\n",
       " [{'definition': 'A person having origins in the original peoples of Europe',\n",
       "   'identifier': 'C128994',\n",
       "   'preferred_term': 'White South American',\n",
       "   'submission': 'WHITE SOUTH AMERICAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Cambodia (formerly Kampuchea).',\n",
       "   'identifier': 'C43399',\n",
       "   'preferred_term': 'Cambodian',\n",
       "   'submission': 'CAMBODIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Middle East.',\n",
       "   'identifier': 'C77820',\n",
       "   'preferred_term': 'Middle Eastern',\n",
       "   'submission': 'MIDDLE EASTERN'}],\n",
       " [{'definition': 'The native people of North America.',\n",
       "   'identifier': 'C43877',\n",
       "   'preferred_term': 'American Indian',\n",
       "   'submission': 'AMERICAN INDIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Indonesia.',\n",
       "   'identifier': 'C43715',\n",
       "   'preferred_term': 'Indonesian',\n",
       "   'submission': 'INDONESIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Bahamas.',\n",
       "   'identifier': 'C67271',\n",
       "   'preferred_term': 'Bahamian',\n",
       "   'submission': 'BAHAMIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Malaysia.',\n",
       "   'identifier': 'C43716',\n",
       "   'preferred_term': 'Malaysian',\n",
       "   'submission': 'MALAYSIAN'}],\n",
       " [{'definition': 'The native people of South America.',\n",
       "   'identifier': 'C44953',\n",
       "   'preferred_term': 'South American Indian',\n",
       "   'submission': 'SOUTH AMERICAN INDIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Russia.',\n",
       "   'identifier': 'C43860',\n",
       "   'preferred_term': 'Russian',\n",
       "   'submission': 'RUSSIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Barbados.',\n",
       "   'identifier': 'C43823',\n",
       "   'preferred_term': 'Barbadian',\n",
       "   'submission': 'BARBADIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Okinawa.',\n",
       "   'identifier': 'C43717',\n",
       "   'preferred_term': 'Okinawan',\n",
       "   'submission': 'OKINAWAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Dominica.',\n",
       "   'identifier': 'C43824',\n",
       "   'preferred_term': 'Dominica Islander',\n",
       "   'submission': 'DOMINICA ISLANDER'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Iwo Jima.',\n",
       "   'identifier': 'C43718',\n",
       "   'preferred_term': 'Iwo Jiman',\n",
       "   'submission': 'IWO JIMAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Haiti.',\n",
       "   'identifier': 'C43825',\n",
       "   'preferred_term': 'Haitian',\n",
       "   'submission': 'HAITIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Maldives.',\n",
       "   'identifier': 'C43719',\n",
       "   'preferred_term': 'Maldivian',\n",
       "   'submission': 'MALDIVIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Jamaica.',\n",
       "   'identifier': 'C43826',\n",
       "   'preferred_term': 'Jamaican',\n",
       "   'submission': 'JAMAICAN'}],\n",
       " [{'definition': 'The native people of Greenland.',\n",
       "   'identifier': 'C44265',\n",
       "   'preferred_term': 'Greenland Eskimo',\n",
       "   'submission': 'GREENLAND INUIT'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Mongolia.',\n",
       "   'identifier': 'C43864',\n",
       "   'preferred_term': 'Mongolian',\n",
       "   'submission': 'MONGOLIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Tobago.',\n",
       "   'identifier': 'C43827',\n",
       "   'preferred_term': 'Tobagoan',\n",
       "   'submission': 'TOBAGOAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Nepal.',\n",
       "   'identifier': 'C43720',\n",
       "   'preferred_term': 'Nepalese',\n",
       "   'submission': 'NEPALESE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Thailand.',\n",
       "   'identifier': 'C43400',\n",
       "   'preferred_term': 'Thai',\n",
       "   'submission': 'THAI'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Trinidad.',\n",
       "   'identifier': 'C43828',\n",
       "   'preferred_term': 'Trinidadian',\n",
       "   'submission': 'TRINIDADIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Singapore.',\n",
       "   'identifier': 'C43721',\n",
       "   'preferred_term': 'Singaporean',\n",
       "   'submission': 'SINGAPOREAN'}],\n",
       " [{'definition': 'The native people of the Western Cape in southern Africa.',\n",
       "   'identifier': 'C154874',\n",
       "   'preferred_term': 'Khoisan',\n",
       "   'submission': 'KHOISAN'}],\n",
       " [{'definition': 'A person having origins in the original peoples of Asia and the United States.',\n",
       "   'identifier': 'C16310',\n",
       "   'preferred_term': 'Asian American',\n",
       "   'submission': 'ASIAN AMERICAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the West Indies.',\n",
       "   'identifier': 'C43829',\n",
       "   'preferred_term': 'West Indian',\n",
       "   'submission': 'WEST INDIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Bangladesh.',\n",
       "   'identifier': 'C43671',\n",
       "   'preferred_term': 'Bangladeshi',\n",
       "   'submission': 'BANGLADESHI'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Madagascar.',\n",
       "   'identifier': 'C43722',\n",
       "   'preferred_term': 'Malagasy',\n",
       "   'submission': 'MALAGASY'}],\n",
       " [{'definition': 'The native people of Australia.',\n",
       "   'identifier': 'C154875',\n",
       "   'preferred_term': 'Aboriginal Australian',\n",
       "   'submission': 'ABORIGINAL AUSTRALIAN'}],\n",
       " [{'definition': 'The native people inhabiting the territory spanning the Norton Sound on the Bering Sea to the Canadian border.',\n",
       "   'identifier': 'C44268',\n",
       "   'preferred_term': 'Inupiat Eskimo',\n",
       "   'submission': 'INUPIAT INUIT'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Micronesia.',\n",
       "   'identifier': 'C43402',\n",
       "   'preferred_term': 'Micronesian',\n",
       "   'submission': 'MICRONESIAN'}],\n",
       " [{'definition': 'The native people of the Caribbean.',\n",
       "   'identifier': 'C77810',\n",
       "   'preferred_term': 'Caribbean Indian',\n",
       "   'submission': 'CARIBBEAN INDIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Pakistan.',\n",
       "   'identifier': 'C43427',\n",
       "   'preferred_term': 'Pakistani',\n",
       "   'submission': 'PAKISTANI'}],\n",
       " [{'definition': 'The native people of Alaska.',\n",
       "   'identifier': 'C18237',\n",
       "   'preferred_term': 'Alaska Native',\n",
       "   'submission': 'ALASKA NATIVE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Botswana.',\n",
       "   'identifier': 'C43830',\n",
       "   'preferred_term': 'Botswanan',\n",
       "   'submission': 'BOTSWANAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Polynesia.',\n",
       "   'identifier': 'C43405',\n",
       "   'preferred_term': 'Polynesian',\n",
       "   'submission': 'POLYNESIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Philippines.',\n",
       "   'identifier': 'C43393',\n",
       "   'preferred_term': 'Filipino',\n",
       "   'submission': 'FILIPINO'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of China.',\n",
       "   'identifier': 'C43391',\n",
       "   'preferred_term': 'Chinese',\n",
       "   'submission': 'CHINESE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Taiwan.',\n",
       "   'identifier': 'C43675',\n",
       "   'preferred_term': 'Taiwanese',\n",
       "   'submission': 'TAIWANESE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of North Africa.',\n",
       "   'identifier': 'C77813',\n",
       "   'preferred_term': 'North Coast of Africa',\n",
       "   'submission': 'NORTH AFRICAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Bhutan.',\n",
       "   'identifier': 'C43673',\n",
       "   'preferred_term': 'Bhutanese',\n",
       "   'submission': 'BHUTANESE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Ethiopia.',\n",
       "   'identifier': 'C43831',\n",
       "   'preferred_term': 'Ethiopian',\n",
       "   'submission': 'ETHIOPIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Europe.',\n",
       "   'identifier': 'C43851',\n",
       "   'preferred_term': 'European',\n",
       "   'submission': 'EUROPEAN'}],\n",
       " [{'definition': 'Not known',\n",
       "   'identifier': 'C17998',\n",
       "   'preferred_term': 'Unknown',\n",
       "   'submission': 'UNKNOWN',\n",
       "   'synonym': 'U; UNK; Unknown'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of North and South America (including Central America)',\n",
       "   'identifier': 'C41259',\n",
       "   'preferred_term': 'American Indian or Alaska Native',\n",
       "   'submission': 'AMERICAN INDIAN OR ALASKA NATIVE'}],\n",
       " [{'definition': 'A person having origins in the original peoples of Europe',\n",
       "   'identifier': 'C77816',\n",
       "   'preferred_term': 'White Caribbean',\n",
       "   'submission': 'WHITE CARIBBEAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Northern Europe.',\n",
       "   'identifier': 'C77814',\n",
       "   'preferred_term': 'Northern European',\n",
       "   'submission': 'NORTHERN EUROPEAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Zaire.',\n",
       "   'identifier': 'C43835',\n",
       "   'preferred_term': 'Zairean',\n",
       "   'submission': 'ZAIREAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Namibia.',\n",
       "   'identifier': 'C43833',\n",
       "   'preferred_term': 'Namibian',\n",
       "   'submission': 'NAMIBIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Myanmar (formerly Burma).',\n",
       "   'identifier': 'C43674',\n",
       "   'preferred_term': 'Burmese',\n",
       "   'submission': 'BURMESE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Sri Lanka.',\n",
       "   'identifier': 'C43672',\n",
       "   'preferred_term': 'Sri Lankan',\n",
       "   'submission': 'SRI LANKAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the countries surrounding the Mediterranean sea.',\n",
       "   'identifier': 'C77811',\n",
       "   'preferred_term': 'Mediterranean',\n",
       "   'submission': 'MEDITERRANEAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Dominican Republic.',\n",
       "   'identifier': 'C67117',\n",
       "   'preferred_term': 'Dominican',\n",
       "   'submission': 'DOMINICAN'}],\n",
       " [{'definition': 'The native people inhabiting western',\n",
       "   'identifier': 'C44270',\n",
       "   'preferred_term': 'Yupik Eskimo',\n",
       "   'submission': 'YUPIK ESKIMO'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Liberia.',\n",
       "   'identifier': 'C43832',\n",
       "   'preferred_term': 'Liberian',\n",
       "   'submission': 'LIBERIAN'}],\n",
       " [{'definition': 'Denotes a person having origins in any of the original peoples of Hawaii',\n",
       "   'identifier': 'C41219',\n",
       "   'preferred_term': 'Native Hawaiian or Other Pacific Islander',\n",
       "   'submission': 'NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Melanesia.',\n",
       "   'identifier': 'C43409',\n",
       "   'preferred_term': 'Melanesian',\n",
       "   'submission': 'MELANESIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of North and South Korea.',\n",
       "   'identifier': 'C43395',\n",
       "   'preferred_term': 'Korean',\n",
       "   'submission': 'KOREAN'}],\n",
       " [{'definition': 'The native Yupik people inhabiting the coast of the Chukchi Peninsula in the far northeast of the Russian Federation and on St. Lawrence Island in Alaska.',\n",
       "   'identifier': 'C44269',\n",
       "   'preferred_term': 'Siberian Eskimo',\n",
       "   'submission': 'SIBERIAN ESKIMO'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Japan.',\n",
       "   'identifier': 'C43392',\n",
       "   'preferred_term': 'Japanese',\n",
       "   'submission': 'JAPANESE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Far East',\n",
       "   'identifier': 'C41260',\n",
       "   'preferred_term': 'Asian',\n",
       "   'submission': 'ASIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of sub-Saharan Africa.',\n",
       "   'identifier': 'C42331',\n",
       "   'preferred_term': 'African',\n",
       "   'submission': 'AFRICAN'}],\n",
       " [{'definition': \"A person having origins in any of the black racial groups of Africa. Terms such as 'Haitian' or 'Negro' can be used in addition to 'Black or African American.' (FDA)\",\n",
       "   'identifier': 'C16352',\n",
       "   'preferred_term': 'Black or African American',\n",
       "   'submission': 'BLACK OR AFRICAN AMERICAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Western Europe.',\n",
       "   'identifier': 'C77817',\n",
       "   'preferred_term': 'Western European',\n",
       "   'submission': 'WESTERN EUROPEAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Nigeria.',\n",
       "   'identifier': 'C43834',\n",
       "   'preferred_term': 'Nigerian',\n",
       "   'submission': 'NIGERIAN'}],\n",
       " [{'definition': 'A terminology codelist relevant to the race of an individual as collected on the case report form.',\n",
       "   'identifier': 'C128689',\n",
       "   'preferred_term': 'CDISC SDTM Collected Race Terminology',\n",
       "   'submission': 'RACEC',\n",
       "   'synonym': 'Race As Collected'}]]"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (c:Concept) RETURN c"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "79 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (cl:Concept) WHERE cl.identifier = 'C128689'\n",
    "  WITH cl\n",
    "  MATCH (cli:Concept) WHERE cli.identifier <> 'C128689' AND NOT (cli)--()\n",
    "  WITH cl, COLLECT(cli) as children\n",
    "  UNWIND children as child\n",
    "  CREATE (cl)-[:NARROWER]->(child)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "2 properties set.\n",
      "1 relationships created.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>ci</th>\n",
       "        <th>q</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;DM&#x27;, &#x27;name&#x27;: &#x27;Demographics&#x27;}</td>\n",
       "        <td>{&#x27;question_text&#x27;: &#x27;Race?&#x27;, &#x27;identifier&#x27;: &#x27;Q2&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'DM', 'name': 'Demographics'},\n",
       "  {'identifier': 'Q2', 'question_text': 'Race?'}]]"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (ci:CollectionInstrument {identifier: 'DM'})\n",
    "  CREATE (ci)-[:HAS_QUESTION]->(q:Question {identifier: 'Q2', question_text: 'Race?'})\n",
    "  RETURN ci,q"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Note we need the bit to restrict to the RACE codelist"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "6 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (q:Question {identifier: 'Q2'})\n",
    "  WITH q\n",
    "  UNWIND ['C43831', 'C43851', 'C17998', 'C41259', 'C77816', 'C77814'] AS id\n",
    "  MATCH (cl:Concept)-[:NARROWER]->(cli:Concept) WHERE cl.identifier = 'C128689' AND cli.identifier = id\n",
    "  CREATE (q)-[:HAS_RESPONSE]->(cli)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "3 relationships created.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>sub</th>\n",
       "        <th>c.submission</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;1234&#x27;}</td>\n",
       "        <td>ETHIOPIAN</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': '1234'}, 'ETHIOPIAN']]"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (sub:Subject {identifier: '1234'}), (q:Question {identifier: 'Q2'})\n",
    "  CREATE (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q)\n",
    "  WITH sub,r\n",
    "  MATCH (c:Concept {identifier: 'C43831'})\n",
    "  CREATE (r)-[:VALUE]->(c)\n",
    "  RETURN sub, c.submission"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "```cypher\n",
    "MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[:PARTICIPATES_IN]-(sub:Subject)\n",
    "MATCH (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q:Question)\n",
    "MATCH (sub)-[:RESPONDED]->(r:Response)-[:VALUE]->(c:Concept)\n",
    "RETURN DISTINCT s.identifier as STUDY, sub.identifier as SUBJID, q.identifier as Question, q.question_text as Text, c.submission as value\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>STUDY</th>\n",
       "        <th>SUBJID</th>\n",
       "        <th>Question</th>\n",
       "        <th>Text</th>\n",
       "        <th>value</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1235</td>\n",
       "        <td>Q1</td>\n",
       "        <td>Sex?</td>\n",
       "        <td>F</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>Q1</td>\n",
       "        <td>Sex?</td>\n",
       "        <td>F</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>Q2</td>\n",
       "        <td>Race?</td>\n",
       "        <td>ETHIOPIAN</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['http://data.acmepharma.com/clinicaltrial/12345', '1235', 'Q1', 'Sex?', 'F'],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345', '1234', 'Q1', 'Sex?', 'F'],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345',\n",
       "  '1234',\n",
       "  'Q2',\n",
       "  'Race?',\n",
       "  'ETHIOPIAN']]"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[:PARTICIPATES_IN]-(sub:Subject)\n",
    "  MATCH (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q:Question)\n",
    "  MATCH (sub)-[:RESPONDED]->(r:Response)-[:VALUE]->(c:Concept)\n",
    "  RETURN DISTINCT s.identifier as STUDY, sub.identifier as SUBJID, q.identifier as Question, q.question_text as Text, c.submission as value"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "6 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>c.identifier</th>\n",
       "        <th>c.submission</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C43851</td>\n",
       "        <td>EUROPEAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C41259</td>\n",
       "        <td>AMERICAN INDIAN OR ALASKA NATIVE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C77814</td>\n",
       "        <td>NORTHERN EUROPEAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C43831</td>\n",
       "        <td>ETHIOPIAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C17998</td>\n",
       "        <td>UNKNOWN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C77816</td>\n",
       "        <td>WHITE CARIBBEAN</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['C43851', 'EUROPEAN'],\n",
       " ['C41259', 'AMERICAN INDIAN OR ALASKA NATIVE'],\n",
       " ['C77814', 'NORTHERN EUROPEAN'],\n",
       " ['C43831', 'ETHIOPIAN'],\n",
       " ['C17998', 'UNKNOWN'],\n",
       " ['C77816', 'WHITE CARIBBEAN']]"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (q:Question)-[:HAS_RESPONSE]->(c:Concept) WHERE q.identifier = 'Q2' RETURN c.identifier, c.submission"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>c.identifier</th>\n",
       "        <th>c.submission</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C41260</td>\n",
       "        <td>ASIAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C41219</td>\n",
       "        <td>NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C16352</td>\n",
       "        <td>BLACK OR AFRICAN AMERICAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C41261</td>\n",
       "        <td>WHITE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C41259</td>\n",
       "        <td>AMERICAN INDIAN OR ALASKA NATIVE</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['C41260', 'ASIAN'],\n",
       " ['C41219', 'NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER'],\n",
       " ['C16352', 'BLACK OR AFRICAN AMERICAN'],\n",
       " ['C41261', 'WHITE'],\n",
       " ['C41259', 'AMERICAN INDIAN OR ALASKA NATIVE']]"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (cl:Concept)-[:NARROWER]->(c:Concept) WHERE cl.identifier = 'C74457' RETURN c.identifier, c.submission"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "Now lets link RACE and RACEC"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (race:Concept {identifier: 'C74457'})\n",
    "  MATCH (racec:Concept {identifier: 'C128689'})\n",
    "  WITH race, racec\n",
    "  UNWIND [{collect: 'C43831', report: 'C16352'}, {collect: 'C43851', report: 'C41261'}, {collect: 'C17998', report: ''}, {collect: 'C41259', report: 'C41259'}, {collect: 'C77816', report: 'C41261'}, {collect: 'C77814', report: 'C41261'}] AS id\n",
    "  MATCH (race)-[:NARROWER]->(cli1:Concept) WHERE cli1.identifier = id.report\n",
    "  MATCH (racec)-[:NARROWER]->(cli2:Concept) WHERE cli2.identifier = id.collect\n",
    "  CREATE (cli1)-[:NARROWER]->(cli2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>race.submission</th>\n",
       "        <th>c1.submission</th>\n",
       "        <th>c2.submission</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>RACE</td>\n",
       "        <td>BLACK OR AFRICAN AMERICAN</td>\n",
       "        <td>ETHIOPIAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>RACE</td>\n",
       "        <td>WHITE</td>\n",
       "        <td>NORTHERN EUROPEAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>RACE</td>\n",
       "        <td>WHITE</td>\n",
       "        <td>EUROPEAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>RACE</td>\n",
       "        <td>WHITE</td>\n",
       "        <td>WHITE CARIBBEAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>RACE</td>\n",
       "        <td>AMERICAN INDIAN OR ALASKA NATIVE</td>\n",
       "        <td>AMERICAN INDIAN OR ALASKA NATIVE</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['RACE', 'BLACK OR AFRICAN AMERICAN', 'ETHIOPIAN'],\n",
       " ['RACE', 'WHITE', 'NORTHERN EUROPEAN'],\n",
       " ['RACE', 'WHITE', 'EUROPEAN'],\n",
       " ['RACE', 'WHITE', 'WHITE CARIBBEAN'],\n",
       " ['RACE',\n",
       "  'AMERICAN INDIAN OR ALASKA NATIVE',\n",
       "  'AMERICAN INDIAN OR ALASKA NATIVE']]"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (race:Concept {identifier: 'C74457'})-[:NARROWER]->(c1:Concept)-[:NARROWER]->(c2:Concept)\n",
    "  RETURN race.submission, c1.submission, c2.submission"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>STUDY</th>\n",
       "        <th>SUBJID</th>\n",
       "        <th>Question</th>\n",
       "        <th>Text</th>\n",
       "        <th>Captured</th>\n",
       "        <th>Reported</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>Q2</td>\n",
       "        <td>Race?</td>\n",
       "        <td>ETHIOPIAN</td>\n",
       "        <td>BLACK OR AFRICAN AMERICAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>Q1</td>\n",
       "        <td>Sex?</td>\n",
       "        <td>F</td>\n",
       "        <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1235</td>\n",
       "        <td>Q1</td>\n",
       "        <td>Sex?</td>\n",
       "        <td>F</td>\n",
       "        <td>None</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['http://data.acmepharma.com/clinicaltrial/12345',\n",
       "  '1234',\n",
       "  'Q2',\n",
       "  'Race?',\n",
       "  'ETHIOPIAN',\n",
       "  'BLACK OR AFRICAN AMERICAN'],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345',\n",
       "  '1234',\n",
       "  'Q1',\n",
       "  'Sex?',\n",
       "  'F',\n",
       "  None],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345',\n",
       "  '1235',\n",
       "  'Q1',\n",
       "  'Sex?',\n",
       "  'F',\n",
       "  None]]"
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[:PARTICIPATES_IN]-(sub:Subject)\n",
    "  MATCH (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q:Question)\n",
    "  MATCH (sub)-[:RESPONDED]->(r:Response)-[:VALUE]->(c:Concept)\n",
    "  OPTIONAL MATCH (c)<-[:NARROWER]-(rep:Concept)<-[:NARROWER]-(rep2:Concept)\n",
    "  RETURN DISTINCT s.identifier as STUDY, sub.identifier as SUBJID, q.identifier as Question, q.question_text as Text, \n",
    "    c.submission as Captured, rep.submission as Reported"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Add another subject and their data. Set up subject '1236' and responses to Q1 and Q2.\n",
    "\n",
    "```cypher\n",
    "MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})\n",
    "CREATE (s)<-[:PARTICIPATES_IN]-(sub:Subject {identifier: '1236'})\n",
    "WITH sub\n",
    "MATCH (q1:Question {identifier: 'Q1'}), (q2:Question {identifier: 'Q2'})\n",
    "CREATE (sub)-[:RESPONDED]->(r1:Response)-[:TO]->(q1)\n",
    "CREATE (sub)-[:RESPONDED]->(r2:Response)-[:TO]->(q2)\n",
    "WITH sub, r1, r2, q1, q2 \n",
    "MATCH (c1:Concept {identifier: 'C20197'})\n",
    "MATCH (c2:Concept {identifier: 'C77814'})\n",
    "CREATE (r1)-[:VALUE]->(c1)\n",
    "CREATE (r2)-[:VALUE]->(c2)\n",
    "RETURN sub\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 nodes created.\n",
      "1 properties set.\n",
      "7 relationships created.\n",
      "3 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>sub</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;1236&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': '1236'}]]"
      ]
     },
     "execution_count": 47,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})\n",
    "  CREATE (s)<-[:PARTICIPATES_IN]-(sub:Subject {identifier: '1236'})\n",
    "  WITH sub\n",
    "  MATCH (q1:Question {identifier: 'Q1'}), (q2:Question {identifier: 'Q2'})\n",
    "  CREATE (sub)-[:RESPONDED]->(r1:Response)-[:TO]->(q1)\n",
    "  CREATE (sub)-[:RESPONDED]->(r2:Response)-[:TO]->(q2)\n",
    "  WITH sub, r1, r2, q1, q2 \n",
    "  MATCH (c1:Concept {identifier: 'C20197'})\n",
    "  MATCH (c2:Concept {identifier: 'C77814'})\n",
    "  CREATE (r1)-[:VALUE]->(c1)\n",
    "  CREATE (r2)-[:VALUE]->(c2)\n",
    "  RETURN sub"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "And repeat the query to report the data\n",
    "\n",
    "```cypher\n",
    "MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[:PARTICIPATES_IN]-(sub:Subject)\n",
    "MATCH (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q:Question)\n",
    "MATCH (sub)-[:RESPONDED]->(r:Response)-[:VALUE]->(c:Concept)\n",
    "OPTIONAL MATCH (c)<-[:NARROWER]-(rep:Concept)<-[:NARROWER]-(rep2:Concept)\n",
    "RETURN DISTINCT s.identifier as STUDY, sub.identifier as SUBJID, q.identifier as Question, q.question_text as Text, c.submission as Captured, rep.submission as Reported\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>STUDY</th>\n",
       "        <th>SUBJID</th>\n",
       "        <th>Question</th>\n",
       "        <th>Text</th>\n",
       "        <th>Captured</th>\n",
       "        <th>Reported</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1236</td>\n",
       "        <td>Q2</td>\n",
       "        <td>Race?</td>\n",
       "        <td>NORTHERN EUROPEAN</td>\n",
       "        <td>WHITE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1236</td>\n",
       "        <td>Q1</td>\n",
       "        <td>Sex?</td>\n",
       "        <td>M</td>\n",
       "        <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>Q2</td>\n",
       "        <td>Race?</td>\n",
       "        <td>ETHIOPIAN</td>\n",
       "        <td>BLACK OR AFRICAN AMERICAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>Q1</td>\n",
       "        <td>Sex?</td>\n",
       "        <td>F</td>\n",
       "        <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1235</td>\n",
       "        <td>Q1</td>\n",
       "        <td>Sex?</td>\n",
       "        <td>F</td>\n",
       "        <td>None</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['http://data.acmepharma.com/clinicaltrial/12345',\n",
       "  '1236',\n",
       "  'Q2',\n",
       "  'Race?',\n",
       "  'NORTHERN EUROPEAN',\n",
       "  'WHITE'],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345',\n",
       "  '1236',\n",
       "  'Q1',\n",
       "  'Sex?',\n",
       "  'M',\n",
       "  None],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345',\n",
       "  '1234',\n",
       "  'Q2',\n",
       "  'Race?',\n",
       "  'ETHIOPIAN',\n",
       "  'BLACK OR AFRICAN AMERICAN'],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345',\n",
       "  '1234',\n",
       "  'Q1',\n",
       "  'Sex?',\n",
       "  'F',\n",
       "  None],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345',\n",
       "  '1235',\n",
       "  'Q1',\n",
       "  'Sex?',\n",
       "  'F',\n",
       "  None]]"
      ]
     },
     "execution_count": 48,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[:PARTICIPATES_IN]-(sub:Subject)\n",
    "  MATCH (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q:Question)\n",
    "  MATCH (sub)-[:RESPONDED]->(r:Response)-[:VALUE]->(c:Concept)\n",
    "  OPTIONAL MATCH (c)<-[:NARROWER]-(rep:Concept)<-[:NARROWER]-(rep2:Concept)\n",
    "  RETURN DISTINCT s.identifier as STUDY, sub.identifier as SUBJID, q.identifier as Question, q.question_text as Text, \n",
    "    c.submission as Captured, rep.submission as Reported"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
