{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Installation\n",
    "\n",
    "You will need Neo4j installed on your machine and running. It is assumed to be running on the localhost at port 7474 (the default for Neo4j)\n",
    "\n",
    "Some references I found for setting this notebook up\n",
    "\n",
    "* Setting up juypter https://jupyter.readthedocs.io/en/latest/index.html\n",
    "* Python and Neo4j https://github.com/versae/ipython-cypher\n",
    "* Python and Neo4j https://ipython-cypher.readthedocs.io/en/latest/introduction.html#connections\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Aims\n",
    "\n",
    "The aims of this session is to:\n",
    "\n",
    "1. Get familiar with linked data\n",
    "1. Get familiar with the Neo4j console\n",
    "1. Get familiar with the cypher query syntax\n",
    "\n",
    "# References\n",
    "\n",
    "A quick reference guide\n",
    "\n",
    "* [A quick reference guide](https://neo4j.com/docs/cypher-refcard/current/)\n",
    "* [O'Reilly's Graph Databases by Ian Robinson, Jim Webber and Emil Eifrem](https://neo4j.com/lp/book-graph-databases/?utm_source=google&utm_medium=ppc&utm_campaign=*EU%20-%20Search%20-%20Graph%20Databases&utm_adgroup=*EU%20-%20Search%20-%20Graph%20Databases%20-%20Exact&utm_term=graph%20databases&gclid=EAIaIQobChMIo_unu_SN3wIVjeJ3Ch3BbwJlEAAYAiAAEgIJTvD_BwE)\n",
    "* [Github is here](https://github.com/daveih/LinkedDataClub/tree/master/Session%20One)\n",
    "\n",
    "# View Notebook\n",
    "\n",
    "Go here [nbviewer](http://nbviewer.jupyter.org) and enter the link to [this page](https://github.com/daveih/LinkedDataClub/blob/master/Session%20One/notebook.ipynb).\n",
    "This will display the notebook as an HTML page. Github will also display [the page](https://github.com/daveih/LinkedDataClub/blob/master/Session%20One/notebook.ipynb).\n",
    "\n",
    "# Style\n",
    "\n",
    "Each step within this notebook contains a short description followed by the query as a markdown step\n",
    "\n",
    "```cypher\n",
    "MATCH (n) RETURN (n) // The actual query such that it can be cut and pasted into the Neo4j console\n",
    "```\n",
    "\n",
    "and then the query repeated as a code step such that it can be executed from within this Jupyter notebook.\n",
    "\n",
    "Also note that the _%cypher http://neo4j:ld123@localhost:7474_ string. The _%cypher_ part is the python \"execute this cypher\" command and then _http://neo4j:ld123@localhost:7474_ part is the location of the database with username and password. This is part of the Jupyter notebook operation and not the cypher. As noted above the actual cypher commands are shown separately."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Setup\n",
    "\n",
    "The following just gets the python environment loaded to allow this notebook to communicate with Neo4j and use basic cypher queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Nodes"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This command will delete all nodes. The \"DETACH\" bit will remove all relationships to the node in question (more about these later) and then the DELETE bit removes the node. The match part matches all nodes. \n",
    "\n",
    "Do this now just to ensure that we start with a clean database when re-running\n",
    "\n",
    "```cypher\n",
    "MATCH (n) DETACH DELETE n\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "103 nodes deleted.\n",
      "122 relationship deleted.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n) DETACH DELETE n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Graphs are based on nodes and edges. First simple command will return all nodes. Obviously the database should be empty.\n",
    "\n",
    "```cypher\n",
    "MATCH (n) RETURN n\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n) RETURN n "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This can be dangerous since no limit on number of nodes returned so we can limit the number returned\n",
    "\n",
    "```cypher\n",
    "MATCH (n) RETURN n LIMIT 5\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n) RETURN n LIMIT 5"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create a node with label Person. Return it.\n",
    "\n",
    "```cypher\n",
    "CREATE (n:Person) RETURN n\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{}]]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 CREATE (n:Person) RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create a node with label Person with some properties and values. Return it. Note the return data\n",
    "\n",
    "```cypher\n",
    "CREATE (n:Person {name: 'Andy', title: 'Developer'}) RETURN n\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "2 properties set.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Andy&#x27;, &#x27;title&#x27;: &#x27;Developer&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'name': 'Andy', 'title': 'Developer'}]]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 CREATE (n:Person {name: 'Andy', title: 'Developer'}) RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now return all the nodes we have created\n",
    "\n",
    "```cypher\n",
    "MATCH (n:Person) RETURN n\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Andy&#x27;, &#x27;title&#x27;: &#x27;Developer&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{}], [{'name': 'Andy', 'title': 'Developer'}]]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n:Person) RETURN n "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Note the node with no data. How do we get to refer to this node? How do we access the other node?\n",
    "\n",
    "```cypher\n",
    "MATCH (n:Person) WHERE n.name = \"Andy\" RETURN n\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Andy&#x27;, &#x27;title&#x27;: &#x27;Developer&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'name': 'Andy', 'title': 'Developer'}]]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n:Person) WHERE n.name = \"Andy\" RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Find that node with no data\n",
    "\n",
    "```cypher\n",
    "MATCH (n:Person) RETURN n,ID(n)\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "        <th>ID(n)</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{}</td>\n",
       "        <td>190</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Andy&#x27;, &#x27;title&#x27;: &#x27;Developer&#x27;}</td>\n",
       "        <td>305</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{}, 190], [{'name': 'Andy', 'title': 'Developer'}, 305]]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n:Person) RETURN n,ID(n)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "So set the name property in the node without any data.\n",
    "\n",
    "> **_Note that we need to fill in the ID value from the above query, the value on the {} line_**\n",
    "\n",
    "```cypher\n",
    "MATCH (n:Person) WHERE ID(n) = [ID From Above Result] SET n.name = \"Fred\" RETURN n\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n:Person) WHERE ID(n) = 123 SET n.name = \"Fred\" RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Check that we get the desired result.\n",
    "\n",
    "```cypher\n",
    "MATCH (n:Person) RETURN n,ID(n)\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "        <th>ID(n)</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{}</td>\n",
       "        <td>190</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Andy&#x27;, &#x27;title&#x27;: &#x27;Developer&#x27;}</td>\n",
       "        <td>305</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{}, 190], [{'name': 'Andy', 'title': 'Developer'}, 305]]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n:Person) RETURN n,ID(n)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Relationships\n",
    "\n",
    "Now lets connect the two nodes\n",
    "\n",
    "```cypher\n",
    "MATCH (n1:Person {name:'Andy'}), (n2:Person {name:'Fred'}) CREATE (n1)-[:KNOWS]->(n2)\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n1:Person {name:'Andy'}), (n2:Person {name:'Fred'}) CREATE (n1)-[:KNOWS]->(n2)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's find out who Andy knows\n",
    "\n",
    "```cypher\n",
    "MATCH (n1:Person {name:'Andy'})-[]->(n2:Person) return n2\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n2</th>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n1:Person {name:'Andy'})-[]->(n2:Person) return n2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Note in the previous example we used *-[]->* and did not specify the relationship type. Any relationship could be matched. Lets add 'Sandy' who is married to 'Andy'. Note we add relationships in both directions.\n",
    "\n",
    "```cypher\n",
    "CREATE (n:Person {name: 'Sandy', title: 'Senior Developer'})\n",
    "WITH n\n",
    "MATCH (m:Person {name: 'Andy'})\n",
    "CREATE (m)-[:IS_MARRIED_TO]->(n)\n",
    "CREATE (n)-[:IS_MARRIED_TO]->(m)\n",
    "RETURN n,m\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "2 properties set.\n",
      "2 relationships created.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "        <th>m</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Sandy&#x27;, &#x27;title&#x27;: &#x27;Senior Developer&#x27;}</td>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Andy&#x27;, &#x27;title&#x27;: &#x27;Developer&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'name': 'Sandy', 'title': 'Senior Developer'},\n",
       "  {'name': 'Andy', 'title': 'Developer'}]]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  CREATE (n:Person {name: 'Sandy', title: 'Senior Developer'})\n",
    "  WITH n\n",
    "  MATCH (m:Person {name: 'Andy'})\n",
    "  CREATE (m)-[:IS_MARRIED_TO]->(n)\n",
    "  CREATE (n)-[:IS_MARRIED_TO]->(m)\n",
    "  RETURN n,m"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query without specifying the relationship type. We get all relationships.\n",
    "\n",
    "```cypher\n",
    "MATCH (n1:Person {name:'Andy'})-[r]->(n2:Person) return n1,type(r),n2\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n1</th>\n",
       "        <th>type(r)</th>\n",
       "        <th>n2</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Andy&#x27;, &#x27;title&#x27;: &#x27;Developer&#x27;}</td>\n",
       "        <td>IS_MARRIED_TO</td>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Sandy&#x27;, &#x27;title&#x27;: &#x27;Senior Developer&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'name': 'Andy', 'title': 'Developer'},\n",
       "  'IS_MARRIED_TO',\n",
       "  {'name': 'Sandy', 'title': 'Senior Developer'}]]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n1:Person {name:'Andy'})-[r]->(n2:Person) return n1,type(r),n2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "In the next query we specify the relationship type.\n",
    "\n",
    "```cypher\n",
    "MATCH (n1:Person {name:'Andy'})-[r:IS_MARRIED_TO]->(n2:Person) return n2,type(r)\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n1</th>\n",
       "        <th>type(r)</th>\n",
       "        <th>n2</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Andy&#x27;, &#x27;title&#x27;: &#x27;Developer&#x27;}</td>\n",
       "        <td>IS_MARRIED_TO</td>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Sandy&#x27;, &#x27;title&#x27;: &#x27;Senior Developer&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'name': 'Andy', 'title': 'Developer'},\n",
       "  'IS_MARRIED_TO',\n",
       "  {'name': 'Sandy', 'title': 'Senior Developer'}]]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n1:Person {name:'Andy'})-[r:IS_MARRIED_TO]->(n2:Person) return n1,type(r),n2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "And we can ask who 'Sandy' knows using a variable length relationship with no type specified. Note the where clause to stop Sandy 'finding' herself.\n",
    "\n",
    "```cypher\n",
    "MATCH (n1:Person {name:'Sandy'})-[*1..2]->(n2:Person) WHERE n2.name <> 'Sandy' RETURN DISTINCT n1,n2\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n1</th>\n",
       "        <th>n2</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Sandy&#x27;, &#x27;title&#x27;: &#x27;Senior Developer&#x27;}</td>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Andy&#x27;, &#x27;title&#x27;: &#x27;Developer&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'name': 'Sandy', 'title': 'Senior Developer'},\n",
       "  {'name': 'Andy', 'title': 'Developer'}]]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n1:Person {name:'Sandy'})-[*1..2]->(n2:Person) WHERE n2.name <> 'Sandy' RETURN DISTINCT n1,n2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Silo Killer\n",
    "\n",
    "Clean out the database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 nodes deleted.\n",
      "2 relationship deleted.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n) DETACH DELETE n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Add a terminology concept node representing a CDISC code list item. This is for RACE code list and the 'WHITE' code list item."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "3 properties set.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White&#x27;, &#x27;identifier&#x27;: &#x27;C41261&#x27;, &#x27;submission&#x27;: &#x27;WHITE&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'C41261', 'preferred_term': 'White', 'submission': 'WHITE'}]]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 CREATE (n:Concept {identifier: 'C41261', submission: 'WHITE', preferred_term: 'White'}) RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create the code list item node for 'ASIAN'\n",
    "\n",
    "```cypher\n",
    "CREATE (n:Concept {identifier: 'C41260', submission: 'ASIAN', preferred_term: 'Asian'}) RETURN n\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "3 properties set.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian&#x27;, &#x27;identifier&#x27;: &#x27;C41260&#x27;, &#x27;submission&#x27;: &#x27;ASIAN&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'C41260', 'preferred_term': 'Asian', 'submission': 'ASIAN'}]]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 CREATE (n:Concept {identifier: 'C41260', submission: 'ASIAN', preferred_term: 'Asian'}) RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Get the two concepts created\n",
    "\n",
    "```cypher\n",
    "MATCH (n:Concept) RETURN n\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White&#x27;, &#x27;identifier&#x27;: &#x27;C41261&#x27;, &#x27;submission&#x27;: &#x27;WHITE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian&#x27;, &#x27;identifier&#x27;: &#x27;C41260&#x27;, &#x27;submission&#x27;: &#x27;ASIAN&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'C41261', 'preferred_term': 'White', 'submission': 'WHITE'}],\n",
       " [{'identifier': 'C41260', 'preferred_term': 'Asian', 'submission': 'ASIAN'}]]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (n:Concept) RETURN n "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now lets add the code list concept.\n",
    "\n",
    "```cypher\n",
    "CREATE (n:Concept {identifier: 'C74457', submission: 'RACE', preferred_term: 'CDISC SDTM Race Terminology'}) RETURN n\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "3 properties set.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Race Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C74457&#x27;, &#x27;submission&#x27;: &#x27;RACE&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'C74457',\n",
       "   'preferred_term': 'CDISC SDTM Race Terminology',\n",
       "   'submission': 'RACE'}]]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 CREATE (n:Concept {identifier: 'C74457', submission: 'RACE', preferred_term: 'CDISC SDTM Race Terminology'}) RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now let's link the nodes\n",
    "\n",
    "```cypher\n",
    "MATCH (cl:Concept {identifier:'C74457'}), (cli1:Concept {identifier:'C41261'}), (cli2:Concept {identifier:'C41260'}) CREATE (cl)-[:HAS_CHILD]->(cli1), (cl)-[:HAS_CHILD]->(cli2)\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (cl:Concept {identifier:'C74457'}), (cli1:Concept {identifier:'C41261'}), (cli2:Concept {identifier:'C41260'}) CREATE (cl)-[:NARROWER]->(cli1), (cl)-[:NARROWER]->(cli2) "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "And see what we have. Note the **type(r)** return value. This gives the type of the relationship.\n",
    "\n",
    "```cypher\n",
    "MATCH (p)-[r:HAS_CHILD]->(c) RETURN p, type(r), c\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>p</th>\n",
       "        <th>type(r)</th>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Race Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C74457&#x27;, &#x27;submission&#x27;: &#x27;RACE&#x27;}</td>\n",
       "        <td>NARROWER</td>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White&#x27;, &#x27;identifier&#x27;: &#x27;C41261&#x27;, &#x27;submission&#x27;: &#x27;WHITE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Race Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C74457&#x27;, &#x27;submission&#x27;: &#x27;RACE&#x27;}</td>\n",
       "        <td>NARROWER</td>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian&#x27;, &#x27;identifier&#x27;: &#x27;C41260&#x27;, &#x27;submission&#x27;: &#x27;ASIAN&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'C74457',\n",
       "   'preferred_term': 'CDISC SDTM Race Terminology',\n",
       "   'submission': 'RACE'},\n",
       "  'NARROWER',\n",
       "  {'identifier': 'C41261', 'preferred_term': 'White', 'submission': 'WHITE'}],\n",
       " [{'identifier': 'C74457',\n",
       "   'preferred_term': 'CDISC SDTM Race Terminology',\n",
       "   'submission': 'RACE'},\n",
       "  'NARROWER',\n",
       "  {'identifier': 'C41260', 'preferred_term': 'Asian', 'submission': 'ASIAN'}]]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (p)-[r:NARROWER]->(c) RETURN p, type(r), c"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now build a simple example linking collection, terminology and simple reporting. We will load the SEX code list and link it up. As part of this we will clean the database.\n",
    "\n",
    "Note files either have to be local in a specific directory or on the web. The files we will use are on dropbox. The **dl=1** just ensures they are downloaded otherwise a web page containing the file gets displayed which is not a lot of use!\n",
    "\n",
    "```cypher\n",
    "MATCH (n) DETACH DELETE n\n",
    "WITH count(*) as dummy\n",
    "LOAD CSV FROM \"https://www.dropbox.com/s/oqxh215khln96px/sex.csv?dl=1\" AS line\n",
    "CREATE (:Concept { identifier: line[0], submission: line[1], preferred_term: line[2], synonym: line[3], definition: line[4] })\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 nodes created.\n",
      "3 nodes deleted.\n",
      "25 properties set.\n",
      "2 relationship deleted.\n",
      "5 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (n) DETACH DELETE n\n",
    "  WITH count(*) as dummy\n",
    "  LOAD CSV FROM \"https://www.dropbox.com/s/oqxh215khln96px/sex.csv?dl=1\" AS line\n",
    "  CREATE (:Concept { identifier: line[0], submission: line[1], preferred_term: line[2], synonym: line[3], definition: line[4] })\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query to see what we loaded.\n",
    "\n",
    "```cypher\n",
    "MATCH (c:Concept) RETURN c\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Female&#x27;, &#x27;identifier&#x27;: &#x27;C16576&#x27;, &#x27;synonym&#x27;: &#x27;Female&#x27;, &#x27;submission&#x27;: &#x27;F&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Intersex  &#x27;, &#x27;identifier&#x27;: &#x27;C45908&#x27;, &#x27;synonym&#x27;: &#x27; &quot;A person (one of unisexual specimens) who is born with genitalia and/or secondary sexual characteristics of indeterminate sex&#x27;, &#x27;definition&#x27;: &#x27; or which combine features of both sexes. (NCI)&#x27;, &#x27;submission&#x27;: &#x27;UNDIFFERENTIATED&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Male&#x27;, &#x27;identifier&#x27;: &#x27;C20197&#x27;, &#x27;synonym&#x27;: &#x27;Male&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions&#x27;, &#x27;submission&#x27;: &#x27;M&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Unknown&#x27;, &#x27;identifier&#x27;: &#x27;C17998&#x27;, &#x27;synonym&#x27;: &#x27;U; UNK; Unknown&#x27;, &#x27;definition&#x27;: &#x27;Not known&#x27;, &#x27;submission&#x27;: &#x27;U&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Sex of Individual Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C66731&#x27;, &#x27;synonym&#x27;: &#x27;Sex&#x27;, &#x27;definition&#x27;: &#x27;The assemblage of physical properties or qualities by which male is distinguished from female; the physical difference between male and female; the distinguishing peculiarity of male or female. (NCI)&#x27;, &#x27;submission&#x27;: &#x27;SEX&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'definition': 'A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C16576',\n",
       "   'preferred_term': 'Female',\n",
       "   'submission': 'F',\n",
       "   'synonym': 'Female'}],\n",
       " [{'definition': ' or which combine features of both sexes. (NCI)',\n",
       "   'identifier': 'C45908',\n",
       "   'preferred_term': 'Intersex  ',\n",
       "   'submission': 'UNDIFFERENTIATED',\n",
       "   'synonym': ' \"A person (one of unisexual specimens) who is born with genitalia and/or secondary sexual characteristics of indeterminate sex'}],\n",
       " [{'definition': 'A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C20197',\n",
       "   'preferred_term': 'Male',\n",
       "   'submission': 'M',\n",
       "   'synonym': 'Male'}],\n",
       " [{'definition': 'Not known',\n",
       "   'identifier': 'C17998',\n",
       "   'preferred_term': 'Unknown',\n",
       "   'submission': 'U',\n",
       "   'synonym': 'U; UNK; Unknown'}],\n",
       " [{'definition': 'The assemblage of physical properties or qualities by which male is distinguished from female; the physical difference between male and female; the distinguishing peculiarity of male or female. (NCI)',\n",
       "   'identifier': 'C66731',\n",
       "   'preferred_term': 'CDISC SDTM Sex of Individual Terminology',\n",
       "   'submission': 'SEX',\n",
       "   'synonym': 'Sex'}]]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (c:Concept) RETURN c"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now link the code list with the items\n",
    "\n",
    "```cypher\n",
    "MATCH (cl:Concept) WHERE cl.identifier = 'C66731'\n",
    "WITH cl\n",
    "MATCH (cli:Concept) WHERE cli.identifier <> 'C66731' \n",
    "WITH cl, COLLECT(cli) as children\n",
    "UNWIND children as child\n",
    "CREATE (cl)-[:NARROWER]->(child)\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (cl:Concept) WHERE cl.identifier = 'C66731'\n",
    "  WITH cl\n",
    "  MATCH (cli:Concept) WHERE cli.identifier <> 'C66731' \n",
    "  WITH cl, COLLECT(cli) as children\n",
    "  UNWIND children as child\n",
    "  CREATE (cl)-[:NARROWER]->(child)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The next piece is purley to experiment with displaying the neo4j data in the Jupyter notebook. Uses some python libraries to do the heavy work.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAecAAAFCCAYAAADL3BUJAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMS4wLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvpW3flQAAIABJREFUeJzt3XtwlOX5//HPQpBsREKQBCiSBEQg\nhEQOQRRQTioHhRDICr9qEb6jo1R01GLVztSq7ZRK+Xa+HTlobTF1xEOXIJ5ARVFQkLOaICgGEsI5\n4RQLSSAk+/tjzeoSkCS72fvZZ9+vmY6zm32eXJmO/fS69n7u2+HxeDwCAACW0cx0AQAAwB/hDACA\nxRDOAABYDOEMAIDFEM4AAFgM4QwAgMUQzgAAWAzhDACAxRDOAABYDOEMAIDFEM4AAFgM4QwAgMUQ\nzgAAWAzhDACAxRDOAABYDOEMAIDFEM4AAFgM4QwAgMUQzgAAWAzhDACAxRDOAABYDOEMAIDFEM4A\nAFgM4QwAgMUQzgAAWEyU6QKAkCgpkXJypLw8qaxMio2V0tOl6dOl+HjT1QGAH4fH4/GYLgJoMps2\nSbNnSytWeF9XVv74M6dT8nikMWOkxx+XBgwwUyMAnINwhn0tXCjNmiVVVHhD+EIcDm9Qz50rzZgR\nuvoA4AIYa8OeaoO5vPzin/V4vJ+bNcv7moAGYBidM+xn0yZp2LD6BfO5YmKk1auljIyglwUA9cVq\nbdjP7NneUXZjVFR4rwcAg+icYS8lJVJSkv/Cr4aKjpaKi1nFDcAYOmfYS05O4PdwOIJzHwBoJMIZ\n9pKXF1jXLHlH2/n5wakHABqBcIa9lJUF5z7HjwfnPgDQCIQz7CU2Njj3iYsLzn0AoBEIZ9hLerp3\nQVcgnE4pLS049QBAI7BaG/bCam0ANkDnDHtJSPDule1wNO56h0MaO5ZgBmAUnTPshx3CAIQ5OmfY\nz4AB3kMsYmIadNmZFi281xHMAAwjnGFPM2b8GNAXGXFXSzol6aHqauUNHhyS8gDg5xDOsK8ZM7wj\n6qws7yIvp9Pvx57oaFVKWiZpqKQFNTWaNm2aqqqqTFQLAD5854zIUFrq3ZIzP9+7wUhcnJSWpnfa\ntdO4//kfv48+/fTT+v3vf2+mTgAQ4QxoypQpev31132vW7Rooc2bNys9Pd1gVQAiGeGMiHfkyBH1\n6tVLpaWlvvf69u2rDRs2qEWLFgYrAxCp+M4ZEa9du3ZauHCh33tffPGFnnnmGUMVAYh0dM7ADxhv\nA7AKwhn4QWlpqVJTU/3G2/369dP69esZbwMIKcbawA/i4+PrjLe3bt3KeBtAyNE5A+c433h7y5Yt\nSuOkKgAhQjgD52C8DcA0xtrAORhvAzCNzhm4gMmTJ+s///mP7zXjbQChQjgDF8B4G4ApjLWBC4iP\nj9eCBQv83tu6davmzJljqCIAkYLOGbgIxtsAQo1wBi6C8TaAUGOsDVwE420AoUbnDNQT420AoULn\nDNTTvHnzFB8f73udkZGhVq1aGawIgF0RzkA91Y63Y2JidOONN6pDhw5KTk42XRYAG2KsDTTQoUOH\n1KZNG/Xr109/+MMfNHnyZNMlAbAZwhlopI0bN2r8+PH66quv1L59e9PlALARwhkIwGOPPabvvvtO\nS5YskcPhMF0OAJvgO2cgAE8++aR27Njht4obAAJF5wwEqHa8nZeXp4SEBNPlALABwhkIgscee0wF\nBQVyu92MtwEEjLE2EARPPvmktm/fLrfbbboUADZA5wwEyYYNG5SZmcl4G0DACGcgiB599FHt3r2b\nDhpAQBhrA0H01FNPadu2bazeBhAQOmcgyBhvAwgU4Qw0AcbbAALBWBtoAoy3AQSCzhloIoy3gRAr\nKZFycqS8PKmsTIqNldLTpenTpZ8c9xoOCGegCTHeBkJg0yZp9mxpxQrv68rKH3/mdEoejzRmjPT4\n49KAAWZqbCDCGWhClZWV6tu3r55++mm5XC7T5QD2s3ChNGuWVFHhDeELcTi8QT13rjRjRujqayTC\nGWhi69ev14QJExhvA8FWG8zl5fW/JiYmLAKacAZC4Le//a2KiopYIAYEy6ZN0rBhDQvmWjEx0urV\nUkZG0MsKFlZrAyHw9NNPKz8/n++egWCZPds7ym6Migrv9RZG5wyECONtIEhKSqSkJP+FXw0VHS0V\nF1t2FTedMxAi1157raZOnaqZM2eaLgUIbzk5gd/D4QjOfZoI4QyEEONtIAjy8gLrmiXvaDs/Pzj1\nNAHCGQih6Ohovfjii7r//vtVWlpquhwgPJWVBec+x48H5z5NgHAGQqx2vH3fffeZLgUIKyUlJXru\nuee0ctOm4NwwLi4492kChDNgwFNPPaW8vDzG28BFHDp0SAsWLNCIESPUsWNHzZgxQx8cPqxGPEDl\nz+mU0tKCUWKTYLU2YMj69euVlZWlvLw8xVt0xShgwsGDB7V06VK53W6tWbNG58ZUvKQ9kpyB/BKL\nr9YmnAGDHnnkERUXF+v11183XQpg1IEDB5Sbmyu3263PPvusTiCfK1dSpqTmjfllDoeUlSXl5jbm\n6pAgnAGDKioq1LdvX/3pT39Sdna26XKAkNq/f78vkNeuXXvRQJakq6++Wi6XS3f06KGkO++07Q5h\nUaYLACKZ0+nUiy++qIkTJ2ro0KGMt2F7+/bt05IlS+R2u7Vu3bp6XdO3b1+5XC5lZ2frqquu+vEH\npaWN31vbwsEs0TkDlsB4G3a2d+9eXyB//vnn9bqmf//+crlcmjRpkrp163bhD3IqFYCmwngbdrNn\nzx5fIG/YsKFe12RkZPg65K5du9b/l23e7N0re/lybwj/dM/t2vOcx471nuds8Y65FuEMWMTnn3+u\niRMnsnobYauoqMgXyBs3bqzXNddcc42vQ+7SpUtgBZSWerfkzM/3bjASF+d9XGraNMuuyr4Qwhmw\nEMbbCDeFhYVyu91yu93avHlzva4ZOHCgr0NOSkpq4grDE+EMWAjjbYSDXbt2+TrkLVu21Oua6667\nztchJyYmNnGF4Y9wBiyG8TasqKCgwNchf/HFF/W6ZtCgQb5A7ty5cxNXaC+EM2BBs2bN0r59+/Ta\na6+ZLgXQo48+qjlz5lz0cw6HQ4MHD/YFcqdOnUJQnT3xnDNgQX/84x/Vp08f5ebmatKkSabLQQSr\nqalR69atL/hzh8OhIUOG+AL5F7/4RQirsy86Z8Ci1q1bp0mTJik/P1/t2rUzXQ4iSE1NjdatWye3\n263c3Fy1bt1aBQUFqqqqkuQN5BtuuEEul0sTJ05Ux44dDVdsP4QzYGGMtxEq1dXVWrt2rS+QL7/8\ncrlcLrlcLqWkpOiXv/ylDh486AvkDh06mC7Z1ghnwMIqKirUp08f/fnPf2a8jaCrrq7WZ5995gvk\nhIQE3yNOPXv29PtsTU2NmjXjlOFQIZwBi2O8jWCqrq7WmjVr5Ha7tXTpUnXo0MHXIXfv3t10efgB\n4QyEAcbbCMTZs2f9ArlTp07nP0gClkE4A2GA8TYa6uzZs/rkk0/kdrv1xhtvKDExsX4HScASCGcg\nTDDexsWcPXtWH3/8sdxut5YtW6akpKTGHSQB4whnIIz85je/0YEDB/Tqq6+aLgUWUVVVpVWrVsnt\nduvNN99U165dg3eQBIwhnIEwUjvenj17tiZOnGi6HBhSVVWljz76yBfI3bp14yAJmyGcgTCzdu1a\nZWdnM96OMGfOnNGHH34ot9utt956Sz169OAgCRsjnIEwxHg7Mpw+fdovkFNSUjhIIkIQzkAYKi8v\nV58+ffSXv/yF8bbNnD59Wh988IHcbrfeeecdpaamKjs7W5MmTdIVV1xhujyECOEMhCnG2/ZRWVnp\nF8hpaWkcJBHhCGcgjD388MM6ePAg4+0wVFlZqffee09ut1vLly/X1VdfrezsbE2cOJFABuEMhDPG\n2+GloqLCL5D79u3LQRI4L8IZCHNr166Vy+VSXl4e420LKi8v14oVK+R2u/Xee++pf//+vg65ffv2\npsuDRRHOgA08/PDDOnTokF555RXTpUDSqVOn/AJ5wIABcrlcysrKUkJCgunyEAYIZ8AGasfbzzzz\njLKyskyXE5FOnTqld999V263Wx988IEGDhyo7OxsZWVlKT4+3nR5CDOEM2ATtePt/Px8XX755abL\niQgnT570BfLKlSt17bXXyuVyacKECXzFgIAQzoCNMN5uev/973/1zjvvyO1266OPPtKgQYOUnZ2t\nCRMm8H+KEDSEM2AjjLebxvfff+8L5FWrVmnw4MFyuVzKzMxU27ZtTZcHGyKcAZv57LPPdNtttzHe\nDtD333+vt956S263Wx9//LFuuOEGuVwujR8/XnFxcabLg80RzoANPfTQQzp8+DDj7QY6ceKE3n77\nbbndbn3yyScaOnSoL5DbtGljujxEEMIZsCHG2/V34sQJvfnmm3K73VqzZo2GDx8ul8ulcePGKTY2\n1nR5iFCEM2BTjLcv7Pjx475A/vTTTzVixAhfILdu3dp0eQDhDNjZQw89pJKSEi1evNh0KcYdO3ZM\ny5Ytk9vt1rp16zRy5Ei5XC7dcsstBDIsh3AGbKy8vFxXX321/vrXv2rChAmmywm5o0eP+gL5888/\n14033ugL5Msuu8x0ecAFEc6AzUXaePvIkSN644035Ha7tWHDBt18881yuVwaO3asWrVqZbo8oF4I\nZyAC2H28XVpa6gvkjRs3atSoUb5AvvTSS02XBzQY4QxEADuOt0tKSrR06VK53W5t2bJFo0ePVnZ2\ntsaOHauYmBjT5QEBIZyBCPHpp59q8uTJYT3ePnTokK9D3rp1q8aMGSOXy6XRo0cTyLAVwhmIIA8+\n+KBKS0vDarx96NAh5ebmyu1268svv9Qtt9yi7OxsjR49Wk6n03R5QJMgnIEIEi7j7YMHD/oCOS8v\nT7fccotcLpdGjRql6Oho0+UBTY5wBiKMVcfb+/fv9wXytm3bNG7cOGVnZ+vmm28mkBFxCGcgAj34\n4IM6cuSIXn75ZaN17Nu3zxfI27dv17hx4+RyuXTTTTepZcuWRmsDTCKcgQhUO96eO3euMjMzvW+W\nlEg5OVJenlRWJsXGSunp0vTpUnx80H733r17tWTJErndbn377bcaP368XC6XRo4cSSADPyCcgQhV\nO97e8dJLil2wQFqxwvuDysofP+R0Sh6PNGaM9Pjj0oABjfpdxcXFvkDeuXOnMjMzfYF8ySWXBOGv\nAeyFcAYi2H9GjFDmmjVqWVPjDeELcTi8QT13rjRjRr3uXVRU5AvkXbt2acKECXK5XBoxYoRatGgR\npL8AsCfCGYhUCxfK85vfyFFRUf9rYmJ+NqALCwt9gVxYWOgL5OHDhxPIQAMQzkAk2rRJGjZMKi9v\n+LUxMdLq1VJGhiRp9+7dcrvdcrvdKi4uVlZWllwul4YOHUogA41EOAORaOJEadmynx9lX4jDoZM3\n3aR5w4fL7XZr3759foEcFRUV/HqBCEM4A5GmpERKSvJf+NVAlZKemDZNY6ZO1fXXX08gA0HGv1FA\npMnJCfgWLZ1OzenVSxo+PPB6ANTRzHQBAEIsLy+grlmSdxFZfn6QCgJwLsIZiDRlZcG5z/HjwbkP\ngDoYawM25vF4VFxcrK+//lrbtm3T119/rclr12psMG4eFxeMuwA4D8IZsAGPx6MDBw74hXDtfy67\n7DL17t1bqampuv7665XaqpU8ixbJEcho2+mU0tKC9wcA8MNqbSCMeDwelZSUnDeEW7Ro4Qvh1NRU\n9e7dW7169VLbtm39bxKE1dqKjpaKi4O65zaAHxHOgEUdPXq0Tghv27ZNNTU1vvCtDeLU1FQlJCTU\n/+YBPuesrCwpN7fh1wKoF8IZMKysrOy8IVxeXl4ngHv37q0OHTrI4XAE9kuDuEMYgOAjnIEQOXny\npLZv314nhE+cOKFevXr5BXBqaqquuOKKwEP45yxcKM2a1bCAvsje2gCCg3AGgqyiokI7duyoE8Il\nJSXq0aNHne+Fk5KS1KyZoacaawO6oiLop1IBaDzCGWik06dP69tvv60Twvv371e3bt3qhHDXrl3V\nvHlz02XXtXmzNHu2tHy5N4R/ckpVVVSUPB6PLsnM9J7nzCgbCAnCGbiIqqoqfffdd3VCuKioSF26\ndKkTwt26dQvP05hKS71be+bnezcYiYvTf7t0Ud//+z9tLCysu+obQJMhnIEfVFdXa9euXXVCeNeu\nXbriiivqhHD37t3VsmVL02U3ualTpyotLU2PPPKI6VKAiEE4I+LU1NSoqKioTgjv3LlT7du3rxPC\nPXv2lNPpNF22MZs2bdJtt92mgoICa47lARsinGFbHo9He/furfOY0o4dOxQXF1cnhFNSUtSqVSvT\nZVvStddeq9/97ncaP3686VKAiEA4I+x5PB4dPHjwvLtmXXrppefdNSs2NtZ02WFl8eLFysnJ0cqV\nK02XAkQEwhlh5XxbV27btk1RUVF1Qjg1NZVFTEFy5swZJSUladWqVUpJSTFdDmB7hDMs6dixY+cN\n4bNnz543hBu0dSUa5YknntDRo0c1f/5806UAtkc4w6iysrLz7pp16tSpOttWpqamqmPHjk27axYu\n6MCBA+rdu7cKCwv5WgBoYoQzQuLkyZPn3TXr2LFjSklJ8YVv7T87d+5MCFvQlClTNGjQID3wwAOm\nSwFsjXBGUFVUVOibb76pE8KHDx9W9+7d64ykk5OTzW1diQZbu3atpk+frm+++Yb/3oAmRDijUU6f\nPq2dO3fWCeF9+/bpyiuvPO/WlVFRUabLRoA8Ho/69eun2bNna/To0abLAWyLcMbPqqqqUkFBQZ0Q\nLiwsVHJycp0Qvuqqq8Jz60rU26JFi5Sbm6t3333XdCmAbRHOEaC6ulqFhYV+AVtWVub3P67V1dXa\nvXt3nRAuKChQp06d6oRwjx49ImLrStRVUVGhpKQkrVu3Tt26dTNdDmBLhHMgSkq8BwXk5UllZVJs\nrJSeLk2fLsXHh7ycmpoaFRcX1wnYHTt2qLKy0u+zDodDTz75pO9Ah2+//VYJCQnn3boyJiYm5H8L\nrO2xxx7TmTNn9Le//c10KYAtEc6NsWmT94i9FSu8r38afE6n91zcMWO8R+wNGBD0X+/xeLR///46\nIbx9+3adOnWq3ve5/fbbNWLECN/WlZdddlnQa4U97dmzR/369dOePXvY8hRoAoRzQ4XwcHqPx6PD\nhw+fN4TLysoa+Qf8KCcnR3feeWfA90FkysrK0qhRo3TvvfeaLgWwHcK5IWqDuby8/tfExNQroI8c\nOeK3I1btP48dOxZg0V7t2rXze444NTVVffr0UevWrYNyf0SeVatW6YEHHlB+fj7PpANBRjjX16ZN\n0rBhDQvmWjEx0urVUkaGTpw4cd5tKUtKSoJSZps2beqEcO/evdneEkHn8XjUu3dvzZs3T8OHDzdd\nDmArhHN9TZwoLVv286PsC6iRtC4hQZOjonTgwIGglNOqVavzhjDbWyKUFi5cqJUrV2rp0qWmSwFs\nhXCuj5ISKSnJf+FXA1VISpR0pIHXOZ1O9erVq04Is70lrODkyZNKSkrS1q1blZSUZLocwDbYsqk+\ncnICvoVH0p2S/vcCP2/ZsqVSUlLqHPbA9pawslatWmnq1Kl67rnnNHv2bNPlALZB51wfd9whLV4c\n8G1eknRXixbq0aNHndOW2N4S4aqgoECDBg3Snj175HQ6TZcD2AJpUB9BeGxJkrKGDtX/W7mS7S1h\nK926dVNGRoZee+01TZ8+3XQ5gC0wL62PIJ1de1liIsEMW7r//vv17LPPikEcEByEc32kp0vR0YHd\nw+mU0tKCUw9gMaNGjdLJkye1bt0606UAtsB3zvURhNXaio6WiouN7LkNhMLf//53rV+/Xq+++qrp\nUoCwR+dcHwkJ3r2yG/voksMhjR1LMMPWpk2bpvfffz9oz/IDkYxwrq/HH/eOphvD6fReD9hYbGys\npkyZoueff950KUDYI5zra8AA7x7ZDT0+sXZv7YyMpqkLsJCZM2fqH//4h86cOWO6FCCsEc4NMWPG\njwF9sRG3w1HvQy8Au+jVq5dSU1O1ZMkS06UAYY1wbqgZM7yHWGRleRd5nTvqdjq972dleT9HMCPC\n1D5WBaDxWK0diNJS79ae+fnS8eNSXJz3calp01j8hYhVXV2tK6+8UkuWLFEGX+cAjUI4Awi6OXPm\n6Ouvv9a///1v06UAYYlwBhB0R48eVbdu3bRz507FM0UCGozvnAEE3eWXX65JkybphRdeMF0KEJbo\nnAE0iS+//FLjxo1TYWEhJ64BDUTnDKBJ9OnTR8nJyVq2bJnpUoCwQzgDaDI8VgU0DmNtAE2mqqpK\nycnJWrFihdLT002XA4QNOmcATaZFixa69957NW/ePNOlAGGFzhlAkzp8+LB69uypXbt2qW3btqbL\nAcICnTOAJtW+fXvdeuutWrRokelSgLBB5wygyW3cuFFTpkzRd999p+bNm5suB7A8OmcATe6aa65R\nu3bttHz5ctOlAGGBcAYQEjxWBdQfY20AIXH69GklJSXpk08+Uc+ePU2XA1ganTOAkGjZsqXuvvtu\nzZ8/33QpgOXROQMImf379ystLU1FRUVq3bq16XIAy6JzBhAynTp10o033sg5z8BF0DkDCKlPP/1U\nd911l3bs2KFmzegPgPPh3wwAITVkyBA5nU59+OGHpksBLItwBhBSDoeDx6qAi2CsDSDkysvLlZSU\npA0bNqhr166mywEsh84ZQMjFxMRo+vTpPFYFXACdMwAjioqKlJGRoT179ujSSy81XQ5gKXTOAIxI\nTk7WkCFDtHjxYtOlAJZDOAMwZubMmXr22WfFAA/wRzgDMGbkyJGqrq7W6tWrTZcCWArhDMAYh8Ph\n654B/IgFYQCMOnnypBITE/Xll18qMTHRdDmAJdA5AzCqVatW+tWvfqXnnnvOdCmAZdA5AzBu586d\nGjJkiIqLixUdHW26HMA4OmcAxnXv3l39+/fXa6+9ZroUwBIIZwCWULvfNsM8gHAGYBGjR49WWVmZ\n1q9fb7oUwDjCGYAlNGvWTPfddx+PVQFiQRgACzlx4oS6dOmi7du3q2PHjqbLAYyhcwZgGW3atNGU\nKVP0/PPPmy4FMIrOGYClbNu2TTfddJP27NmjSy65xHQ5gBF0zgAspXfv3kpJSVFubq7pUgBjCGcA\nllP7WBUQqQhnAJYzbtw47d+/X1u2bDFdCmAE4QzAcqKiovTrX/9a8+bNM10KYAQLwgBY0pEjR3TV\nVVdp586dio+PN10OEFJ0zgAsqV27dsrKytI///lP06UAIUfnDMCyvvjiC2VmZmr37t2KiooyXQ4Q\nMnTOACyrb9++SkxM1FtvvWW6FCCkCGcAljZz5kweq0LEYawNwNKqqqqUnJys9957T2lpaabLAUKC\nzhmApbVo0UL33HMPj1UhotA5A7C8Q4cOKSUlRbt371ZcXJzpcoAmR+cMwPI6dOigsWPH6sUXXzRd\nChASdM4AwsL69et1++23a+fOnWrevLnpcoAmRecMICwMHDhQbdu21YoVK0yXAjQ5whlAWHA4HJxW\nhYjBWBtA2KisrFRSUpLWrFmjHj16mC4HaDJ0zgDCRnR0tO666y7Nnz9fklRdXW24IqBp0DkDCCt7\n9uxRamqqBg4cqMTERFZww5YIZwBho6ioSCNHjtTu3bslSS1bttTevXs5UhK2w1gbQNjo3Lmz3+vT\np0/rhRdeMFQN0HQIZwBho3nz5rrvvvv83lu4cKHOnj1rqCKgaRDOAMLK9OnTFRMT43u9b98+vfnm\nmwYrAoKPcAYQVuLi4nTHHXf4vcezz7AbFoQBCDv5+flKT0/3e++rr76q8x4QruicAYSdtLQ0DRs2\nzO+92mefATsgnAGEpZkzZ/q9fvnll3X8+HFD1QDBRTgDCEuZmZl+j1aVl5dr0aJFBisCgodwBhCW\noqKiNGPGDL/35s+fz5aesAUWhAEIW6WlpercubNOnz7te+/tt9/WrbfearAqIHB0zgDCVnx8vKZM\nmeL3Ho9VwQ7onAGEtS1btigjI8PvvW+++YYjJRHW6JwBhLX+/fvruuuu83tv3rx5hqoBgoNwBhD2\n7r//fr/XOTk5+v777w1VAwSOcAYQ9iZNmqQOHTr4Xp88eVIvvfSSwYqAwBDOAMLeJZdconvuucfv\nvXnz5qmmpsZQRUBgWBAGwBYOHjyoxMREv+Mj33//fd18880GqwIah84ZgC107NhRLpfL7z0WhiFc\n0TkDsI1169Zp8ODBvtcOh0MFBQXq2rWrwaqAhqNzBmAb1113nfr16+d77fF4tGDBAoMVAY1DOAOw\nDYfDUeexqn/96186deqUoYqAxiGcAdjKlClT1K5dO9/rEydO6JVXXjFYEdBwhDMAW4mOjtbdd9/t\nex0v6b9PPCHPHXdI48ZJd9whzZkjlZaaKxK4CBaEAbCd4uJiuZKT9ajHozGSPJJifvoBp1PyeKQx\nY6THH5cGDDBTKHABdM4AbCfx3Xe1ulkzZUpy6pxglqSKCqmyUlq2TBo2TFq4MOQ1Aj8nynQBABBU\nCxdKs2Ypurr64p/1eKTycmnWLO/rGTOatjagnhhrA7CPTZu8nXB5ecOvjYmRVq+Wzjl+EjCBsTYA\n+5g92zuyboyKCu/1gAXQOQOwh5ISKSnJ+11yY0VHS8XFUnx88OoCGoHOGYA95OQEfg+HIzj3AQJE\nOAOwh7y8wLpmyTvazs8PTj1AAAhnAPZQVhac+xw/Hpz7AAEgnAHYQ2xscO4TFxec+wABIJwB2EN6\nundBVyCcTiktLTj1AAFgtTYAe2C1NmyEzhmAPSQkePfKdjgad73DIY0dSzDDEuicAdgHO4TBJuic\nAdjHgAHS3LneoG2ImBjvdQQzLIKDLwDYS+3hFbNmeZ9b/rnhoMPhXQQ2dy6HXsBSGGsDsKfNm717\nZS9f7g3hn+65XXue89ix3vOc6ZhhMYQzAHsrLfVuyZmf791gJC7O+7jUtGks/oJlEc4AAFgMC8IA\nALAYwhkAAIshnAEAsBjCGQAAiyGcAQCwGMIZAACLIZwBALAYwhkAAIshnAEAsBjCGQAAiyGcAQCw\nGMIZAACLIZwBALAYwhkAAItmwa77AAAAiklEQVQhnAEAsBjCGQAAiyGcAQCwGMIZAACLIZwBALAY\nwhkAAIshnAEAsBjCGQAAiyGcAQCwGMIZAACLIZwBALAYwhkAAIshnAEAsBjCGQAAiyGcAQCwGMIZ\nAACLIZwBALAYwhkAAIshnAEAsBjCGQAAiyGcAQCwGMIZAACLIZwBALAYwhkAAIv5/0eQrqDNMbaS\nAAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x1518464fd0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher http://neo4j:ld123@localhost:7474 MATCH (c:Concept)-[r:NARROWER]->(x:Concept) RETURN c,r,x\n",
    "g = results.get_graph()\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now lets create some simple metadata to capture data that links to the terminologies. We create a single study node that is linked to a collection instrument (form) that holds a single question.\n",
    "\n",
    "```cypher\n",
    "CREATE (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345', name: 'Linked Data Wonder Drug'})-[:COLLECTS]->(ci:CollectionInstrument {identifier: 'DM', name: 'Demographics'})-[:HAS_QUESTION]->(q:Question {identifier: 'Q1', question_text: 'Sex?'})\n",
    "RETURN s,ci,q\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 nodes created.\n",
      "6 properties set.\n",
      "2 relationships created.\n",
      "3 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>s</th>\n",
       "        <th>ci</th>\n",
       "        <th>q</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;http://data.acmepharma.com/clinicaltrial/12345&#x27;, &#x27;name&#x27;: &#x27;Linked Data Wonder Drug&#x27;}</td>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;DM&#x27;, &#x27;name&#x27;: &#x27;Demographics&#x27;}</td>\n",
       "        <td>{&#x27;question_text&#x27;: &#x27;Sex?&#x27;, &#x27;identifier&#x27;: &#x27;Q1&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'http://data.acmepharma.com/clinicaltrial/12345',\n",
       "   'name': 'Linked Data Wonder Drug'},\n",
       "  {'identifier': 'DM', 'name': 'Demographics'},\n",
       "  {'identifier': 'Q1', 'question_text': 'Sex?'}]]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  CREATE (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345', name: 'Linked Data Wonder Drug'})-[:COLLECTS]->(ci:CollectionInstrument {identifier: 'DM', name: 'Demographics'})-[:HAS_QUESTION]->(q:Question {identifier: 'Q1', question_text: 'Sex?'})\n",
    "  RETURN s,ci,q"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Link the terminology to the question.\n",
    "\n",
    "```cypher\n",
    "MATCH (q:Question {identifier: 'Q1'}), (cli1:Concept {identifier: 'C16576'}), (cli2:Concept {identifier: 'C20197'}) \n",
    "CREATE UNIQUE (cli1)<-[:HAS_RESPONSE]-(q)-[:HAS_RESPONSE]->(cli2)\n",
    "RETURN q,cli1,cli2\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>q</th>\n",
       "        <th>cli1</th>\n",
       "        <th>cli2</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;question_text&#x27;: &#x27;Sex?&#x27;, &#x27;identifier&#x27;: &#x27;Q1&#x27;}</td>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Female&#x27;, &#x27;identifier&#x27;: &#x27;C16576&#x27;, &#x27;synonym&#x27;: &#x27;Female&#x27;, &#x27;submission&#x27;: &#x27;F&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions&#x27;}</td>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Male&#x27;, &#x27;identifier&#x27;: &#x27;C20197&#x27;, &#x27;synonym&#x27;: &#x27;Male&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions&#x27;, &#x27;submission&#x27;: &#x27;M&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'Q1', 'question_text': 'Sex?'},\n",
       "  {'definition': 'A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C16576',\n",
       "   'preferred_term': 'Female',\n",
       "   'submission': 'F',\n",
       "   'synonym': 'Female'},\n",
       "  {'definition': 'A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C20197',\n",
       "   'preferred_term': 'Male',\n",
       "   'submission': 'M',\n",
       "   'synonym': 'Male'}]]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (q:Question {identifier: 'Q1'}), (cli1:Concept {identifier: 'C16576'}), (cli2:Concept {identifier: 'C20197'}) \n",
    "  CREATE UNIQUE (cli1)<-[:HAS_RESPONSE]-(q)-[:HAS_RESPONSE]->(cli2)\n",
    "  RETURN q,cli1,cli2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Simple query. List the terminology in my study\n",
    "\n",
    "```cypher\n",
    "MATCH (s:Study)-[:COLLECTS]->(ci:CollectionInstrument)-[:HAS_QUESTION]->(q:Question)-[:HAS_RESPONSE]->(c:Concept) \n",
    "RETURN q.identifier, c.identifier, c.submission\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>q.identifier</th>\n",
       "        <th>c.identifier</th>\n",
       "        <th>c.submission</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Q1</td>\n",
       "        <td>C20197</td>\n",
       "        <td>M</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Q1</td>\n",
       "        <td>C16576</td>\n",
       "        <td>F</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Q1', 'C20197', 'M'], ['Q1', 'C16576', 'F']]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study)-[:COLLECTS]->(ci:CollectionInstrument)-[:HAS_QUESTION]->(q:Question)-[:HAS_RESPONSE]->(c:Concept) \n",
    "  RETURN q.identifier, c.identifier, c.submission"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create subject '1234' and '1235'\n",
    "\n",
    "```cypher\n",
    "MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})\n",
    "CREATE (s)<-[:PARTICIPATES_IN]-(sub1:Subject {identifier: '1234'})\n",
    "WITH s, sub1\n",
    "CREATE (s)<-[:PARTICIPATES_IN]-(sub2:Subject {identifier: '1235'})\n",
    "RETURN s, sub1, sub2\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 nodes created.\n",
      "2 properties set.\n",
      "2 relationships created.\n",
      "2 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>s</th>\n",
       "        <th>sub1</th>\n",
       "        <th>sub2</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;http://data.acmepharma.com/clinicaltrial/12345&#x27;, &#x27;name&#x27;: &#x27;Linked Data Wonder Drug&#x27;}</td>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;1234&#x27;}</td>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;1235&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'http://data.acmepharma.com/clinicaltrial/12345',\n",
       "   'name': 'Linked Data Wonder Drug'},\n",
       "  {'identifier': '1234'},\n",
       "  {'identifier': '1235'}]]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})\n",
    "  CREATE (s)<-[:PARTICIPATES_IN]-(sub1:Subject {identifier: '1234'})\n",
    "  WITH s, sub1\n",
    "  CREATE (s)<-[:PARTICIPATES_IN]-(sub2:Subject {identifier: '1235'})\n",
    "  RETURN s, sub1, sub2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create subject's '1234' response to Q1. We link the subject to the question being responded to and to the value of the response. This has been kept simple for the the purposes of this cypher lesson.\n",
    "\n",
    "```cypher\n",
    "MATCH (sub:Subject {identifier: '1234'}), (q:Question {identifier: 'Q1'})\n",
    "CREATE (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q)\n",
    "WITH sub,r\n",
    "MATCH (c:Concept {identifier: 'C16576'})\n",
    "CREATE (r)-[:VALUE]->(c)\n",
    "RETURN sub, c\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "3 relationships created.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>sub</th>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;1234&#x27;}</td>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Female&#x27;, &#x27;identifier&#x27;: &#x27;C16576&#x27;, &#x27;synonym&#x27;: &#x27;Female&#x27;, &#x27;submission&#x27;: &#x27;F&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': '1234'},\n",
       "  {'definition': 'A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C16576',\n",
       "   'preferred_term': 'Female',\n",
       "   'submission': 'F',\n",
       "   'synonym': 'Female'}]]"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (sub:Subject {identifier: '1234'}), (q:Question {identifier: 'Q1'})\n",
    "  CREATE (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q)\n",
    "  WITH sub,r\n",
    "  MATCH (c:Concept {identifier: 'C16576'})\n",
    "  CREATE (r)-[:VALUE]->(c)\n",
    "  RETURN sub, c"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "```cypher\n",
    "MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[]-(sub:Subject)-[]->(r:Response)-[]->(c:Concept)\n",
    "RETURN s.identifier as STUDY, sub.identifier as SUBJID, c.submission as SEX\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>STUDY</th>\n",
       "        <th>SUBJID</th>\n",
       "        <th>SEX</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>F</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['http://data.acmepharma.com/clinicaltrial/12345', '1234', 'F']]"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[]-(sub:Subject)-[]->(r:Response)-[]->(c:Concept)\n",
    "  RETURN s.identifier as STUDY, sub.identifier as SUBJID, c.submission as SEX"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create subject's '1235' response to Q1.\n",
    "\n",
    "```cypher\n",
    "MATCH (sub:Subject {identifier: '1235'}), (q:Question {identifier: 'Q1'})\n",
    "CREATE (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q)\n",
    "WITH sub,r\n",
    "MATCH (c:Concept {identifier: 'C16576'})\n",
    "CREATE (r)-[:VALUE]->(c)\n",
    "RETURN sub, c\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "3 relationships created.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>sub</th>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;1235&#x27;}</td>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Female&#x27;, &#x27;identifier&#x27;: &#x27;C16576&#x27;, &#x27;synonym&#x27;: &#x27;Female&#x27;, &#x27;submission&#x27;: &#x27;F&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': '1235'},\n",
       "  {'definition': 'A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C16576',\n",
       "   'preferred_term': 'Female',\n",
       "   'submission': 'F',\n",
       "   'synonym': 'Female'}]]"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (sub:Subject {identifier: '1235'}), (q:Question {identifier: 'Q1'})\n",
    "  CREATE (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q)\n",
    "  WITH sub,r\n",
    "  MATCH (c:Concept {identifier: 'C16576'})\n",
    "  CREATE (r)-[:VALUE]->(c)\n",
    "  RETURN sub, c"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "And now having linked everything we can query for some data\n",
    "\n",
    "```cypher\n",
    "MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[]-(sub:Subject)-[]->(r:Response)-[]->(c:Concept)\n",
    "RETURN s.identifier as STUDY, sub.identifier as SUBJID, c.submission as SEX\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>STUDY</th>\n",
       "        <th>SUBJID</th>\n",
       "        <th>SEX</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>F</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1235</td>\n",
       "        <td>F</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['http://data.acmepharma.com/clinicaltrial/12345', '1234', 'F'],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345', '1235', 'F']]"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[]-(sub:Subject)-[]->(r:Response)-[]->(c:Concept)\n",
    "  RETURN s.identifier as STUDY, sub.identifier as SUBJID, c.submission as SEX"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Load RACE code list\n",
    "\n",
    "```cypher\n",
    "LOAD CSV FROM \"https://www.dropbox.com/s/7ley89j6g6ng0ed/race.csv?dl=1\" AS line\n",
    "CREATE (:Concept { identifier: line[0], submission: line[1], preferred_term: line[2], synonym: line[3], definition: line[4] })\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "6 nodes created.\n",
      "24 properties set.\n",
      "6 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  LOAD CSV FROM \"https://www.dropbox.com/s/7ley89j6g6ng0ed/race.csv?dl=1\" AS line\n",
    "  CREATE (:Concept { identifier: line[0], submission: line[1], preferred_term: line[2], synonym: line[3], definition: line[4] })"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "List all the terminology nodes.\n",
    "\n",
    "```cypher\n",
    "MATCH (c:Concept) RETURN c\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "11 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian&#x27;, &#x27;identifier&#x27;: &#x27;C41260&#x27;, &#x27;submission&#x27;: &#x27;ASIAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Far East&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Native Hawaiian or Other Pacific Islander&#x27;, &#x27;identifier&#x27;: &#x27;C41219&#x27;, &#x27;submission&#x27;: &#x27;NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER&#x27;, &#x27;definition&#x27;: &#x27;Denotes a person having origins in any of the original peoples of Hawaii&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Race Terminology Race&#x27;, &#x27;identifier&#x27;: &#x27;C74457&#x27;, &#x27;synonym&#x27;: &#x27;Terminology codelist used to identify the race of an individual within the Clinical Data Interchange Standards Consortium Study Data Tabulation Model.&#x27;, &#x27;submission&#x27;: &#x27;RACE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Female&#x27;, &#x27;identifier&#x27;: &#x27;C16576&#x27;, &#x27;synonym&#x27;: &#x27;Female&#x27;, &#x27;submission&#x27;: &#x27;F&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Intersex  &#x27;, &#x27;identifier&#x27;: &#x27;C45908&#x27;, &#x27;synonym&#x27;: &#x27; &quot;A person (one of unisexual specimens) who is born with genitalia and/or secondary sexual characteristics of indeterminate sex&#x27;, &#x27;definition&#x27;: &#x27; or which combine features of both sexes. (NCI)&#x27;, &#x27;submission&#x27;: &#x27;UNDIFFERENTIATED&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Male&#x27;, &#x27;identifier&#x27;: &#x27;C20197&#x27;, &#x27;synonym&#x27;: &#x27;Male&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions&#x27;, &#x27;submission&#x27;: &#x27;M&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Unknown&#x27;, &#x27;identifier&#x27;: &#x27;C17998&#x27;, &#x27;synonym&#x27;: &#x27;U; UNK; Unknown&#x27;, &#x27;definition&#x27;: &#x27;Not known&#x27;, &#x27;submission&#x27;: &#x27;U&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Sex of Individual Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C66731&#x27;, &#x27;synonym&#x27;: &#x27;Sex&#x27;, &#x27;definition&#x27;: &#x27;The assemblage of physical properties or qualities by which male is distinguished from female; the physical difference between male and female; the distinguishing peculiarity of male or female. (NCI)&#x27;, &#x27;submission&#x27;: &#x27;SEX&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;American Indian or Alaska Native&#x27;, &#x27;identifier&#x27;: &#x27;C41259&#x27;, &#x27;submission&#x27;: &#x27;AMERICAN INDIAN OR ALASKA NATIVE&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of North and South America (including Central America)&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White&#x27;, &#x27;identifier&#x27;: &#x27;C41261&#x27;, &#x27;definition&#x27;: &#x27;Denotes a person with European&#x27;, &#x27;submission&#x27;: &#x27;WHITE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Black or African American&#x27;, &#x27;identifier&#x27;: &#x27;C16352&#x27;, &#x27;submission&#x27;: &#x27;BLACK OR AFRICAN AMERICAN&#x27;, &#x27;definition&#x27;: &quot;A person having origins in any of the black racial groups of Africa. Terms such as &#x27;Haitian&#x27; or &#x27;Negro&#x27; can be used in addition to &#x27;Black or African American.&#x27; (FDA)&quot;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'definition': 'A person having origins in any of the original peoples of the Far East',\n",
       "   'identifier': 'C41260',\n",
       "   'preferred_term': 'Asian',\n",
       "   'submission': 'ASIAN'}],\n",
       " [{'definition': 'Denotes a person having origins in any of the original peoples of Hawaii',\n",
       "   'identifier': 'C41219',\n",
       "   'preferred_term': 'Native Hawaiian or Other Pacific Islander',\n",
       "   'submission': 'NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER'}],\n",
       " [{'identifier': 'C74457',\n",
       "   'preferred_term': 'CDISC SDTM Race Terminology Race',\n",
       "   'submission': 'RACE',\n",
       "   'synonym': 'Terminology codelist used to identify the race of an individual within the Clinical Data Interchange Standards Consortium Study Data Tabulation Model.'}],\n",
       " [{'definition': 'A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C16576',\n",
       "   'preferred_term': 'Female',\n",
       "   'submission': 'F',\n",
       "   'synonym': 'Female'}],\n",
       " [{'definition': ' or which combine features of both sexes. (NCI)',\n",
       "   'identifier': 'C45908',\n",
       "   'preferred_term': 'Intersex  ',\n",
       "   'submission': 'UNDIFFERENTIATED',\n",
       "   'synonym': ' \"A person (one of unisexual specimens) who is born with genitalia and/or secondary sexual characteristics of indeterminate sex'}],\n",
       " [{'definition': 'A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C20197',\n",
       "   'preferred_term': 'Male',\n",
       "   'submission': 'M',\n",
       "   'synonym': 'Male'}],\n",
       " [{'definition': 'Not known',\n",
       "   'identifier': 'C17998',\n",
       "   'preferred_term': 'Unknown',\n",
       "   'submission': 'U',\n",
       "   'synonym': 'U; UNK; Unknown'}],\n",
       " [{'definition': 'The assemblage of physical properties or qualities by which male is distinguished from female; the physical difference between male and female; the distinguishing peculiarity of male or female. (NCI)',\n",
       "   'identifier': 'C66731',\n",
       "   'preferred_term': 'CDISC SDTM Sex of Individual Terminology',\n",
       "   'submission': 'SEX',\n",
       "   'synonym': 'Sex'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of North and South America (including Central America)',\n",
       "   'identifier': 'C41259',\n",
       "   'preferred_term': 'American Indian or Alaska Native',\n",
       "   'submission': 'AMERICAN INDIAN OR ALASKA NATIVE'}],\n",
       " [{'definition': 'Denotes a person with European',\n",
       "   'identifier': 'C41261',\n",
       "   'preferred_term': 'White',\n",
       "   'submission': 'WHITE'}],\n",
       " [{'definition': \"A person having origins in any of the black racial groups of Africa. Terms such as 'Haitian' or 'Negro' can be used in addition to 'Black or African American.' (FDA)\",\n",
       "   'identifier': 'C16352',\n",
       "   'preferred_term': 'Black or African American',\n",
       "   'submission': 'BLACK OR AFRICAN AMERICAN'}]]"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (c:Concept) RETURN c"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "```cypher\n",
    "MATCH (cl:Concept) WHERE cl.identifier = 'C74457'\n",
    "WITH cl\n",
    "MATCH (cli:Concept) WHERE cli.identifier <> 'C74457' AND NOT (cli)--()\n",
    "WITH cl, COLLECT(cli) as children\n",
    "UNWIND children as child\n",
    "CREATE (cl)-[:NARROWER]->(child)\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (cl:Concept) WHERE cl.identifier = 'C74457'\n",
    "  WITH cl\n",
    "  MATCH (cli:Concept) WHERE cli.identifier <> 'C74457' AND NOT (cli)--()\n",
    "  WITH cl, COLLECT(cli) as children\n",
    "  UNWIND children as child\n",
    "  CREATE (cl)-[:NARROWER]->(child)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Load RACEC code list\n",
    "\n",
    "```cypher\n",
    "LOAD CSV FROM \"https://www.dropbox.com/s/g7s92ebrlm6cxna/racec.csv?dl=1\" AS line\n",
    "CREATE (:Concept { identifier: line[0], submission: line[1], preferred_term: line[2], synonym: line[3], definition: line[4] })\n",
    " ```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "80 nodes created.\n",
      "322 properties set.\n",
      "80 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  LOAD CSV FROM \"https://www.dropbox.com/s/g7s92ebrlm6cxna/racec.csv?dl=1\" AS line\n",
    "  CREATE (:Concept { identifier: line[0], submission: line[1], preferred_term: line[2], synonym: line[3], definition: line[4] })"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "List out all the terminology nodes\n",
    "\n",
    "```cypher\n",
    "MATCH (c:Concept) RETURN c\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "91 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian&#x27;, &#x27;identifier&#x27;: &#x27;C41260&#x27;, &#x27;submission&#x27;: &#x27;ASIAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Far East&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Hmong&#x27;, &#x27;identifier&#x27;: &#x27;C43398&#x27;, &#x27;submission&#x27;: &#x27;HMONG&#x27;, &#x27;definition&#x27;: &#x27;The native people originating in China around the Yellow River or Hoang Ho.&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Arab&#x27;, &#x27;identifier&#x27;: &#x27;C43876&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Arabian peninsula and surrounding territories in the Middle East and northern Africa.&#x27;, &#x27;submission&#x27;: &#x27;ARAB&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Central American Indian&#x27;, &#x27;identifier&#x27;: &#x27;C44950&#x27;, &#x27;submission&#x27;: &#x27;CENTRAL AMERICAN INDIAN&#x27;, &#x27;definition&#x27;: &#x27;The native people of Central America.&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;African Caribbean&#x27;, &#x27;identifier&#x27;: &#x27;C41226&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of sub-Saharan Africa and the Caribbean.&#x27;, &#x27;submission&#x27;: &#x27;AFRICAN CARIBBEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Black&#x27;, &#x27;identifier&#x27;: &#x27;C128938&#x27;, &#x27;submission&#x27;: &#x27;BLACK&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of sub-Saharan Africa or the Caribbean.&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White South American&#x27;, &#x27;identifier&#x27;: &#x27;C128994&#x27;, &#x27;submission&#x27;: &#x27;WHITE SOUTH AMERICAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of Europe&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Native Hawaiian or Other Pacific Islander&#x27;, &#x27;identifier&#x27;: &#x27;C41219&#x27;, &#x27;submission&#x27;: &#x27;NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER&#x27;, &#x27;definition&#x27;: &#x27;Denotes a person having origins in any of the original peoples of Hawaii&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Race Terminology Race&#x27;, &#x27;identifier&#x27;: &#x27;C74457&#x27;, &#x27;synonym&#x27;: &#x27;Terminology codelist used to identify the race of an individual within the Clinical Data Interchange Standards Consortium Study Data Tabulation Model.&#x27;, &#x27;submission&#x27;: &#x27;RACE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Cambodian&#x27;, &#x27;identifier&#x27;: &#x27;C43399&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Cambodia (formerly Kampuchea).&#x27;, &#x27;submission&#x27;: &#x27;CAMBODIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Middle Eastern&#x27;, &#x27;identifier&#x27;: &#x27;C77820&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Middle East.&#x27;, &#x27;submission&#x27;: &#x27;MIDDLE EASTERN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;American Indian&#x27;, &#x27;identifier&#x27;: &#x27;C43877&#x27;, &#x27;definition&#x27;: &#x27;The native people of North America.&#x27;, &#x27;submission&#x27;: &#x27;AMERICAN INDIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Indonesian&#x27;, &#x27;identifier&#x27;: &#x27;C43715&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Indonesia.&#x27;, &#x27;submission&#x27;: &#x27;INDONESIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Bahamian&#x27;, &#x27;identifier&#x27;: &#x27;C67271&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Bahamas.&#x27;, &#x27;submission&#x27;: &#x27;BAHAMIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Malaysian&#x27;, &#x27;identifier&#x27;: &#x27;C43716&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Malaysia.&#x27;, &#x27;submission&#x27;: &#x27;MALAYSIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;South American Indian&#x27;, &#x27;identifier&#x27;: &#x27;C44953&#x27;, &#x27;definition&#x27;: &#x27;The native people of South America.&#x27;, &#x27;submission&#x27;: &#x27;SOUTH AMERICAN INDIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Russian&#x27;, &#x27;identifier&#x27;: &#x27;C43860&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Russia.&#x27;, &#x27;submission&#x27;: &#x27;RUSSIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Barbadian&#x27;, &#x27;identifier&#x27;: &#x27;C43823&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Barbados.&#x27;, &#x27;submission&#x27;: &#x27;BARBADIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Okinawan&#x27;, &#x27;identifier&#x27;: &#x27;C43717&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Okinawa.&#x27;, &#x27;submission&#x27;: &#x27;OKINAWAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Dominica Islander&#x27;, &#x27;identifier&#x27;: &#x27;C43824&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Dominica.&#x27;, &#x27;submission&#x27;: &#x27;DOMINICA ISLANDER&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Iwo Jiman&#x27;, &#x27;identifier&#x27;: &#x27;C43718&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Iwo Jima.&#x27;, &#x27;submission&#x27;: &#x27;IWO JIMAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Haitian&#x27;, &#x27;identifier&#x27;: &#x27;C43825&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Haiti.&#x27;, &#x27;submission&#x27;: &#x27;HAITIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Maldivian&#x27;, &#x27;identifier&#x27;: &#x27;C43719&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Maldives.&#x27;, &#x27;submission&#x27;: &#x27;MALDIVIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Jamaican&#x27;, &#x27;identifier&#x27;: &#x27;C43826&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Jamaica.&#x27;, &#x27;submission&#x27;: &#x27;JAMAICAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Greenland Eskimo&#x27;, &#x27;identifier&#x27;: &#x27;C44265&#x27;, &#x27;definition&#x27;: &#x27;The native people of Greenland.&#x27;, &#x27;submission&#x27;: &#x27;GREENLAND INUIT&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Mongolian&#x27;, &#x27;identifier&#x27;: &#x27;C43864&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Mongolia.&#x27;, &#x27;submission&#x27;: &#x27;MONGOLIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Tobagoan&#x27;, &#x27;identifier&#x27;: &#x27;C43827&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Tobago.&#x27;, &#x27;submission&#x27;: &#x27;TOBAGOAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Nepalese&#x27;, &#x27;identifier&#x27;: &#x27;C43720&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Nepal.&#x27;, &#x27;submission&#x27;: &#x27;NEPALESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Thai&#x27;, &#x27;identifier&#x27;: &#x27;C43400&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Thailand.&#x27;, &#x27;submission&#x27;: &#x27;THAI&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Trinidadian&#x27;, &#x27;identifier&#x27;: &#x27;C43828&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Trinidad.&#x27;, &#x27;submission&#x27;: &#x27;TRINIDADIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Singaporean&#x27;, &#x27;identifier&#x27;: &#x27;C43721&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Singapore.&#x27;, &#x27;submission&#x27;: &#x27;SINGAPOREAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Khoisan&#x27;, &#x27;identifier&#x27;: &#x27;C154874&#x27;, &#x27;definition&#x27;: &#x27;The native people of the Western Cape in southern Africa.&#x27;, &#x27;submission&#x27;: &#x27;KHOISAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian American&#x27;, &#x27;identifier&#x27;: &#x27;C16310&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of Asia and the United States.&#x27;, &#x27;submission&#x27;: &#x27;ASIAN AMERICAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;West Indian&#x27;, &#x27;identifier&#x27;: &#x27;C43829&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the West Indies.&#x27;, &#x27;submission&#x27;: &#x27;WEST INDIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Bangladeshi&#x27;, &#x27;identifier&#x27;: &#x27;C43671&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Bangladesh.&#x27;, &#x27;submission&#x27;: &#x27;BANGLADESHI&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Malagasy&#x27;, &#x27;identifier&#x27;: &#x27;C43722&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Madagascar.&#x27;, &#x27;submission&#x27;: &#x27;MALAGASY&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Aboriginal Australian&#x27;, &#x27;identifier&#x27;: &#x27;C154875&#x27;, &#x27;definition&#x27;: &#x27;The native people of Australia.&#x27;, &#x27;submission&#x27;: &#x27;ABORIGINAL AUSTRALIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Inupiat Eskimo&#x27;, &#x27;identifier&#x27;: &#x27;C44268&#x27;, &#x27;definition&#x27;: &#x27;The native people inhabiting the territory spanning the Norton Sound on the Bering Sea to the Canadian border.&#x27;, &#x27;submission&#x27;: &#x27;INUPIAT INUIT&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Micronesian&#x27;, &#x27;identifier&#x27;: &#x27;C43402&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Micronesia.&#x27;, &#x27;submission&#x27;: &#x27;MICRONESIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Female&#x27;, &#x27;identifier&#x27;: &#x27;C16576&#x27;, &#x27;synonym&#x27;: &#x27;Female&#x27;, &#x27;submission&#x27;: &#x27;F&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Intersex  &#x27;, &#x27;identifier&#x27;: &#x27;C45908&#x27;, &#x27;synonym&#x27;: &#x27; &quot;A person (one of unisexual specimens) who is born with genitalia and/or secondary sexual characteristics of indeterminate sex&#x27;, &#x27;definition&#x27;: &#x27; or which combine features of both sexes. (NCI)&#x27;, &#x27;submission&#x27;: &#x27;UNDIFFERENTIATED&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Male&#x27;, &#x27;identifier&#x27;: &#x27;C20197&#x27;, &#x27;synonym&#x27;: &#x27;Male&#x27;, &#x27;definition&#x27;: &#x27;A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions&#x27;, &#x27;submission&#x27;: &#x27;M&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Unknown&#x27;, &#x27;identifier&#x27;: &#x27;C17998&#x27;, &#x27;synonym&#x27;: &#x27;U; UNK; Unknown&#x27;, &#x27;definition&#x27;: &#x27;Not known&#x27;, &#x27;submission&#x27;: &#x27;U&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Sex of Individual Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C66731&#x27;, &#x27;synonym&#x27;: &#x27;Sex&#x27;, &#x27;definition&#x27;: &#x27;The assemblage of physical properties or qualities by which male is distinguished from female; the physical difference between male and female; the distinguishing peculiarity of male or female. (NCI)&#x27;, &#x27;submission&#x27;: &#x27;SEX&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Caribbean Indian&#x27;, &#x27;identifier&#x27;: &#x27;C77810&#x27;, &#x27;definition&#x27;: &#x27;The native people of the Caribbean.&#x27;, &#x27;submission&#x27;: &#x27;CARIBBEAN INDIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Pakistani&#x27;, &#x27;identifier&#x27;: &#x27;C43427&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Pakistan.&#x27;, &#x27;submission&#x27;: &#x27;PAKISTANI&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Alaska Native&#x27;, &#x27;identifier&#x27;: &#x27;C18237&#x27;, &#x27;definition&#x27;: &#x27;The native people of Alaska.&#x27;, &#x27;submission&#x27;: &#x27;ALASKA NATIVE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Botswanan&#x27;, &#x27;identifier&#x27;: &#x27;C43830&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Botswana.&#x27;, &#x27;submission&#x27;: &#x27;BOTSWANAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Polynesian&#x27;, &#x27;identifier&#x27;: &#x27;C43405&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Polynesia.&#x27;, &#x27;submission&#x27;: &#x27;POLYNESIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Filipino&#x27;, &#x27;identifier&#x27;: &#x27;C43393&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Philippines.&#x27;, &#x27;submission&#x27;: &#x27;FILIPINO&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Chinese&#x27;, &#x27;identifier&#x27;: &#x27;C43391&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of China.&#x27;, &#x27;submission&#x27;: &#x27;CHINESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Black Central American&#x27;, &#x27;identifier&#x27;: &#x27;C128991&#x27;, &#x27;submission&#x27;: &#x27;BLACK CENTRAL AMERICAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of sub-Saharan Africa and Central America.&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Vietnamese&#x27;, &#x27;identifier&#x27;: &#x27;C43396&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Viet Nam.&#x27;, &#x27;submission&#x27;: &#x27;VIETNAMESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White&#x27;, &#x27;identifier&#x27;: &#x27;C41261&#x27;, &#x27;definition&#x27;: &#x27;Denotes a person with European&#x27;, &#x27;submission&#x27;: &#x27;WHITE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Black South American&#x27;, &#x27;identifier&#x27;: &#x27;C128992&#x27;, &#x27;submission&#x27;: &#x27;BLACK SOUTH AMERICAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of sub-Saharan Africa and South America.&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Laotian&#x27;, &#x27;identifier&#x27;: &#x27;C43397&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Laos.&#x27;, &#x27;submission&#x27;: &#x27;LAOTIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Eastern European&#x27;, &#x27;identifier&#x27;: &#x27;C77819&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Eastern Europe.&#x27;, &#x27;submission&#x27;: &#x27;EASTERN EUROPEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian Indian&#x27;, &#x27;identifier&#x27;: &#x27;C41262&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Indian subcontinent.&#x27;, &#x27;submission&#x27;: &#x27;ASIAN INDIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;African American&#x27;, &#x27;identifier&#x27;: &#x27;C128937&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of sub-Saharan Africa and the United States.&#x27;, &#x27;submission&#x27;: &#x27;AFRICAN AMERICAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White Central American&#x27;, &#x27;identifier&#x27;: &#x27;C128993&#x27;, &#x27;submission&#x27;: &#x27;WHITE CENTRAL AMERICAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of Europe&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Taiwanese&#x27;, &#x27;identifier&#x27;: &#x27;C43675&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Taiwan.&#x27;, &#x27;submission&#x27;: &#x27;TAIWANESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;North Coast of Africa&#x27;, &#x27;identifier&#x27;: &#x27;C77813&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of North Africa.&#x27;, &#x27;submission&#x27;: &#x27;NORTH AFRICAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Bhutanese&#x27;, &#x27;identifier&#x27;: &#x27;C43673&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Bhutan.&#x27;, &#x27;submission&#x27;: &#x27;BHUTANESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Ethiopian&#x27;, &#x27;identifier&#x27;: &#x27;C43831&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Ethiopia.&#x27;, &#x27;submission&#x27;: &#x27;ETHIOPIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;European&#x27;, &#x27;identifier&#x27;: &#x27;C43851&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Europe.&#x27;, &#x27;submission&#x27;: &#x27;EUROPEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Unknown&#x27;, &#x27;identifier&#x27;: &#x27;C17998&#x27;, &#x27;synonym&#x27;: &#x27;U; UNK; Unknown&#x27;, &#x27;definition&#x27;: &#x27;Not known&#x27;, &#x27;submission&#x27;: &#x27;UNKNOWN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;American Indian or Alaska Native&#x27;, &#x27;identifier&#x27;: &#x27;C41259&#x27;, &#x27;submission&#x27;: &#x27;AMERICAN INDIAN OR ALASKA NATIVE&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of North and South America (including Central America)&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White Caribbean&#x27;, &#x27;identifier&#x27;: &#x27;C77816&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in the original peoples of Europe&#x27;, &#x27;submission&#x27;: &#x27;WHITE CARIBBEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Northern European&#x27;, &#x27;identifier&#x27;: &#x27;C77814&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Northern Europe.&#x27;, &#x27;submission&#x27;: &#x27;NORTHERN EUROPEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Zairean&#x27;, &#x27;identifier&#x27;: &#x27;C43835&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Zaire.&#x27;, &#x27;submission&#x27;: &#x27;ZAIREAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Namibian&#x27;, &#x27;identifier&#x27;: &#x27;C43833&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Namibia.&#x27;, &#x27;submission&#x27;: &#x27;NAMIBIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Burmese&#x27;, &#x27;identifier&#x27;: &#x27;C43674&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Myanmar (formerly Burma).&#x27;, &#x27;submission&#x27;: &#x27;BURMESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Sri Lankan&#x27;, &#x27;identifier&#x27;: &#x27;C43672&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Sri Lanka.&#x27;, &#x27;submission&#x27;: &#x27;SRI LANKAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Mediterranean&#x27;, &#x27;identifier&#x27;: &#x27;C77811&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the countries surrounding the Mediterranean sea.&#x27;, &#x27;submission&#x27;: &#x27;MEDITERRANEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Dominican&#x27;, &#x27;identifier&#x27;: &#x27;C67117&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Dominican Republic.&#x27;, &#x27;submission&#x27;: &#x27;DOMINICAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Yupik Eskimo&#x27;, &#x27;identifier&#x27;: &#x27;C44270&#x27;, &#x27;definition&#x27;: &#x27;The native people inhabiting western&#x27;, &#x27;submission&#x27;: &#x27;YUPIK ESKIMO&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Liberian&#x27;, &#x27;identifier&#x27;: &#x27;C43832&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Liberia.&#x27;, &#x27;submission&#x27;: &#x27;LIBERIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Native Hawaiian or Other Pacific Islander&#x27;, &#x27;identifier&#x27;: &#x27;C41219&#x27;, &#x27;submission&#x27;: &#x27;NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER&#x27;, &#x27;definition&#x27;: &#x27;Denotes a person having origins in any of the original peoples of Hawaii&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Melanesian&#x27;, &#x27;identifier&#x27;: &#x27;C43409&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Melanesia.&#x27;, &#x27;submission&#x27;: &#x27;MELANESIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Korean&#x27;, &#x27;identifier&#x27;: &#x27;C43395&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of North and South Korea.&#x27;, &#x27;submission&#x27;: &#x27;KOREAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Siberian Eskimo&#x27;, &#x27;identifier&#x27;: &#x27;C44269&#x27;, &#x27;definition&#x27;: &#x27;The native Yupik people inhabiting the coast of the Chukchi Peninsula in the far northeast of the Russian Federation and on St. Lawrence Island in Alaska.&#x27;, &#x27;submission&#x27;: &#x27;SIBERIAN ESKIMO&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Japanese&#x27;, &#x27;identifier&#x27;: &#x27;C43392&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Japan.&#x27;, &#x27;submission&#x27;: &#x27;JAPANESE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Asian&#x27;, &#x27;identifier&#x27;: &#x27;C41260&#x27;, &#x27;submission&#x27;: &#x27;ASIAN&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of the Far East&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;African&#x27;, &#x27;identifier&#x27;: &#x27;C42331&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of sub-Saharan Africa.&#x27;, &#x27;submission&#x27;: &#x27;AFRICAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Black or African American&#x27;, &#x27;identifier&#x27;: &#x27;C16352&#x27;, &#x27;submission&#x27;: &#x27;BLACK OR AFRICAN AMERICAN&#x27;, &#x27;definition&#x27;: &quot;A person having origins in any of the black racial groups of Africa. Terms such as &#x27;Haitian&#x27; or &#x27;Negro&#x27; can be used in addition to &#x27;Black or African American.&#x27; (FDA)&quot;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Western European&#x27;, &#x27;identifier&#x27;: &#x27;C77817&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Western Europe.&#x27;, &#x27;submission&#x27;: &#x27;WESTERN EUROPEAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Nigerian&#x27;, &#x27;identifier&#x27;: &#x27;C43834&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of Nigeria.&#x27;, &#x27;submission&#x27;: &#x27;NIGERIAN&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;CDISC SDTM Collected Race Terminology&#x27;, &#x27;identifier&#x27;: &#x27;C128689&#x27;, &#x27;synonym&#x27;: &#x27;Race As Collected&#x27;, &#x27;definition&#x27;: &#x27;A terminology codelist relevant to the race of an individual as collected on the case report form.&#x27;, &#x27;submission&#x27;: &#x27;RACEC&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;American Indian or Alaska Native&#x27;, &#x27;identifier&#x27;: &#x27;C41259&#x27;, &#x27;submission&#x27;: &#x27;AMERICAN INDIAN OR ALASKA NATIVE&#x27;, &#x27;definition&#x27;: &#x27;A person having origins in any of the original peoples of North and South America (including Central America)&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;White&#x27;, &#x27;identifier&#x27;: &#x27;C41261&#x27;, &#x27;definition&#x27;: &#x27;Denotes a person with European&#x27;, &#x27;submission&#x27;: &#x27;WHITE&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;preferred_term&#x27;: &#x27;Black or African American&#x27;, &#x27;identifier&#x27;: &#x27;C16352&#x27;, &#x27;submission&#x27;: &#x27;BLACK OR AFRICAN AMERICAN&#x27;, &#x27;definition&#x27;: &quot;A person having origins in any of the black racial groups of Africa. Terms such as &#x27;Haitian&#x27; or &#x27;Negro&#x27; can be used in addition to &#x27;Black or African American.&#x27; (FDA)&quot;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'definition': 'A person having origins in any of the original peoples of the Far East',\n",
       "   'identifier': 'C41260',\n",
       "   'preferred_term': 'Asian',\n",
       "   'submission': 'ASIAN'}],\n",
       " [{'definition': 'The native people originating in China around the Yellow River or Hoang Ho.',\n",
       "   'identifier': 'C43398',\n",
       "   'preferred_term': 'Hmong',\n",
       "   'submission': 'HMONG'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Arabian peninsula and surrounding territories in the Middle East and northern Africa.',\n",
       "   'identifier': 'C43876',\n",
       "   'preferred_term': 'Arab',\n",
       "   'submission': 'ARAB'}],\n",
       " [{'definition': 'The native people of Central America.',\n",
       "   'identifier': 'C44950',\n",
       "   'preferred_term': 'Central American Indian',\n",
       "   'submission': 'CENTRAL AMERICAN INDIAN'}],\n",
       " [{'definition': 'A person having origins in the original peoples of sub-Saharan Africa and the Caribbean.',\n",
       "   'identifier': 'C41226',\n",
       "   'preferred_term': 'African Caribbean',\n",
       "   'submission': 'AFRICAN CARIBBEAN'}],\n",
       " [{'definition': 'A person having origins in the original peoples of sub-Saharan Africa or the Caribbean.',\n",
       "   'identifier': 'C128938',\n",
       "   'preferred_term': 'Black',\n",
       "   'submission': 'BLACK'}],\n",
       " [{'definition': 'A person having origins in the original peoples of Europe',\n",
       "   'identifier': 'C128994',\n",
       "   'preferred_term': 'White South American',\n",
       "   'submission': 'WHITE SOUTH AMERICAN'}],\n",
       " [{'definition': 'Denotes a person having origins in any of the original peoples of Hawaii',\n",
       "   'identifier': 'C41219',\n",
       "   'preferred_term': 'Native Hawaiian or Other Pacific Islander',\n",
       "   'submission': 'NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER'}],\n",
       " [{'identifier': 'C74457',\n",
       "   'preferred_term': 'CDISC SDTM Race Terminology Race',\n",
       "   'submission': 'RACE',\n",
       "   'synonym': 'Terminology codelist used to identify the race of an individual within the Clinical Data Interchange Standards Consortium Study Data Tabulation Model.'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Cambodia (formerly Kampuchea).',\n",
       "   'identifier': 'C43399',\n",
       "   'preferred_term': 'Cambodian',\n",
       "   'submission': 'CAMBODIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Middle East.',\n",
       "   'identifier': 'C77820',\n",
       "   'preferred_term': 'Middle Eastern',\n",
       "   'submission': 'MIDDLE EASTERN'}],\n",
       " [{'definition': 'The native people of North America.',\n",
       "   'identifier': 'C43877',\n",
       "   'preferred_term': 'American Indian',\n",
       "   'submission': 'AMERICAN INDIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Indonesia.',\n",
       "   'identifier': 'C43715',\n",
       "   'preferred_term': 'Indonesian',\n",
       "   'submission': 'INDONESIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Bahamas.',\n",
       "   'identifier': 'C67271',\n",
       "   'preferred_term': 'Bahamian',\n",
       "   'submission': 'BAHAMIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Malaysia.',\n",
       "   'identifier': 'C43716',\n",
       "   'preferred_term': 'Malaysian',\n",
       "   'submission': 'MALAYSIAN'}],\n",
       " [{'definition': 'The native people of South America.',\n",
       "   'identifier': 'C44953',\n",
       "   'preferred_term': 'South American Indian',\n",
       "   'submission': 'SOUTH AMERICAN INDIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Russia.',\n",
       "   'identifier': 'C43860',\n",
       "   'preferred_term': 'Russian',\n",
       "   'submission': 'RUSSIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Barbados.',\n",
       "   'identifier': 'C43823',\n",
       "   'preferred_term': 'Barbadian',\n",
       "   'submission': 'BARBADIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Okinawa.',\n",
       "   'identifier': 'C43717',\n",
       "   'preferred_term': 'Okinawan',\n",
       "   'submission': 'OKINAWAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Dominica.',\n",
       "   'identifier': 'C43824',\n",
       "   'preferred_term': 'Dominica Islander',\n",
       "   'submission': 'DOMINICA ISLANDER'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Iwo Jima.',\n",
       "   'identifier': 'C43718',\n",
       "   'preferred_term': 'Iwo Jiman',\n",
       "   'submission': 'IWO JIMAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Haiti.',\n",
       "   'identifier': 'C43825',\n",
       "   'preferred_term': 'Haitian',\n",
       "   'submission': 'HAITIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Maldives.',\n",
       "   'identifier': 'C43719',\n",
       "   'preferred_term': 'Maldivian',\n",
       "   'submission': 'MALDIVIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Jamaica.',\n",
       "   'identifier': 'C43826',\n",
       "   'preferred_term': 'Jamaican',\n",
       "   'submission': 'JAMAICAN'}],\n",
       " [{'definition': 'The native people of Greenland.',\n",
       "   'identifier': 'C44265',\n",
       "   'preferred_term': 'Greenland Eskimo',\n",
       "   'submission': 'GREENLAND INUIT'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Mongolia.',\n",
       "   'identifier': 'C43864',\n",
       "   'preferred_term': 'Mongolian',\n",
       "   'submission': 'MONGOLIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Tobago.',\n",
       "   'identifier': 'C43827',\n",
       "   'preferred_term': 'Tobagoan',\n",
       "   'submission': 'TOBAGOAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Nepal.',\n",
       "   'identifier': 'C43720',\n",
       "   'preferred_term': 'Nepalese',\n",
       "   'submission': 'NEPALESE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Thailand.',\n",
       "   'identifier': 'C43400',\n",
       "   'preferred_term': 'Thai',\n",
       "   'submission': 'THAI'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Trinidad.',\n",
       "   'identifier': 'C43828',\n",
       "   'preferred_term': 'Trinidadian',\n",
       "   'submission': 'TRINIDADIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Singapore.',\n",
       "   'identifier': 'C43721',\n",
       "   'preferred_term': 'Singaporean',\n",
       "   'submission': 'SINGAPOREAN'}],\n",
       " [{'definition': 'The native people of the Western Cape in southern Africa.',\n",
       "   'identifier': 'C154874',\n",
       "   'preferred_term': 'Khoisan',\n",
       "   'submission': 'KHOISAN'}],\n",
       " [{'definition': 'A person having origins in the original peoples of Asia and the United States.',\n",
       "   'identifier': 'C16310',\n",
       "   'preferred_term': 'Asian American',\n",
       "   'submission': 'ASIAN AMERICAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the West Indies.',\n",
       "   'identifier': 'C43829',\n",
       "   'preferred_term': 'West Indian',\n",
       "   'submission': 'WEST INDIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Bangladesh.',\n",
       "   'identifier': 'C43671',\n",
       "   'preferred_term': 'Bangladeshi',\n",
       "   'submission': 'BANGLADESHI'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Madagascar.',\n",
       "   'identifier': 'C43722',\n",
       "   'preferred_term': 'Malagasy',\n",
       "   'submission': 'MALAGASY'}],\n",
       " [{'definition': 'The native people of Australia.',\n",
       "   'identifier': 'C154875',\n",
       "   'preferred_term': 'Aboriginal Australian',\n",
       "   'submission': 'ABORIGINAL AUSTRALIAN'}],\n",
       " [{'definition': 'The native people inhabiting the territory spanning the Norton Sound on the Bering Sea to the Canadian border.',\n",
       "   'identifier': 'C44268',\n",
       "   'preferred_term': 'Inupiat Eskimo',\n",
       "   'submission': 'INUPIAT INUIT'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Micronesia.',\n",
       "   'identifier': 'C43402',\n",
       "   'preferred_term': 'Micronesian',\n",
       "   'submission': 'MICRONESIAN'}],\n",
       " [{'definition': 'A person who belongs to the sex that normally produces ova. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C16576',\n",
       "   'preferred_term': 'Female',\n",
       "   'submission': 'F',\n",
       "   'synonym': 'Female'}],\n",
       " [{'definition': ' or which combine features of both sexes. (NCI)',\n",
       "   'identifier': 'C45908',\n",
       "   'preferred_term': 'Intersex  ',\n",
       "   'submission': 'UNDIFFERENTIATED',\n",
       "   'synonym': ' \"A person (one of unisexual specimens) who is born with genitalia and/or secondary sexual characteristics of indeterminate sex'}],\n",
       " [{'definition': 'A person who belongs to the sex that normally produces sperm. The term is used to indicate biological sex distinctions',\n",
       "   'identifier': 'C20197',\n",
       "   'preferred_term': 'Male',\n",
       "   'submission': 'M',\n",
       "   'synonym': 'Male'}],\n",
       " [{'definition': 'Not known',\n",
       "   'identifier': 'C17998',\n",
       "   'preferred_term': 'Unknown',\n",
       "   'submission': 'U',\n",
       "   'synonym': 'U; UNK; Unknown'}],\n",
       " [{'definition': 'The assemblage of physical properties or qualities by which male is distinguished from female; the physical difference between male and female; the distinguishing peculiarity of male or female. (NCI)',\n",
       "   'identifier': 'C66731',\n",
       "   'preferred_term': 'CDISC SDTM Sex of Individual Terminology',\n",
       "   'submission': 'SEX',\n",
       "   'synonym': 'Sex'}],\n",
       " [{'definition': 'The native people of the Caribbean.',\n",
       "   'identifier': 'C77810',\n",
       "   'preferred_term': 'Caribbean Indian',\n",
       "   'submission': 'CARIBBEAN INDIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Pakistan.',\n",
       "   'identifier': 'C43427',\n",
       "   'preferred_term': 'Pakistani',\n",
       "   'submission': 'PAKISTANI'}],\n",
       " [{'definition': 'The native people of Alaska.',\n",
       "   'identifier': 'C18237',\n",
       "   'preferred_term': 'Alaska Native',\n",
       "   'submission': 'ALASKA NATIVE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Botswana.',\n",
       "   'identifier': 'C43830',\n",
       "   'preferred_term': 'Botswanan',\n",
       "   'submission': 'BOTSWANAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Polynesia.',\n",
       "   'identifier': 'C43405',\n",
       "   'preferred_term': 'Polynesian',\n",
       "   'submission': 'POLYNESIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Philippines.',\n",
       "   'identifier': 'C43393',\n",
       "   'preferred_term': 'Filipino',\n",
       "   'submission': 'FILIPINO'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of China.',\n",
       "   'identifier': 'C43391',\n",
       "   'preferred_term': 'Chinese',\n",
       "   'submission': 'CHINESE'}],\n",
       " [{'definition': 'A person having origins in the original peoples of sub-Saharan Africa and Central America.',\n",
       "   'identifier': 'C128991',\n",
       "   'preferred_term': 'Black Central American',\n",
       "   'submission': 'BLACK CENTRAL AMERICAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Viet Nam.',\n",
       "   'identifier': 'C43396',\n",
       "   'preferred_term': 'Vietnamese',\n",
       "   'submission': 'VIETNAMESE'}],\n",
       " [{'definition': 'Denotes a person with European',\n",
       "   'identifier': 'C41261',\n",
       "   'preferred_term': 'White',\n",
       "   'submission': 'WHITE'}],\n",
       " [{'definition': 'A person having origins in the original peoples of sub-Saharan Africa and South America.',\n",
       "   'identifier': 'C128992',\n",
       "   'preferred_term': 'Black South American',\n",
       "   'submission': 'BLACK SOUTH AMERICAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Laos.',\n",
       "   'identifier': 'C43397',\n",
       "   'preferred_term': 'Laotian',\n",
       "   'submission': 'LAOTIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Eastern Europe.',\n",
       "   'identifier': 'C77819',\n",
       "   'preferred_term': 'Eastern European',\n",
       "   'submission': 'EASTERN EUROPEAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Indian subcontinent.',\n",
       "   'identifier': 'C41262',\n",
       "   'preferred_term': 'Asian Indian',\n",
       "   'submission': 'ASIAN INDIAN'}],\n",
       " [{'definition': 'A person having origins in the original peoples of sub-Saharan Africa and the United States.',\n",
       "   'identifier': 'C128937',\n",
       "   'preferred_term': 'African American',\n",
       "   'submission': 'AFRICAN AMERICAN'}],\n",
       " [{'definition': 'A person having origins in the original peoples of Europe',\n",
       "   'identifier': 'C128993',\n",
       "   'preferred_term': 'White Central American',\n",
       "   'submission': 'WHITE CENTRAL AMERICAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Taiwan.',\n",
       "   'identifier': 'C43675',\n",
       "   'preferred_term': 'Taiwanese',\n",
       "   'submission': 'TAIWANESE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of North Africa.',\n",
       "   'identifier': 'C77813',\n",
       "   'preferred_term': 'North Coast of Africa',\n",
       "   'submission': 'NORTH AFRICAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Bhutan.',\n",
       "   'identifier': 'C43673',\n",
       "   'preferred_term': 'Bhutanese',\n",
       "   'submission': 'BHUTANESE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Ethiopia.',\n",
       "   'identifier': 'C43831',\n",
       "   'preferred_term': 'Ethiopian',\n",
       "   'submission': 'ETHIOPIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Europe.',\n",
       "   'identifier': 'C43851',\n",
       "   'preferred_term': 'European',\n",
       "   'submission': 'EUROPEAN'}],\n",
       " [{'definition': 'Not known',\n",
       "   'identifier': 'C17998',\n",
       "   'preferred_term': 'Unknown',\n",
       "   'submission': 'UNKNOWN',\n",
       "   'synonym': 'U; UNK; Unknown'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of North and South America (including Central America)',\n",
       "   'identifier': 'C41259',\n",
       "   'preferred_term': 'American Indian or Alaska Native',\n",
       "   'submission': 'AMERICAN INDIAN OR ALASKA NATIVE'}],\n",
       " [{'definition': 'A person having origins in the original peoples of Europe',\n",
       "   'identifier': 'C77816',\n",
       "   'preferred_term': 'White Caribbean',\n",
       "   'submission': 'WHITE CARIBBEAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Northern Europe.',\n",
       "   'identifier': 'C77814',\n",
       "   'preferred_term': 'Northern European',\n",
       "   'submission': 'NORTHERN EUROPEAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Zaire.',\n",
       "   'identifier': 'C43835',\n",
       "   'preferred_term': 'Zairean',\n",
       "   'submission': 'ZAIREAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Namibia.',\n",
       "   'identifier': 'C43833',\n",
       "   'preferred_term': 'Namibian',\n",
       "   'submission': 'NAMIBIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Myanmar (formerly Burma).',\n",
       "   'identifier': 'C43674',\n",
       "   'preferred_term': 'Burmese',\n",
       "   'submission': 'BURMESE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Sri Lanka.',\n",
       "   'identifier': 'C43672',\n",
       "   'preferred_term': 'Sri Lankan',\n",
       "   'submission': 'SRI LANKAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the countries surrounding the Mediterranean sea.',\n",
       "   'identifier': 'C77811',\n",
       "   'preferred_term': 'Mediterranean',\n",
       "   'submission': 'MEDITERRANEAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Dominican Republic.',\n",
       "   'identifier': 'C67117',\n",
       "   'preferred_term': 'Dominican',\n",
       "   'submission': 'DOMINICAN'}],\n",
       " [{'definition': 'The native people inhabiting western',\n",
       "   'identifier': 'C44270',\n",
       "   'preferred_term': 'Yupik Eskimo',\n",
       "   'submission': 'YUPIK ESKIMO'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Liberia.',\n",
       "   'identifier': 'C43832',\n",
       "   'preferred_term': 'Liberian',\n",
       "   'submission': 'LIBERIAN'}],\n",
       " [{'definition': 'Denotes a person having origins in any of the original peoples of Hawaii',\n",
       "   'identifier': 'C41219',\n",
       "   'preferred_term': 'Native Hawaiian or Other Pacific Islander',\n",
       "   'submission': 'NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Melanesia.',\n",
       "   'identifier': 'C43409',\n",
       "   'preferred_term': 'Melanesian',\n",
       "   'submission': 'MELANESIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of North and South Korea.',\n",
       "   'identifier': 'C43395',\n",
       "   'preferred_term': 'Korean',\n",
       "   'submission': 'KOREAN'}],\n",
       " [{'definition': 'The native Yupik people inhabiting the coast of the Chukchi Peninsula in the far northeast of the Russian Federation and on St. Lawrence Island in Alaska.',\n",
       "   'identifier': 'C44269',\n",
       "   'preferred_term': 'Siberian Eskimo',\n",
       "   'submission': 'SIBERIAN ESKIMO'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Japan.',\n",
       "   'identifier': 'C43392',\n",
       "   'preferred_term': 'Japanese',\n",
       "   'submission': 'JAPANESE'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of the Far East',\n",
       "   'identifier': 'C41260',\n",
       "   'preferred_term': 'Asian',\n",
       "   'submission': 'ASIAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of sub-Saharan Africa.',\n",
       "   'identifier': 'C42331',\n",
       "   'preferred_term': 'African',\n",
       "   'submission': 'AFRICAN'}],\n",
       " [{'definition': \"A person having origins in any of the black racial groups of Africa. Terms such as 'Haitian' or 'Negro' can be used in addition to 'Black or African American.' (FDA)\",\n",
       "   'identifier': 'C16352',\n",
       "   'preferred_term': 'Black or African American',\n",
       "   'submission': 'BLACK OR AFRICAN AMERICAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Western Europe.',\n",
       "   'identifier': 'C77817',\n",
       "   'preferred_term': 'Western European',\n",
       "   'submission': 'WESTERN EUROPEAN'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of Nigeria.',\n",
       "   'identifier': 'C43834',\n",
       "   'preferred_term': 'Nigerian',\n",
       "   'submission': 'NIGERIAN'}],\n",
       " [{'definition': 'A terminology codelist relevant to the race of an individual as collected on the case report form.',\n",
       "   'identifier': 'C128689',\n",
       "   'preferred_term': 'CDISC SDTM Collected Race Terminology',\n",
       "   'submission': 'RACEC',\n",
       "   'synonym': 'Race As Collected'}],\n",
       " [{'definition': 'A person having origins in any of the original peoples of North and South America (including Central America)',\n",
       "   'identifier': 'C41259',\n",
       "   'preferred_term': 'American Indian or Alaska Native',\n",
       "   'submission': 'AMERICAN INDIAN OR ALASKA NATIVE'}],\n",
       " [{'definition': 'Denotes a person with European',\n",
       "   'identifier': 'C41261',\n",
       "   'preferred_term': 'White',\n",
       "   'submission': 'WHITE'}],\n",
       " [{'definition': \"A person having origins in any of the black racial groups of Africa. Terms such as 'Haitian' or 'Negro' can be used in addition to 'Black or African American.' (FDA)\",\n",
       "   'identifier': 'C16352',\n",
       "   'preferred_term': 'Black or African American',\n",
       "   'submission': 'BLACK OR AFRICAN AMERICAN'}]]"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%cypher http://neo4j:ld123@localhost:7474 MATCH (c:Concept) RETURN c"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "```cypher\n",
    "MATCH (cl:Concept) WHERE cl.identifier = 'C128689'\n",
    "WITH cl\n",
    "MATCH (cli:Concept) WHERE cli.identifier <> 'C128689' AND NOT (cli)--()\n",
    "WITH cl, COLLECT(cli) as children\n",
    "UNWIND children as child\n",
    "CREATE (cl)-[:NARROWER]->(child)\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "79 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (cl:Concept) WHERE cl.identifier = 'C128689'\n",
    "  WITH cl\n",
    "  MATCH (cli:Concept) WHERE cli.identifier <> 'C128689' AND NOT (cli)--()\n",
    "  WITH cl, COLLECT(cli) as children\n",
    "  UNWIND children as child\n",
    "  CREATE (cl)-[:NARROWER]->(child)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query to create the second question\n",
    "\n",
    "```cypher\n",
    "MATCH (ci:CollectionInstrument {identifier: 'DM'})\n",
    "CREATE (ci)-[:HAS_QUESTION]->(q:Question {identifier: 'Q2', question_text: 'Race?'})\n",
    "RETURN ci,q\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "2 properties set.\n",
      "1 relationships created.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>ci</th>\n",
       "        <th>q</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;DM&#x27;, &#x27;name&#x27;: &#x27;Demographics&#x27;}</td>\n",
       "        <td>{&#x27;question_text&#x27;: &#x27;Race?&#x27;, &#x27;identifier&#x27;: &#x27;Q2&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': 'DM', 'name': 'Demographics'},\n",
       "  {'identifier': 'Q2', 'question_text': 'Race?'}]]"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (ci:CollectionInstrument {identifier: 'DM'})\n",
    "  CREATE (ci)-[:HAS_QUESTION]->(q:Question {identifier: 'Q2', question_text: 'Race?'})\n",
    "  RETURN ci,q"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "```cypher\n",
    "MATCH (q:Question {identifier: 'Q2'})\n",
    "WITH q\n",
    "UNWIND ['C43831', 'C43851', 'C17998', 'C41259', 'C77816', 'C77814'] AS id\n",
    "MATCH (cl:Concept)-[:NARROWER]->(cli:Concept) WHERE cl.identifier = 'C128689' AND cli.identifier = id\n",
    "CREATE (q)-[:HAS_RESPONSE]->(cli)\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Note we need the bit to restrict to the RACE codelist"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "6 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (q:Question {identifier: 'Q2'})\n",
    "  WITH q\n",
    "  UNWIND ['C43831', 'C43851', 'C17998', 'C41259', 'C77816', 'C77814'] AS id\n",
    "  MATCH (cl:Concept)-[:NARROWER]->(cli:Concept) WHERE cl.identifier = 'C128689' AND cli.identifier = id\n",
    "  CREATE (q)-[:HAS_RESPONSE]->(cli)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Set up subject data. Subject '1234' answers Q2 with ETHIOPIAN C43831.\n",
    "\n",
    "```cypher\n",
    "MATCH (sub:Subject {identifier: '1234'}), (q:Question {identifier: 'Q2'})\n",
    "CREATE (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q)\n",
    "WITH sub,r\n",
    "MATCH (c:Concept {identifier: 'C43831'})\n",
    "CREATE (r)-[:VALUE]->(c)\n",
    "RETURN sub, c.submission\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 nodes created.\n",
      "3 relationships created.\n",
      "1 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>sub</th>\n",
       "        <th>c.submission</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;1234&#x27;}</td>\n",
       "        <td>ETHIOPIAN</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': '1234'}, 'ETHIOPIAN']]"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (sub:Subject {identifier: '1234'}), (q:Question {identifier: 'Q2'})\n",
    "  CREATE (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q)\n",
    "  WITH sub,r\n",
    "  MATCH (c:Concept {identifier: 'C43831'})\n",
    "  CREATE (r)-[:VALUE]->(c)\n",
    "  RETURN sub, c.submission"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query for the study data\n",
    "\n",
    "```cypher\n",
    "MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[:PARTICIPATES_IN]-(sub:Subject)\n",
    "MATCH (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q:Question)\n",
    "MATCH (sub)-[:RESPONDED]->(r:Response)-[:VALUE]->(c:Concept)\n",
    "RETURN DISTINCT s.identifier as STUDY, sub.identifier as SUBJID, q.identifier as Question, q.question_text as Text, c.submission as value\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>STUDY</th>\n",
       "        <th>SUBJID</th>\n",
       "        <th>Question</th>\n",
       "        <th>Text</th>\n",
       "        <th>value</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1235</td>\n",
       "        <td>Q1</td>\n",
       "        <td>Sex?</td>\n",
       "        <td>F</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>Q1</td>\n",
       "        <td>Sex?</td>\n",
       "        <td>F</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>Q2</td>\n",
       "        <td>Race?</td>\n",
       "        <td>ETHIOPIAN</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['http://data.acmepharma.com/clinicaltrial/12345', '1235', 'Q1', 'Sex?', 'F'],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345', '1234', 'Q1', 'Sex?', 'F'],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345',\n",
       "  '1234',\n",
       "  'Q2',\n",
       "  'Race?',\n",
       "  'ETHIOPIAN']]"
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[:PARTICIPATES_IN]-(sub:Subject)\n",
    "  MATCH (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q:Question)\n",
    "  MATCH (sub)-[:RESPONDED]->(r:Response)-[:VALUE]->(c:Concept)\n",
    "  RETURN DISTINCT s.identifier as STUDY, sub.identifier as SUBJID, q.identifier as Question, q.question_text as Text, c.submission as value"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "List out the responses to Q2, the identifier and the submission value\n",
    "\n",
    "```cypher\n",
    "MATCH (q:Question)-[:HAS_RESPONSE]->(c:Concept) WHERE q.identifier = 'Q2' RETURN c.identifier, c.submission\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "6 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>c.identifier</th>\n",
       "        <th>c.submission</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C77814</td>\n",
       "        <td>NORTHERN EUROPEAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C77816</td>\n",
       "        <td>WHITE CARIBBEAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C41259</td>\n",
       "        <td>AMERICAN INDIAN OR ALASKA NATIVE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C17998</td>\n",
       "        <td>UNKNOWN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C43851</td>\n",
       "        <td>EUROPEAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C43831</td>\n",
       "        <td>ETHIOPIAN</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['C77814', 'NORTHERN EUROPEAN'],\n",
       " ['C77816', 'WHITE CARIBBEAN'],\n",
       " ['C41259', 'AMERICAN INDIAN OR ALASKA NATIVE'],\n",
       " ['C17998', 'UNKNOWN'],\n",
       " ['C43851', 'EUROPEAN'],\n",
       " ['C43831', 'ETHIOPIAN']]"
      ]
     },
     "execution_count": 47,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (q:Question)-[:HAS_RESPONSE]->(c:Concept) WHERE q.identifier = 'Q2' RETURN c.identifier, c.submission"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "List out the RACE code list, again the identifier and the submission value\n",
    "\n",
    "```cypher\n",
    "MATCH (cl:Concept)-[:NARROWER]->(c:Concept) WHERE cl.identifier = 'C74457' RETURN c.identifier, c.submission\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>c.identifier</th>\n",
       "        <th>c.submission</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C41259</td>\n",
       "        <td>AMERICAN INDIAN OR ALASKA NATIVE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C41219</td>\n",
       "        <td>NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C16352</td>\n",
       "        <td>BLACK OR AFRICAN AMERICAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C41261</td>\n",
       "        <td>WHITE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>C41260</td>\n",
       "        <td>ASIAN</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['C41259', 'AMERICAN INDIAN OR ALASKA NATIVE'],\n",
       " ['C41219', 'NATIVE HAWAIIAN OR OTHER PACIFIC ISLANDER'],\n",
       " ['C16352', 'BLACK OR AFRICAN AMERICAN'],\n",
       " ['C41261', 'WHITE'],\n",
       " ['C41260', 'ASIAN']]"
      ]
     },
     "execution_count": 48,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (cl:Concept)-[:NARROWER]->(c:Concept) WHERE cl.identifier = 'C74457' RETURN c.identifier, c.submission"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "Now lets link RACE and RACEC. Create a query using an UNWIND which contains the mapping from the collected to the reported entries. We only setup those being used. \n",
    "\n",
    "Note this clause and the other one like it\n",
    "\n",
    "```cypher\n",
    "MATCH (race)-[:NARROWER]->(cli1:Concept) WHERE cli1.identifier = id.report\n",
    "```\n",
    "\n",
    "The *(race)-[:NARROWER]->* part is there to make sure we get the correct CLI node in case of nodes repeated across code lists (such as UNKNOWN)\n",
    "\n",
    "---\n",
    "\n",
    "```cypher\n",
    "MATCH (race:Concept {identifier: 'C74457'})\n",
    "MATCH (racec:Concept {identifier: 'C128689'})\n",
    "WITH race, racec\n",
    "UNWIND [{collect: 'C43831', report: 'C16352'}, {collect: 'C43851', report: 'C41261'}, {collect: 'C17998', report: ''}, {collect: 'C41259', report: 'C41259'}, {collect: 'C77816', report: 'C41261'}, {collect: 'C77814', report: 'C41261'}] AS id\n",
    "MATCH (race)-[:NARROWER]->(cli1:Concept) WHERE cli1.identifier = id.report\n",
    "MATCH (racec)-[:NARROWER]->(cli2:Concept) WHERE cli2.identifier = id.collect\n",
    "CREATE (cli1)-[:NARROWER]->(cli2)\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (race:Concept {identifier: 'C74457'})\n",
    "  MATCH (racec:Concept {identifier: 'C128689'})\n",
    "  WITH race, racec\n",
    "  UNWIND [{collect: 'C43831', report: 'C16352'}, {collect: 'C43851', report: 'C41261'}, {collect: 'C17998', report: ''}, {collect: 'C41259', report: 'C41259'}, {collect: 'C77816', report: 'C41261'}, {collect: 'C77814', report: 'C41261'}] AS id\n",
    "  MATCH (race)-[:NARROWER]->(cli1:Concept) WHERE cli1.identifier = id.report\n",
    "  MATCH (racec)-[:NARROWER]->(cli2:Concept) WHERE cli2.identifier = id.collect\n",
    "  CREATE (cli1)-[:NARROWER]->(cli2)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "List out what we just created. RACE CL -> RACE CLI -> RACEC CLI\n",
    "\n",
    "```cypher\n",
    "MATCH (race:Concept {identifier: 'C74457'})-[:NARROWER]->(c1:Concept)-[:NARROWER]->(c2:Concept)\n",
    "RETURN race.submission, c1.submission, c2.submission\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>race.submission</th>\n",
       "        <th>c1.submission</th>\n",
       "        <th>c2.submission</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>RACE</td>\n",
       "        <td>AMERICAN INDIAN OR ALASKA NATIVE</td>\n",
       "        <td>AMERICAN INDIAN OR ALASKA NATIVE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>RACE</td>\n",
       "        <td>BLACK OR AFRICAN AMERICAN</td>\n",
       "        <td>ETHIOPIAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>RACE</td>\n",
       "        <td>WHITE</td>\n",
       "        <td>EUROPEAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>RACE</td>\n",
       "        <td>WHITE</td>\n",
       "        <td>NORTHERN EUROPEAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>RACE</td>\n",
       "        <td>WHITE</td>\n",
       "        <td>WHITE CARIBBEAN</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['RACE',\n",
       "  'AMERICAN INDIAN OR ALASKA NATIVE',\n",
       "  'AMERICAN INDIAN OR ALASKA NATIVE'],\n",
       " ['RACE', 'BLACK OR AFRICAN AMERICAN', 'ETHIOPIAN'],\n",
       " ['RACE', 'WHITE', 'EUROPEAN'],\n",
       " ['RACE', 'WHITE', 'NORTHERN EUROPEAN'],\n",
       " ['RACE', 'WHITE', 'WHITE CARIBBEAN']]"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474\n",
    "  MATCH (race:Concept {identifier: 'C74457'})-[:NARROWER]->(c1:Concept)-[:NARROWER]->(c2:Concept)\n",
    "  RETURN race.submission, c1.submission, c2.submission"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Query the data from the graph and present in a semi-sdtm style. Match the subjects and their responses to the respective questions. The optional match is for the RACEC <-> RACE mapping. Note it is optional and also have a two NARROWER relationships. This ensures we only find the mapped values RACEC_CLI <- RACE_CLI <- RACE_CL and not RACEC_CLI <- RACE_CLI and the case we dont want which is RACEC_CLI <- RACEC_CL\n",
    "\n",
    "```cypher\n",
    "MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[:PARTICIPATES_IN]-(sub:Subject)\n",
    "MATCH (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q:Question)\n",
    "MATCH (sub)-[:RESPONDED]->(r:Response)-[:VALUE]->(c:Concept)\n",
    "OPTIONAL MATCH (c)<-[:NARROWER]-(rep:Concept)<-[:NARROWER]-(rep2:Concept)\n",
    "RETURN DISTINCT s.identifier as STUDY, sub.identifier as SUBJID, q.identifier as Question, q.question_text as Text, \n",
    "c.submission as Captured, rep.submission as Reported\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>STUDY</th>\n",
       "        <th>SUBJID</th>\n",
       "        <th>Question</th>\n",
       "        <th>Text</th>\n",
       "        <th>Captured</th>\n",
       "        <th>Reported</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>Q2</td>\n",
       "        <td>Race?</td>\n",
       "        <td>ETHIOPIAN</td>\n",
       "        <td>BLACK OR AFRICAN AMERICAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>Q1</td>\n",
       "        <td>Sex?</td>\n",
       "        <td>F</td>\n",
       "        <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1235</td>\n",
       "        <td>Q1</td>\n",
       "        <td>Sex?</td>\n",
       "        <td>F</td>\n",
       "        <td>None</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['http://data.acmepharma.com/clinicaltrial/12345',\n",
       "  '1234',\n",
       "  'Q2',\n",
       "  'Race?',\n",
       "  'ETHIOPIAN',\n",
       "  'BLACK OR AFRICAN AMERICAN'],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345',\n",
       "  '1234',\n",
       "  'Q1',\n",
       "  'Sex?',\n",
       "  'F',\n",
       "  None],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345',\n",
       "  '1235',\n",
       "  'Q1',\n",
       "  'Sex?',\n",
       "  'F',\n",
       "  None]]"
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[:PARTICIPATES_IN]-(sub:Subject)\n",
    "  MATCH (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q:Question)\n",
    "  MATCH (sub)-[:RESPONDED]->(r:Response)-[:VALUE]->(c:Concept)\n",
    "  OPTIONAL MATCH (c)<-[:NARROWER]-(rep:Concept)<-[:NARROWER]-(rep2:Concept)\n",
    "  RETURN DISTINCT s.identifier as STUDY, sub.identifier as SUBJID, q.identifier as Question, q.question_text as Text, \n",
    "    c.submission as Captured, rep.submission as Reported"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Add another subject and their data. Set up subject '1236' and responses to Q1 and Q2.\n",
    "\n",
    "```cypher\n",
    "MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})\n",
    "CREATE (s)<-[:PARTICIPATES_IN]-(sub:Subject {identifier: '1236'})\n",
    "WITH sub\n",
    "MATCH (q1:Question {identifier: 'Q1'}), (q2:Question {identifier: 'Q2'})\n",
    "CREATE (sub)-[:RESPONDED]->(r1:Response)-[:TO]->(q1)\n",
    "CREATE (sub)-[:RESPONDED]->(r2:Response)-[:TO]->(q2)\n",
    "WITH sub, r1, r2, q1, q2 \n",
    "MATCH (c1:Concept {identifier: 'C20197'})\n",
    "MATCH (c2:Concept {identifier: 'C77814'})\n",
    "CREATE (r1)-[:VALUE]->(c1)\n",
    "CREATE (r2)-[:VALUE]->(c2)\n",
    "RETURN sub\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 nodes created.\n",
      "1 properties set.\n",
      "7 relationships created.\n",
      "3 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>sub</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;identifier&#x27;: &#x27;1236&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'identifier': '1236'}]]"
      ]
     },
     "execution_count": 52,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})\n",
    "  CREATE (s)<-[:PARTICIPATES_IN]-(sub:Subject {identifier: '1236'})\n",
    "  WITH sub\n",
    "  MATCH (q1:Question {identifier: 'Q1'}), (q2:Question {identifier: 'Q2'})\n",
    "  CREATE (sub)-[:RESPONDED]->(r1:Response)-[:TO]->(q1)\n",
    "  CREATE (sub)-[:RESPONDED]->(r2:Response)-[:TO]->(q2)\n",
    "  WITH sub, r1, r2, q1, q2 \n",
    "  MATCH (c1:Concept {identifier: 'C20197'})\n",
    "  MATCH (c2:Concept {identifier: 'C77814'})\n",
    "  CREATE (r1)-[:VALUE]->(c1)\n",
    "  CREATE (r2)-[:VALUE]->(c2)\n",
    "  RETURN sub"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "And repeat the query we used earlier to report the data\n",
    "\n",
    "```cypher\n",
    "MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[:PARTICIPATES_IN]-(sub:Subject)\n",
    "MATCH (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q:Question)\n",
    "MATCH (sub)-[:RESPONDED]->(r:Response)-[:VALUE]->(c:Concept)\n",
    "OPTIONAL MATCH (c)<-[:NARROWER]-(rep:Concept)<-[:NARROWER]-(rep2:Concept)\n",
    "RETURN DISTINCT s.identifier as STUDY, sub.identifier as SUBJID, q.identifier as Question, q.question_text as Text, c.submission as Captured, rep.submission as Reported\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>STUDY</th>\n",
       "        <th>SUBJID</th>\n",
       "        <th>Question</th>\n",
       "        <th>Text</th>\n",
       "        <th>Captured</th>\n",
       "        <th>Reported</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1236</td>\n",
       "        <td>Q2</td>\n",
       "        <td>Race?</td>\n",
       "        <td>NORTHERN EUROPEAN</td>\n",
       "        <td>WHITE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1236</td>\n",
       "        <td>Q1</td>\n",
       "        <td>Sex?</td>\n",
       "        <td>M</td>\n",
       "        <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>Q2</td>\n",
       "        <td>Race?</td>\n",
       "        <td>ETHIOPIAN</td>\n",
       "        <td>BLACK OR AFRICAN AMERICAN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1234</td>\n",
       "        <td>Q1</td>\n",
       "        <td>Sex?</td>\n",
       "        <td>F</td>\n",
       "        <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>http://data.acmepharma.com/clinicaltrial/12345</td>\n",
       "        <td>1235</td>\n",
       "        <td>Q1</td>\n",
       "        <td>Sex?</td>\n",
       "        <td>F</td>\n",
       "        <td>None</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['http://data.acmepharma.com/clinicaltrial/12345',\n",
       "  '1236',\n",
       "  'Q2',\n",
       "  'Race?',\n",
       "  'NORTHERN EUROPEAN',\n",
       "  'WHITE'],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345',\n",
       "  '1236',\n",
       "  'Q1',\n",
       "  'Sex?',\n",
       "  'M',\n",
       "  None],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345',\n",
       "  '1234',\n",
       "  'Q2',\n",
       "  'Race?',\n",
       "  'ETHIOPIAN',\n",
       "  'BLACK OR AFRICAN AMERICAN'],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345',\n",
       "  '1234',\n",
       "  'Q1',\n",
       "  'Sex?',\n",
       "  'F',\n",
       "  None],\n",
       " ['http://data.acmepharma.com/clinicaltrial/12345',\n",
       "  '1235',\n",
       "  'Q1',\n",
       "  'Sex?',\n",
       "  'F',\n",
       "  None]]"
      ]
     },
     "execution_count": 53,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:ld123@localhost:7474 \n",
    "  MATCH (s:Study {identifier: 'http://data.acmepharma.com/clinicaltrial/12345'})<-[:PARTICIPATES_IN]-(sub:Subject)\n",
    "  MATCH (sub)-[:RESPONDED]->(r:Response)-[:TO]->(q:Question)\n",
    "  MATCH (sub)-[:RESPONDED]->(r:Response)-[:VALUE]->(c:Concept)\n",
    "  OPTIONAL MATCH (c)<-[:NARROWER]-(rep:Concept)<-[:NARROWER]-(rep2:Concept)\n",
    "  RETURN DISTINCT s.identifier as STUDY, sub.identifier as SUBJID, q.identifier as Question, q.question_text as Text, \n",
    "    c.submission as Captured, rep.submission as Reported"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
